Repository: octaG-M/python-docs-ro
Catalog: tutorial/appendix.po
Languages: ro

source: Appendix
ro: Anexă

source: Interactive Mode
ro: Modul interactiv

source: There are two variants of the interactive :term:`REPL`. The classic basic interpreter is supported on all platforms with minimal line control capabilities.
ro: Sunt disponibile două versiuni ale *buclei* interactive :term:`REPL` (Citește-Evaluează-Afișează-Reia). Dintre ele, modalitatea clasică de utilizare a interpretorului (de Python în terminal) este suportată de toate platformele moderne de calcul, doar că dispune de capacități minimale de control al elementelor introduse în linia de comandă.

source: On Windows, or Unix-like systems with :mod:`curses` support, a new interactive shell is used by default. This one supports color, multiline editing, history browsing, and paste mode. To disable color, see :ref:`using-on-controlling-color` for details. Function keys provide some additional functionality. :kbd:`F1` enters the interactive help browser :mod:`pydoc`. :kbd:`F2` allows for browsing command-line history with neither output nor the :term:`>>>` and :term:`...` prompts. :kbd:`F3` enters "paste mode", which makes pasting larger blocks of code easier. Press :kbd:`F3` to return to the regular prompt.
ro: Însă, atât în Windows cât și în sistemele de operare de tip Unix cu suport pentru :mod:`curses`, ne va fi pus la dispoziție, în mod predefinit, un interpretor interactiv nou. El dispune de colorarea itemilor (în linia de comandă), de editare multi-rând, de substituții în istoric, respectiv de modul *lipire* (de la englezescul, ca jargon informatic, *paste*). Pentru a dezafecta colorarea, găsiți detalii în :ref:`using-on-controlling-color`. Tastele *funcții* (tastele F: se accesează apăsând simultan :kbd:`Fn` și :kbd:`F_număr`) vă vor oferi un plus de funcționalitate. Astfel, :kbd:`F1` activează documentația interactivă de sprijin :mod:`pydoc`. :kbd:`F2` vă permite să parcurgeți istoricul liniei de comandă fără afișarea rezultatelor (execuției de comenzi) și nici a prompturilor :term:`>>>`, respectiv :term:`...`. Cu :kbd:`F3` se intră în "modul lipire", ceea ce va ușura lipirea unor blocuri (mai) consistente de cod. Pentru a ieși din acest mod (și a vă înapoia la promptul principal), apăsați încă o dată pe tasta (:kbd:`Fn` + ) :kbd:`F3`.

source: When using the new interactive shell, exit the shell by typing :kbd:`exit` or :kbd:`quit`. Adding call parentheses after those commands is not required.
ro: Atunci când utilizați noul interpretor de comenzi interactiv, pentru a ieși din el trebuie să tastați fie :kbd:`exit` fie :kbd:`quit`. Adăugarea de paranteze (ca la operatorul de apel) este opțională.

source: If the new interactive shell is not desired, it can be disabled via the :envvar:`PYTHON_BASIC_REPL` environment variable.
ro: Dacă nu vă interesează acest interpretor de comenzi interactiv, atunci îl puteți dezafecta cu ajutorul variabilei de mediu :envvar:`PYTHON_BASIC_REPL`.

source: Error Handling
ro: Tratarea erorilor

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit status; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
ro: Când survine o eroare, interpretorul va afișa atât un *mesaj de eroare* (corespunzător) cât și conținutul *stivei de apeluri* (de la englezescul, ca jargon informatic, *stack (back)trace*). Dacă vă aflați în modul interactiv, atunci interpretorul revine la promptul principal; în caz că programul provine dintr-un fișier, terminarea execuției se va realiza cu un *cod de ieșire* nenul, aceasta după ce a fost afișată stiva de apeluri. (Excepțiile tratate printr-o clauză :keyword:`except` dintr-o instrucțiune :keyword:`try` nu vor fi considerate, în acest context, drept erori.) Anumite erori sunt necondiționat fatale, drept pentru care ele vor cauza ieșirea din execuție cu un cod de ieșire nenul; printre ele se numără inconsistențele interne ale codului, respectiv anumite situații în care se epuizează spațiul alocat în memorie. Toate mesajele de eroare se scriu în *fluxul de eroare* (ori *canalul de eroare*) standard; încheierea corectă a execuției unei comenzi se scrie în *fluxul de ieșire* standard.

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
ro: Tastând *caracterul de întrerupere* (de obicei, :kbd:`Control-C` ori :kbd:`Delete`) a execuției, fie la promptul primar fie la cel secundar, vom produce oprirea introducerii de caractere de la tastatură și revenirea la promptul primar. [#]_ Dacă tastăm caracterul de întrerupere în timp ce se derulează vreo execuție de comandă, atunci va fi lansată o excepție :exc:`KeyboardInterrupt`, a cărei interceptare poate fi proiectată, de dumneavoastră înșivă, cu ajutorul unei instrucțiuni :keyword:`try`.

source: Executable Python Scripts
ro: Scripturi Python executabile

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
ro: În sistemele Unix de tip BSD, scripturile Python pot fi transformate în scripturi executabile direct, aidoma scripturilor interpretorului de comenzi activ în sesiunea de terminal, prin inserarea liniei de cod ::

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
ro: chiar la începutul scriptului, respectiv adăugând permisiunilor fișierului în care ați introdus scriptul și permisiunea ca acesta să poată fi executat (ceea ce înseamnă a-i atribui fișierului un *mod executabil*). Evident, am presupus că variabila de mediu :envvar:`PATH` din contul dumneavoastră de utilizator conține (și) calea de acces către interpretor. Este necesar ca simbolul bi-semn ``#!`` să fie așezat chiar la începutul fișierului. Pe anumite platforme, primul rând trebuie să se termine cu un caracter de încheiere de rând în stil Unix (adică, ``'\n'``) și nu cu cele două caractere (invizibile) care desemnează, în Windows, sfârșitul unui rând (``'\r\n'``). Nu uitați că *diezul*, denumit, în jargon informatic, caracter *hash*, ``'#'``, este întrebuințat în Python la începerea unui comentariu (de un rând).

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
ro: Pentru ca un script să primească un *mod executabil*, adică pentru a i se da *permisiunea* de a fi executat, vom folosi comanda :program:`chmod`.

source: $ chmod +x myscript.py
ro: $ chmod +x scriptul_meu.py

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
ro: În sistemele Windows nu există acest "mod executabil". Instalatorul de Python va realiza automat asocierea fișierelor ``.py`` cu ``python.exe``, așa că, printr-un clic dublu pe un (simbol grafic al unui) fișier Python, acesta va rula ca script. Dacă facem uz de extensia ``.pyw`` (în locul lui ``.py``), atunci fereastra terminalului, care apare la orice execuție de script, va fi suprimată.

source: The Interactive Startup File
ro: Fișierul de pornire pentru sesiunea interactivă

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
ro: Atunci când utilizați Python-ul în modul interactiv, este convenabil să aveți la îndemână un set de comenzi tipice, care să fie executate ori de câte ori porniți interpretorul. Puteți realiza așa ceva atribuindu-i unei variabile de mediu cu numele :envvar:`PYTHONSTARTUP` drept valoare numele fișierului în care ați introdus setul respectiv de comenzi. Un atare procedeu seamănă cu cel datorită căruia preparați conținutul fișierului de configurare (la nivel de cont de utilizator) :file:`.profile` al interpretoarelor de comenzi din sistemele Unix.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
ro: Fișierul (de pornire; de la englezescul, ca jargon informatic, *startup file*) va fi citit doar când deschideți o sesiune de lucru interactiv, nu și atunci când Python-ul își citește comenzile dintr-un fișier, și nici atunci când :file:`/dev/tty` este sursa explicită a comenzilor (`fișier <https://tldp.org/HOWTO/Text-Terminal-HOWTO-7.html>`_ care, altminteri, se comportă precum o sesiune interactivă). Execuția comenzilor din fișier va avea loc în același spațiu de nume unde se execută comenzile date interactiv, deci obiectele definite ori importurile făcute de comenzile din fișier vor putea fi utilizate fără *nume calificate* în timpul sesiunii interactive. De asemeni, puteți schimba promptul principal ``sys.ps1`` și promptul secundar ``sys.ps2`` în acest fișier de pornire.

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
ro: Dacă doriți să fie citit și un fișier de pornire adițional, situat în directorul curent, atunci puteți realiza acest lucru introducând în fișierul de pornire global un fragment de cod aidoma acestuia: ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. De asemeni, dacă sunteți interesați să întrebuințați fișierul de pornire într-un script, atunci va fi nevoie să îi adăugați acelui script un fragment de cod asemănător celui care urmează::

source: import os filename = os.environ.get('PYTHONSTARTUP') if filename and os.path.isfile(filename): with open(filename) as fobj: startup_file = fobj.read() exec(startup_file)
ro: import os numele_fișierului = os.environ.get('PYTHONSTARTUP') if numele_fișierului and os.path.isfile(numele_fișierului): with open(numele_fișierului) as obiectul_fișier: fișierul_de_pornire = obiectul_fișier.read() exec(fișierul_de_pornire)

source: The Customization Modules
ro: Module de personalizare

source: Python provides two hooks to let you customize it: :index:`sitecustomize` and :index:`usercustomize`. To see how it works, you need first to find the location of your user site-packages directory. Start Python and run this code::
ro: Python-ul ne pune la dispoziție două *ancore* (de la englezescul, ca jargon informatic, *hook*) pentru a-l personaliza: :index:`sitecustomize` (personalizare la nivel de *sistem*, adică *(on-)site* sau *la fața locului*) și :index:`usercustomize` (personalizare la nivel de *utilizator*). Pentru a observa funcționarea personalizării, începem prin a găsi calea de acces către directorul pachetelor disponibile *la fața locului* pentru utilizator. Astfel, vom rula codul Python de mai jos::

source: >>> import site >>> site.getusersitepackages() '/home/user/.local/lib/python3.x/site-packages'
ro: >>> import site >>> site.getusersitepackages() 'C:\Users\nume_de_utilizator\AppData\Roaming\Python\Python313\site-packages'

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
ro: Calea de acces fiind găsită, vom crea un fișier denumit :file:`usercustomize.py` în directorul respectiv și vom introduce în fișier comenzile dorite. Existența acestui fișier va influența toate invocările Python-ului, cu excepția situației în care pornirea se va face cu opțiunea :option:`-s`, opțiune care dezactivează importurile automate.

source: :index:`sitecustomize` works in the same way, but is typically created by an administrator of the computer in the global site-packages directory, and is imported before :index:`usercustomize`. See the documentation of the :mod:`site` module for more details.
ro: Ancora :index:`sitecustomize` funcționează la fel, doar că fișierul ei va fi creat de către unul din administratorii sistemului dumneavoastră de calcul și plasat într-unul din directoarele care fac parte din lista directoarelor (globale ale) pachetelor instalate la nivel de *sistem*, însă tot *la fața locului* (listă găsită cu ``site.getsitepackages()``), acest fișier :file:`sitecustomize.py` fiind importat înaintea celui corespunzând ancorei :index:`usercustomize`. A se vedea documentația modulului :mod:`site` pentru mai multe detalii.

source: Footnotes
ro: Note de subsol

source: A problem with the GNU Readline package may prevent this.
ro: O anumită defecțiune din pachetul GNU Readline ar putea să împiedice aceasta.
