Repository: octaG-M/python-docs-ro
Catalog: tutorial/appetite.po
Languages: ro

source: Whetting Your Appetite
ro: Deschizându-vă apetitul

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
ro: Dacă lucrați mult pe calculator, atunci ați întâlnit activități pe care v-ar plăcea să le automatizați. De exemplu, poate că doriți să realizați o căutare-cu-înlocuire într-un număr mare de fișiere text, ori să redenumiți și să rearanjați un set de fișiere foto într-un fel sofisticat. Poate că v-ar plăcea să scrieți o mică bază de date personalizată, ori o aplicație GUI specializată, ori un joc simplu.

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
ro: Dacă sunteți un dezvoltator software profesionist, atunci poate că trebuie să utilizați anumite biblioteci C/C++/Java însă constatați că ciclul tipic scrie/compilează/testează/recompilează durează prea mult. Poate că scrieți o suită de teste pentru o asemenea bibliotecă și constatați că scrierea codului de testare este o sarcină sâcâitoare. Ori poate că ați scris un program căruia i-ar fi de folos un limbaj de extindere dar nu doriți nici să proiectați și nici să implementați un întreg limbaj nou pentru o singură aplicație.

source: Python is just the language for you.
ro: Python-ul este limbajul potrivit pentru dumneavoastră.

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, macOS, and Unix operating systems, and will help you get the job done more quickly.
ro: Ați putea scrie un script de comenzi Unix ori niște fișiere de comenzi Windows pentru unele din aceste sarcini, doar că scripturile de comenzi se pricep cel mai bine la mutări de fișiere și la modificări de text și nu se prea potrivesc la aplicații GUI și nici la jocuri. Ați putea scrie un program C/C++/Java, numai că până și prima schiță a lui vă va înghiți o mulțime de timp. Python-ul se folosește mai simplu, este disponibil în sistemele de operare Windows, macOS și Unix și vă va ajuta să vă faceți treaba repede.

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
ro: Python-ul este simplu de folosit, însă este un limbaj de programare adevărat, care oferă mult mai multă structurare și suport pentru programele de dimensiuni mari decât o pot face script-urile de comenzi ori fișierele de comenzi. Pe de altă parte, Python-ul oferă și mult mai multă verificare a erorilor decât C-ul, apoi, fiind un *limbaj de nivel foarte înalt*, are predefinite tipuri de date de nivel înalt, precum tablourile flexibile și dicționarele. Datorită tipurilor sale de date mai generale, Python-ul este utilizabil într-o problematică mult mai largă decât Awk-ul sau chiar decât Perl-ul, iar multe chestiuni se rezolvă cel puțin la fel de ușor în Python ca în aceste limbaje.

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
ro: Python-ul vă permite să vă împărțiți programul în module care pot fi reutilizate în alte programe Python. El vine cu o mare colecție de module standard pe care le puteți folosi drept bază a programelor dumneavoastră --- sau ca exemple atunci când veți începe să învățați programarea în Python. Unele din aceste module oferă facilități pentru I/E de fișiere, apeluri de sistem, socluri și chiar interfețe cu seturile de unelte dedicate interfeței grafice cu utilizatorul cum ar fi Tk-ul.

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
ro: Python-ul este un limbaj interpretat, care vă poate economisi timp considerabil pe perioada dezvoltării unui program deoarece nu va fi nevoie nici de compilare și nici de editarea legăturilor. Interpretorul poate fi utilizat în mod interactiv, ceea ce ușurează experimentarea caracteristicilor limbajului, scrierea unor programe de unică folosință, ori testarea de funcții în timpul dezvoltării unui program de-jos-în-sus. În plus, este un calculator de birou la îndemână.

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
ro: Python-ul permite ca programele să fie scrise compact și lizibil. Programele scrise în Python sunt de obicei mult mai scurte decât programele C, C++ sau Java echivalente lor, din mai multe motive:

source: the high-level data types allow you to express complex operations in a single statement;
ro: tipurile de date de nivel înalt vă permit să exprimați operații complexe într-o singură instrucțiune;

source: statement grouping is done by indentation instead of beginning and ending brackets;
ro: gruparea instrucțiunilor se face prin indentare în loc de acolade de început și de sfârșit;

source: no variable or argument declarations are necessary.
ro: nu sunt necesare declarațiile de variabile ori de argumente.

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
ro: Python-ul este *extensibil*: dacă știți să programați în C, va fi ușor să adăugați o nouă funcție predefinită sau un nou modul la interpretor, fie pentru a efectua operații critice la viteză maximă, fie pentru a lega programele Python la biblioteci ce pot fi accesate numai în formă binară (precum o bibliotecă grafică comercială). Iar când vă va prinde microbul Python-ului, îi veți putea lega interpretorul la o aplicație scrisă în C ca să-l folosiți fie pe post de limbaj de extensie fie pe post de limbaj de comenzi pentru respectiva aplicație.

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
ro: Apropo, limbajul a fost denumit după emisiunea "Circul zburător al lui Monty Python" a canalului BBC și nu are nimic de-a face cu reptilele. Referirile la scenetele din Monty Python în documentație nu numai că sunt permise, ele sunt încurajate!

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
ro: Acum că sunteți nerăbdător să aflați despre Python, veți dori să-l examinați mai îndeaproape. Și cum cea mai bună metodă de a învăța un limbaj este să-l folosiți, tutorialul de față vă invită să vă jucați cu interpretorul de Python pe parcursul lecturii.

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
ro: În capitolul următor vă vor fi explicate mecanismele de utilizare a interpretorului. Chiar dacă va părea ceva neimportant, aceste informații vor fi esențiale atunci când veți testa exemplele care vă vor fi prezentate.

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
ro: Restul tutorialului introduce diverse caracteristici ale limbajului și sistemului Python cu ajutorul exemplelor, începând cu expresii simple, instrucțiuni și tipuri de date, continuând cu funcții și module și în final atingând concepte avansate precum excepțiile și clasele definite de către utilizator.
