Repository: octaG-M/python-docs-ro
Catalog: tutorial/classes.po
Languages: ro

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
ro: Adeseori, primul argument al unei metode este numit ``self``. Aceasta nu este decât o convenție: numele ``self`` nu posedă nicio semnificație aparte pentru Python. Remarcați, însă, că dacă nu vă veți face obiceiul de a-l folosi, atunci s-ar putea întâmpla ca programul dumneavoastră să le provoace dificultăți la lectură altor programatori în Python, după cum s-ar putea și să aveți greutăți cu vreo aplicație *cititor de clase* care se bazează tocmai pe această convenție de nume.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
ro: Orice obiect funcție care este (și) atribut de clasă definește o metodă pentru instanțele clasei în cauză. Nu este obligatoriu ca definiția funcției respective să fie literalmente parte din definiția clasei: este suficient să îi asignăm unei variabile locale din clasă un obiect funcție. De exemplu::

source: # Function defined outside the class def f1(self, x, y): return min(x, x+y) class C: f = f1 def g(self): return 'hello world' h = g
ro: # Funcție definită în afara clasei def f1(self, x, y): return min(x, x+y) class C: f = f1 def g(self): return 'salutare, lume' h = g

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`!C` that refer to function objects, and consequently they are all methods of instances of :class:`!C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
ro: Aici, ``f``, ``g`` și ``h`` îi sunt cu toatele atribute clasei :class:`!C` și se referă la obiecte funcție, din care motiv ele le vor fi metode tuturor instanțelor lui :class:`!C` --- ``h`` nefiind nimic altceva decât ``g``. Atenție la faptul că o astfel de abordare va reuși doar să-i provoace confuzii vreunui cititor al programului dumneavoastră.

source: Methods may call other methods by using method attributes of the ``self`` argument::
ro: Metodele pot apela alte metode folosind atributele de metodă ale argumentului ``self``::

source: class Bag: def __init__(self): self.data = [] def add(self, x): self.data.append(x) def addtwice(self, x): self.add(x) self.add(x)
ro: class Punga: def __init__(self): self.datele = [] def adaugă(self, x): self.datele.append(x) def adaugă_dublu(self, x): self.adaugă(x) self.adaugă(x)

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
ro: Metodele se pot referi la numele globale în același fel ca funcțiile obișnuite. Domeniul de valabilitate global care i se asociază unei metode este chiar modulul care conține definiția metodei. (O clasă, ca atare, nu se folosește niciodată pe post de domeniu de valabilitate global.) Chiar dacă nu vom avea decât arareori motive serioase să întrebuințăm date globale în vreo metodă, există numeroase utilizări legitime ale domeniului de valabilitate global: cum ar fi, funcțiile și modulele importate în domeniul de valabilitate global pot fi folosite atât de către metode cât și de către funcțiile ori clasele care au fost definite în el. În mod obișnuit, clasa care conține o anumită metodă este ea însăși definită în acest domeniu de valabilitate global, iar noi vom face cunoștință în secțiunea următoare cu mai multe motive întemeiate ca o metodă oarecare să dorească să se refere la propria sa clasă.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
ro: Orice valoare este, în sine, un obiect și dispune, ca atare, de o *clasă* (aceasta mai numindu-se și *tipul* valorii). Clasa respectivă este stocată drept ``obiectul_nostru.__class__``.

source: Inheritance
ro: Moștenirea

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
ro: Așa cum se înțelege de la sine, o caracteristică a indiferent cărui limbaj de programare n-ar putea fi socotită "de clasă" dacă nu le-ar face față cum se cuvine *moștenirilor* (dificultăților...). În cazul Python-ului, sintaxa pentru definirea unei clase *derivate* (dintr-o clasă *de bază*) arată după cum urmează::

source: class DerivedClassName(BaseClassName): <statement-1> . . . <statement-N>
ro: class NumeleClaseiDerivate(NumeleClaseiDeBază): <instrucțiunea-1> . . . <instrucțiunea-N>

source: The name :class:`!BaseClassName` must be defined in a namespace accessible from the scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
ro: Numele :class:`!NumeleClaseiDeBază` trebuie să fie definit într-un spațiu de nume ce poate fi accesat din domeniul de valabilitate în care a fost introdusă definiția clasei derivate despre care discutăm. Sunt permise, în locul unui nume de clasă cu rolul de clasă de bază, (și) expresii oarecare. O astfel de flexibilitate în definiții se va dovedi folositoare atunci când, de exemplu, clasa de bază este situată în alt modul::

source: class DerivedClassName(modname.BaseClassName):
ro: class NumeleClaseiDerivate(nume_de_modul.NumeleClaseiDeBază):

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
ro: Execuția (codului) unei definiții de clasă derivată se realizează în același fel cu execuția (codului) unei clase de bază. Atunci când este construit obiectul clasă (derivată), interpretorul *își amintește* (și) de clasa de bază. Această proprietate se întrebuințează la rezolvarea referințelor de atribute: dacă vreun atribut căutat nu se găsește în codul clasei (derivate), căutarea sa va trece la codul clasei de bază. O atare regulă va fi aplicată *recursiv* dacă clasa de bază se dovedește a fi, la rândul său, derivată din altă clasă.

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
ro: Nimic deosebit nu se va întâmpla la instanțierea claselor derivate: ca și până acum, ``NumeleClaseiDerivate()`` va crea o instanță (nouă) a clasei respective. Referințele la metode sunt rezolvate astfel: se caută atributul de clasă corespunzător, coborând, la nevoie, pe *lanțul* (`dependențelor <https://en.wikipedia.org/wiki/Dependency_hell>`_) care duce până la clasele de bază, apoi, odată găsit numele, referința metodei este considerată validă dacă ea întoarce un obiect funcție.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
ro: Clasele derivate au dreptul să-și suprascrie metodele (moștenite) de la clasele de bază. Deoarece metodele nu beneficiază de privilegii anume atunci când apelează metode ale aceluiași obiect, o metodă aparținând unei clase de bază care apelează altă metodă definită în aceeași clasă de bază poate avea surpriza că a apelat, de fapt, metoda unei clase derivate care a suprascris metoda (teoretic) apelată. (Pentru programatorii în C++: toate metodele din Python sunt efectiv ``virtuale``.)

source: An overriding method in a derived class may in fact want to extend rather than simply replace the base class method of the same name. There is a simple way to call the base class method directly: just call ``BaseClassName.methodname(self, arguments)``. This is occasionally useful to clients as well. (Note that this only works if the base class is accessible as ``BaseClassName`` in the global scope.)
ro: O metodă suprascrisă într-o clasă derivată dorește, cel mai adesea, să extindă și nu să înlocuiască pur și simplu metoda omonimă din clasa de bază. Dispunem de un procedeu necomplicat pentru a apela în mod direct metoda unei clase de bază: apelați, de-a dreptul, ``NumeleClaseiDeBază.numele_metodei(self, restul_argumentelor)``. O atare proprietate le folosește și clienților. (Țineți seama de faptul că ea funcționează doar atunci când clasa de bază este accesibilă sub denumirea de ``NumeleClaseiDeBază`` în domeniul de valabilitate global.)

source: Python has two built-in functions that work with inheritance:
ro: Python-ul are două funcții predefinite care conlucrează cu moștenirea:

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
ro: Utilizați :func:`isinstance` pentru a verifica tipul unei instanțe: ``isinstance(obiectul_în_cauză, int)`` va întoarce ``True`` dacă și numai dacă ``obiectul_în_cauză.__class__`` este fie :class:`int` fie altă clasă derivată din :class:`int`.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
ro: Întrebuințați :func:`issubclass` pentru a testa moștenirea unei clase: ``issubclass(bool, int)`` va returna ``True`` pentru că :class:`bool` este o *subclasă* (adică, o *moștenitoare*; sau o *urmașă*) a lui :class:`int`. În schimb, ``issubclass(float, int)`` va întoarce ``False`` dat fiind că :class:`float` nu îi este subclasă lui :class:`int`.

source: Multiple Inheritance
ro: Moștenirea multiplă

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
ro: Python-ul permite și o anumită formă de `moștenire multiplă <https://isocpp.org/wiki/faq/multiple-inheritance>`_. Definiția unei clase care moștenește *mai multe* clase de bază arată în felul următor::

source: class DerivedClassName(Base1, Base2, Base3): <statement-1> . . . <statement-N>
ro: class NumeleClaseiDerivate(ClasaDeBază1, ClasaDeBază2, ClasaDeBază3): <instrucțiunea-1> . . . <instrucțiunea-N>

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`!DerivedClassName`, it is searched for in :class:`!Base1`, then (recursively) in the base classes of :class:`!Base1`, and if it was not found there, it was searched for in :class:`!Base2`, and so on.
ro: În cele mai multe dintre situațiile obișnuite (a se citi *simple*), ne putem imagina *căutarea* unui atribut moștenit de la o clasă părinte ca efectuându-se `în adâncime <https://en.wikipedia.org/wiki/Depth-first_search>`_ (de la englezescul, în jargon informatic, *depth-first*), *de la stânga la dreapta*, fără să se caute de două ori în aceeași clasă în cazul unor *suprapuneri* în `ierarhie <https://en.wikipedia.org/wiki/Class_hierarchy>`_ (adică, în ansamblul claselor legate între ele prin mecanismele moștenirii). Astfel, dacă atributul căutat nu este găsit în :class:`!NumeleClaseiDerivate`, el va fi căutat (mai întâi) în clasa de bază :class:`!ClasaDeBază1`, apoi (recursiv) în clasele de bază ale lui :class:`!ClasaDeBază1`, după care, dacă nu a fost găsit încă, va fi căutat în :class:`!ClasaDeBază2` șamd.

source: In fact, it is slightly more complex than that; the method resolution order changes dynamically to support cooperative calls to :func:`super`. This approach is known in some other multiple-inheritance languages as call-next-method and is more powerful than the super call found in single-inheritance languages.
ro: În realitate, procedurile sunt oarecum mai complexe decât schița anterioară; ordinea (căutărilor) în procedura de *rezolvare* a unei metode se schimbă în mod dinamic pentru a permite apeluri cooperatiste ale lui :func:`super`. O atare abordare este cunoscută în vocabularul unor limbaje de programare care implementează moștenirea multiplă drept *apelul metodei următoare* și dovedește mai multă eficacitate decât *apelul lui super* utilizat în limbajele de programare care întrebuințează doar moștenirea simplă.

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see :ref:`python_2.3_mro`.
ro: Ordonarea dinamică este necesară pentru că în toate cazurile de moștenire multiplă survin relațiile în `formă de diamant <https://en.wikipedia.org/wiki/Multiple_inheritance>`_ dintre clase (în care cel puțin una din clasele părinte va putea fi accesată de către măcar o clasă urmaș prin *cel puțin două drumuri* care să plece din clasa părinte, să parcurgă un subset de muchii ale arborelui moștenirii și să se încheie la clasa urmaș respectivă). De exemplu, toate clasele moștenesc clasa :class:`object`, din care motiv, în cazul unei moșteniri multiple, vor exista mai multe căi de acces la :class:`object`. Pentru a împiedica accesul la indiferent care clasă de bază pe mai multe căi (deci *de mai multe ori* într-o singură căutare), algoritmul dinamic de căutare va liniariza ordinea acesteia în așa fel încât să fie păstrată ordonarea de la stânga la dreapta specificată pentru fiecare clasă, ordonare care apelează fiecare părinte o singură dată și care este *monotonă* (adică, în raport cu care o clasă poate fi făcută subclasă a cuiva fără să fie afectată ordonarea realizată până la momentul respectiv a *strămoșilor* ei). Luate împreună, aceste particularități ale Python-ului ne permit să proiectăm ierarhii de clase stabile și ușor de extins în care să avem moștenire multiplă. Pentru mai multe detalii, a se vedea :ref:`python_2.3_mro`.

source: Private Variables
ro: Variabile private

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
ro: În Python nu există variabile de instanță "private", adică variabile care să nu poată fi accesate decât din interiorul instanței respective. Cu toate acestea, dispunem de o convenție respectată de aproape întreg codul Python: orice nume prefixat de o *bară jos* (adică, de o *liniuță de subliniere*; precum în ``_șuncă``) trebuie socotit drept parte non-publică a API-ului (indiferent dacă este vorba de o funcție, de o metodă ori de o dată membru). Numele respectiv trebuie, așadar, tratat cu grija pe care o avem pentru un detaliu de implementare, despre care știm că s-ar putea schimba oricând, fără să fim anunțați.

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
ro: Deoarece există, în practica POO, un caz de întrebuințare valid pentru membrii privați ai unei clase (mai precis, procedeul prin care să evităm *conflictele de nume* cu numele definite de clasele urmaș), avem la îndemână în Python un suport restrâns pentru un atare mecanism, denumit :dfn:`transformare de nume` (de la englezescul *name mangling*). Astfel, orice identificator de forma ``__șuncă`` (cel puțin două bare jos pe post de prefixe și cel mult o bară jos pe post de sufix) va fi înlocuit în textul programului cu ``_numeleclasei__șuncă``, unde ``numeleclasei`` desemnează numele de clasă curent, cu prefixul ori prefixele eliminat(e). Această transformare de nume se va realiza indiferent de poziția sintactică a identificatorului, atâta timp când aceasta se găsește în interiorul unei definiții de clasă.

source: The :ref:`private name mangling specifications <private-name-mangling>` for details and special cases.
ro: :ref:`Specificațiile transformărilor de nume private <private-name-mangling>` pentru detalii și cazuri speciale.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
ro: Transformarea de nume este utilă la a le permite subclaselor să suprascrie diverse metode fără să strice apelurile de metode intra-clasă. Ca exemplu::

source: class Mapping: def __init__(self, iterable): self.items_list = [] self.__update(iterable) def update(self, iterable): for item in iterable: self.items_list.append(item) __update = update # private copy of original update() method class MappingSubclass(Mapping): def update(self, keys, values): # provides new signature for update() # but does not break __init__() for item in zip(keys, values): self.items_list.append(item)
ro: class Mapare: def __init__(self, iterabilul): self.lista_de_itemi = [] self.__actualizează(iterabilul) def actualizează(self, iterabilul): for itemul in iterabilul: self.lista_de_itemi.append(itemul) __actualizează = actualizează # copie privată a metodei # actualizează() originale class SubclasaLuiMapare(Mapare): def actualizează(self, cheile, valorile): # îi oferă o nouă signatură lui actualizează() # fără să-l strice pe __init__() for itemul in zip(cheile, valorile): self.lista_de_itemi.append(itemul)

source: The above example would work even if ``MappingSubclass`` were to introduce a ``__update`` identifier since it is replaced with ``_Mapping__update`` in the ``Mapping`` class and ``_MappingSubclass__update`` in the ``MappingSubclass`` class respectively.
ro: Exemplul de deasupra va funcționa chiar și în cazul când în ``SubclasaLuiMapare`` am introduce un identificator ``__actualizează`` și aceasta pentru că identificatorul în cauză va fi înlocuit cu ``_Mapare__actualizează`` în clasa ``Mapare``, respectiv cu ``_SubclasaLuiMapare__actualizează`` în clasa ``SubclasaLuiMapare``.

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
ro: Nu uitați că regulile de transformare ale numelor au fost proiectate mai ales pentru a ne feri de accidente; este posibil, în pofida lor, să accesați, respectiv să modificați orice variabilă socotită drept *privată*. O asemenea libertate ne poate fi de folos în circumstanțe deosebite, precum cele ale întrebuințării unui depanator de programe (de la englezescul *debugger*).

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
ro: Țineți seama (și) de faptul că, indiferent de cod îi transmiteți fie lui ``exec()`` fie lui ``eval()``, acesta nu va considera numele de clasă al clasei care a făcut invocarea (uneia din cele două funcții) drept numele clasei curente; o atare situație seamănă cu efectul produs de execuția instrucțiunii ``global``, efect care este restrâns doar la codul compilat într-un singur fragment de cod-de-octeți. Aceeași restricție le privește și pe ``getattr()``, ``setattr()`` și ``delattr()``, precum și pe orice referențiere directă a lui ``__dict__``.

source: Odds and Ends
ro: Șurubărie

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. The idiomatic approach is to use :mod:`dataclasses` for this purpose::
ro: Ne servește uneori să avem la îndemână un tip de date asemănător celui numit "record" în Pascal, respectiv lui "struct" din C, tip care să pună laolaltă mai mulți itemi de date cu denumiri (individuale). Procedeul idiomatic pentru așa ceva (în Python) este dat de :mod:`dataclasses`::

source: from dataclasses import dataclass @dataclass class Employee: name: str dept: str salary: int
ro: from dataclasses import dataclass @dataclass class Angajatul: numele: str departamentul: str salariul: int

source: >>> john = Employee('john', 'computer lab', 1000) >>> john.dept 'computer lab' >>> john.salary 1000
ro: >>> popescu = Angajatul('popescu', 'sala de calculatoare', 1000) >>> popescu.departamentul 'sala de calculatoare' >>> popescu.salariul 1000
