Repository: octaG-M/python-docs-ro
Catalog: tutorial/classes.po
Languages: ro

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.readline` that get the data from a string buffer instead, and pass it as an argument.
ro: Unui fragment de program Python care se așteaptă să primească un anumit tip de date abstracte îi putem transmite, de cele mai multe ori, pe post de înlocuitor o clasă care *emulează* metodele tipului de date respectiv. De exemplu, admițând că dispunem de o funcție care formatează diverse date preluate dintr-un obiect fișier, putem defini mai întâi o clasă căreia să-i aparțină metodele :meth:`~io.TextIOBase.read` și :meth:`~io.TextIOBase.readline`, metode capabile să extragă datele dintr-o memorie-tampon (de la englezescul *buffer*) dedicată stocării (temporare a) șirurilor de caractere, după care îi putem transmite funcției de formatare această clasă în calitate de argument.

source: :ref:`Instance method objects <instance-methods>` have attributes, too: :attr:`m.__self__ <method.__self__>` is the instance object with the method :meth:`!m`, and :attr:`m.__func__ <method.__func__>` is the :ref:`function object <user-defined-funcs>` corresponding to the method.
ro: :ref:`Obiectele metodă de instanță <instance-methods>` posedă, și ele, atribute: :attr:`metoda.__self__ <method.__self__>` este obiectul instanță căruia îi aparține metoda :meth:`!metoda`, respectiv :attr:`metoda.__func__ <method.__func__>` este :ref:`obiectul funcție <user-defined-funcs>` care îi corespunde metodei în cauză (adică, lui :meth:`!metoda`).

source: Iterators
ro: Iteratori

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
ro: Deja ați remarcat, probabil, că majoritatea obiectelor *container* pot fi inspectate în mod iterativ (de la englezescul, în jargon informatic, *loop over*; vom întrebuința și constructele *iterate de-a lungul*, respectiv *iterate în lung*) folosind o instrucțiune de ciclare :keyword:`for`::

source: for element in [1, 2, 3]: print(element) for element in (1, 2, 3): print(element) for key in {'one':1, 'two':2}: print(key) for char in "123": print(char) for line in open("myfile.txt"): print(line, end='')
ro: for elementul in [1, 2, 3]: print(elementul) for elementul in (1, 2, 3): print(elementul) for cheia in {'unu':1, 'doi':2}: print(cheia) for cheia in "123": print(cheia) for rândul in open("fișierul_meu_text.txt"): print(rândul, end='')

source: This style of access is clear, concise, and convenient. The use of iterators pervades and unifies Python. Behind the scenes, the :keyword:`for` statement calls :func:`iter` on the container object. The function returns an iterator object that defines the method :meth:`~iterator.__next__` which accesses elements in the container one at a time. When there are no more elements, :meth:`~iterator.__next__` raises a :exc:`StopIteration` exception which tells the :keyword:`!for` loop to terminate. You can call the :meth:`~iterator.__next__` method using the :func:`next` built-in function; this example shows how it all works::
ro: Acest stil de acces la itemi este clar, concis și convenabil. Utilizarea iteratorilor constituie o practică sistematică, cu caracter unificator, în Python. În culise, instrucțiunea :keyword:`for` face apel la :func:`iter` având drept argument obiectul container. Funcția va întoarce un obiect *iterator*, care definește metoda :meth:`~iterator.__next__`, metodă ce accesează în mod secvențial elementele containerului respectiv. Atunci când nu mai întâlnește niciun item (al containerului), :meth:`~iterator.__next__` va lansa o excepție :exc:`StopIteration` pentru a-i spune buclei :keyword:`!for` să se încheie. Puteți apela metoda :meth:`~iterator.__next__` cu ajutorul funcției prestabilite :func:`next`; exemplul următor vă dezvăluie cum trebuie procedat::

source: >>> s = 'abc' >>> it = iter(s) >>> it <str_iterator object at 0x10c90e650> >>> next(it) 'a' >>> next(it) 'b' >>> next(it) 'c' >>> next(it) Traceback (most recent call last): File "<stdin>", line 1, in <module> next(it) StopIteration
ro: >>> șirul = 'abc' >>> iteratorul = iter(șirul) >>> iteratorul <str_iterator object at 0x10c90e650> >>> next(iteratorul) 'a' >>> next(iteratorul) 'b' >>> next(iteratorul) 'c' >>> next(iteratorul) Traceback (most recent call last): File "<stdin>", line 1, in <module> next(iteratorul) StopIteration

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`~container.__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`!__next__`, then :meth:`!__iter__` can just return ``self``::
ro: Le putem acum, dat fiind că tocmai am văzut mecanismul prin care se pune în practică *protocolul* iteratorilor, adăuga un *comportament* de iterator claselor noastre. Este suficient să definim o metodă :meth:`~container.__iter__`, care să întoarcă un obiect ce posedă o metodă :meth:`~iterator.__next__`. În caz că clasa noastră îl definește ea însăși pe :meth:`!__next__`, metoda :meth:`!__iter__` nu mai are de făcut decât să-l returneze pe ``self`` (apelantului)::

source: class Reverse: """Iterator for looping over a sequence backwards.""" def __init__(self, data): self.data = data self.index = len(data) def __iter__(self): return self def __next__(self): if self.index == 0: raise StopIteration self.index = self.index - 1 return self.data[self.index]
ro: class ÎntorsulPeDos: """Un iterator pentru a itera de-a lungul unei secvențe, în sens invers.""" def __init__(self, datele): self.datele = datele self.indexul = len(datele) def __iter__(self): return self def __next__(self): if self.indexul == 0: raise StopIteration self.indexul = self.indexul - 1 return self.datele[self.indexul]

source: >>> rev = Reverse('spam') >>> iter(rev) <__main__.Reverse object at 0x00A1DB50> >>> for char in rev: ... print(char) ... m a p s
ro: >>> reversul = ÎntorsulPeDos('arca') >>> iter(reversul) <__main__.ÎntorsulPeDos object at 0x00A1DB50> >>> for caracterul in reversul: ... print(caracterul) ... a c r a

source: Generators
ro: Generatori

source: :term:`Generators <generator>` are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
ro: :term:`Generatorii <generator>` sunt o unealtă puternică, ușor de folosit la construcția de iteratori. Codul Python al generatorilor este asemeni celui al unei funcții obișnuite cu excepția faptului că întrebuințează instrucțiunea :keyword:`yield` (în loc de *return*) ori de câte ori trebuie întoarse date (apelantului). De fiecare dată când un generator va fi (re)folosit drept argument al lui :func:`next`, *el își va continua activitatea* (dat fiind că un generator *își amintește* toate valorile datelor precum și ultima instrucție executată de la apelul precedent al lui *next*). Exemplul dat în continuare vă arată că generatorii sunt banal de creat::

source: def reverse(data): for index in range(len(data)-1, -1, -1): yield data[index]
ro: def întoarce_pe_dos(datele): for indexul in range(len(datele)-1, -1, -1): yield datele[indexul]

source: >>> for char in reverse('golf'): ... print(char) ... f l o g
ro: >>> for caracterul in intoarce_pe_dos('trop'): ... print(caracterul) ... p o r t

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`~iterator.__iter__` and :meth:`~generator.__next__` methods are created automatically.
ro: Orice poate fi realizat folosind iteratorii bazați (explicit) pe clase, vezi cele prezentate în secțiunea anterioară, poate fi obținut și cu generatori. Ceea ce face codul acestora din urmă atât de compact este faptul că metodele :meth:`~iterator.__iter__` și :meth:`~generator.__next__` sunt create automat.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
ro: Altă trăsătură cheie a generatorilor este aceea că atât variabilele locale cât și starea de la momentul execuției sunt salvate automate între apeluri. Din acest motiv, codul funcției (generator) este mai ușor de scris și mult mai clar în exprimarea ideilor decât ceea ce putem realiza cu o abordare (complicată) în care avem de folosit variabile de instanță precum ``self.indexul`` și ``self.datele``.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
ro: În afară de creatul automat de metode și de salvatul stării programului, generatorii au proprietatea că, atunci când își termină iterarea, vor lansa automat o :exc:`StopIteration`. Luate împreună, aceste caracteristici ne permit să construim iteratori cu același efort ca la scrierea codului unei funcții oarecare.

source: Generator Expressions
ro: Expresii generator

source: Some simple generators can be coded succinctly as expressions using a syntax similar to list comprehensions but with parentheses instead of square brackets. These expressions are designed for situations where the generator is used right away by an enclosing function. Generator expressions are more compact but less versatile than full generator definitions and tend to be more memory friendly than equivalent list comprehensions.
ro: Generatorii simpli pot fi introduși succint în codul Python ca *expresii* (generator) a căror sintaxă seamănă cu cea de la comprehensiunea listelor, excepție făcând faptul că acolo erau folosite paranteze drepte pe când aici vom întrebuința paranteze rotunde. Astfel de expresii sunt proiectate pentru situații când este nevoie de un generator (simplu) care să fie utilizat de îndată (ce a fost citit de interpretor) de către funcția în codul căreia a fost inserat. Expresiile generator sunt (încă și) mai compacte deși mai puțin versatile decât definițiile complete de generatori, respectiv tind să fie mai prietenoase în privința consumului de memorie decât comprehensiunile de liste corespondente.

source: Examples::
ro: Exemple::

source: >>> sum(i*i for i in range(10)) # sum of squares 285 >>> xvec = [10, 20, 30] >>> yvec = [7, 5, 3] >>> sum(x*y for x,y in zip(xvec, yvec)) # dot product 260 >>> unique_words = set(word for line in page for word in line.split()) >>> valedictorian = max((student.gpa, student.name) for student in graduates) >>> data = 'golf' >>> list(data[i] for i in range(len(data)-1, -1, -1)) ['f', 'l', 'o', 'g']
ro: >>> sum(i*i for i in range(10)) # sumă de pătrate perfecte 285 >>> vectorul_x = [10, 20, 30] >>> vectorul_y = [7, 5, 3] >>> sum(x*y for x,y in ... zip(vectorul_x, vectorul_y)) # produs scalar 260 >>> cuvinte_unice = set(cuvântul for rândul in pagina ... for cuvântul in rândul.split()) >>> șef_de_promoție = max((studentul.media_generală, studentul.numele) ... for studentul in absolvenți) >>> datele = 'trop' >>> list(datele[i] for i in range(len(datele)-1, -1, -1)) ['p', 'o', 'r', 't']

source: Footnotes
ro: Note de subsol

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`~object.__dict__` which returns the dictionary used to implement the module's namespace; the name ``__dict__`` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
ro: Cu o excepție. Obiectele modul au un atribut *secret*, doar-de-citit, numit :attr:`~object.__dict__`, atribut care returnează dicționarul de date utilizat la implementarea spațiului de nume al modulului; numele ``__dict__`` este atribut, fără a fi (și) un nume global. Categoric, întrebuințarea sa violează caracterul de *abstracțiune* al implementării spațiilor de nume, motiv pentru care ea trebuie rezumată doar la activități precum depanarea post-mortem a programelor Python.

source: object
ro: obiect

source: method
ro: metodă

source: name
ro: nume

source: mangling
ro: transformare
