Repository: octaG-M/python-docs-ro
Catalog: tutorial/classes.po
Languages: ro

source: Note how the *local* assignment (which is default) didn't change *scope_test*\'s binding of *spam*. The :keyword:`nonlocal` assignment changed *scope_test*\'s binding of *spam*, and the :keyword:`global` assignment changed the module-level binding.
ro: Remarcați că atribuirea *local* (deci, cea standard) nu a modificat legarea lui *șuncă* dată de *testează_domeniul_de_vizibilitate*. În schimb, atribuirea :keyword:`nonlocal` a schimbat legarea lui *șuncă* dată de *testează_domeniul_de_vizibilitate*, respectiv atribuirea :keyword:`global` a modificat legarea la nivel de modul.

source: You can also see that there was no previous binding for *spam* before the :keyword:`global` assignment.
ro: În plus, puteți observa că *șuncă* nu a fost legat în niciun fel până la momentul asignării :keyword:`global`.

source: A First Look at Classes
ro: Prima privire aruncată asupra claselor

source: Classes introduce a little bit of new syntax, three new object types, and some new semantics.
ro: Clasele aduc un strop de nou în conținutul sintaxei, alte trei tipuri de obiecte, precum și ceva noutăți la semantică.

source: Class Definition Syntax
ro: Sintaxa definiției unei clase

source: The simplest form of class definition looks like this::
ro: Cea mai simplă formă a definiției unei clase arată astfel::

source: class ClassName: <statement-1> . . . <statement-N>
ro: class NumeleClasei: <instrucțiunea-1> . . . <instrucțiunea-N>

source: Class definitions, like function definitions (:keyword:`def` statements) must be executed before they have any effect. (You could conceivably place a class definition in a branch of an :keyword:`if` statement, or inside a function.)
ro: Definițiile de clase, aidoma definițiilor de funcții (instrucțiuni :keyword:`def`) trebuie executate mai întâi pentru a avea efect. (Dat fiind că nu este exclus să plasați o definiție de clasă într-una din ramificațiile unei instrucțiuni :keyword:`if`, după cum nu este imposibil nici să o inserați în codul vreunei funcții.)

source: In practice, the statements inside a class definition will usually be function definitions, but other statements are allowed, and sometimes useful --- we'll come back to this later. The function definitions inside a class normally have a peculiar form of argument list, dictated by the calling conventions for methods --- again, this is explained later.
ro: În practică, instrucțiunile din codul definiției unei clase vor fi mai ales definiții de funcții, cu toate că sunt permise și altfel de instrucțiuni, și încă cu mult folos --- vom reveni la aceasta mai târziu. Definițiile de funcții din interiorul (codului) unei clase impun (de obicei) o formă neobișnuită a listei de argumente, formă dictată de convențiile de apel ale metodelor --- și aceste aspecte vor fi explicate ulterior.

source: When a class definition is entered, a new namespace is created, and used as the local scope --- thus, all assignments to local variables go into this new namespace. In particular, function definitions bind the name of the new function here.
ro: Atunci când interpretorul citește definiția unei clase, un spațiu de nume (nou) va fi creat și întrebuințat ca domeniu de valabilitate local --- astfel, toate atribuirile către variabile locale vor fi realizate în cadrul acestui (nou) spațiu de nume. În particular, definițiile de funcții leagă fiecare nume nou de funcție de acest domeniu de valabilitate.

source: When a class definition is left normally (via the end), a *class object* is created. This is basically a wrapper around the contents of the namespace created by the class definition; we'll learn more about class objects in the next section. The original local scope (the one in effect just before the class definition was entered) is reinstated, and the class object is bound here to the class name given in the class definition header (:class:`!ClassName` in the example).
ro: Atunci când interpretorul părăsește în mod normal codul unei definiții de clasă (deci, după ce a ajuns la finalul acestui cod), va fi creat un *obiect clasă*. Acesta este, în fapt, o *împachetare* (sau o *învelitoare*; de la englezescul *wrapper*) a conținutului acelui spațiu de nume creat de însăși definiția clasei; vom afla mai multe despre obiectele clasă în secțiunea următoare. Domeniul de valabilitate local în care ne aflam (adică, domeniul vizibil înainte ca interpretorul să ajungă la definiția clasei) este reinstaurat iar obiectul clasă este legat de numele clasei dat în antetul definiției acesteia (:class:`!NumeleClasei` din exemplul nostru).

source: Class Objects
ro: Obiectele clasă

source: Class objects support two kinds of operations: attribute references and instantiation.
ro: Obiectele clasă permit două feluri de operații: referirea la atribute și instanțierea.

source: *Attribute references* use the standard syntax used for all attribute references in Python: ``obj.name``. Valid attribute names are all the names that were in the class's namespace when the class object was created. So, if the class definition looked like this::
ro: *Referirea la atribute* (de clasă; sau *referențierea atributelor* ori *referința la atribute*) întrebuințează sintaxa tipică din Python a referirii la atribute oarecare: ``obiect.nume``. Numele valide de atribute alcătuiesc întreg ansamblul de nume din spațiul de nume al clasei la momentul creării obiectului clasă. Astfel, dacă definiția clasei arată ca mai jos::

source: class MyClass: """A simple example class""" i = 12345 def f(self): return 'hello world'
ro: class ClasaMea: """Un exemplu simplist de clasă""" i = 12345 def f(self): return 'salutare, lume'

source: then ``MyClass.i`` and ``MyClass.f`` are valid attribute references, returning an integer and a function object, respectively. Class attributes can also be assigned to, so you can change the value of ``MyClass.i`` by assignment. :attr:`~type.__doc__` is also a valid attribute, returning the docstring belonging to the class: ``"A simple example class"``.
ro: atunci ``ClasaMea.i`` și ``ClasaMea.f`` sunt referiri valide la atribute, care returnează un număr întreg, respectiv un obiect funcție. Atributelor de clasă le putem realiza asignări, așa că valoarea lui ``ClasaMea.i`` poate fi modificată prin atribuire. Și :attr:`~type.__doc__` este un atribut valid, returnând docstring-ul clasei: ``"Un exemplu simplist de clasă"``.

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
ro: *Instanțierea* unei clase utilizează notația cu `operatorul funcție <https://en.wikipedia.org/wiki/Operators_in_C_and_C%2B%2B>`_. Ne putem închipui că obiectul clasă este o funcție fără parametri care întoarce o (nouă) instanță a clasei. De exemplu (folosind clasa de mai sus)::

source: x = MyClass()
ro: x = ClasaMea()

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
ro: creează o *instanță* nouă a clasei și îi atribuie obiectul nou creat variabilei locale ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`~object.__init__`, like this::
ro: Operația de *instanțiere* (adică de "apelare" a unui obiect clasă; de la englezescul *instantiation*) creează un obiect *gol* (vid). Pentru multe clase utilizate în practică se dorește crearea de instanțe particularizate printr-o *stare inițială* specificată (de către utilizator). Din acest motiv, unei clase îi poate fi definită o metodă specială, numită :meth:`~object.__init__`, după cum urmează::

source: def __init__(self): self.data = []
ro: def __init__(self): self.datele_clasei = []

source: When a class defines an :meth:`~object.__init__` method, class instantiation automatically invokes :meth:`!__init__` for the newly created class instance. So in this example, a new, initialized instance can be obtained by::
ro: Atunci când în codul unei clase este definită (și) metoda :meth:`~object.__init__`, instanțierea clasei respective va invoca în mod automat această metodă pentru nou creata instanță a clasei. Așadar, în exemplul nostru, o instanță nouă, *inițializată*, poate fi obținută prin::

source: Of course, the :meth:`~object.__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`!__init__`. For example, ::
ro: Firește, metoda :meth:`~object.__init__` poate primi argumente, această caracteristică sporindu-i flexibilitatea în utilizare. Într-o atare situație, argumentele date operatorului de instanțiere a clasei îi vor fi transmise lui :meth:`!__init__`. Astfel,

source: >>> class Complex: ... def __init__(self, realpart, imagpart): ... self.r = realpart ... self.i = imagpart ... >>> x = Complex(3.0, -4.5) >>> x.r, x.i (3.0, -4.5)
ro: >>> class NumărComplex: ... def __init__(self, partea_reală, partea_imaginară): ... self.real = partea_reală ... self.imaginar = partea_imaginară ... >>> x = NumărComplex(3.0, -4.5) >>> x.real, x.imaginar (3.0, -4.5)

source: Instance Objects
ro: Obiectele instanță

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names: data attributes and methods.
ro: Odată ajunși aici, la ce putem întrebuința aceste obiecte instanță? Singurele operații înțelese de obiectele instanță sunt referențierile de atribute. Există două tipuri de nume de atribute valide: atributele datelor (sau *atributele de date*) și metodele (adică, *atributele de funcții*).

source: *data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`!MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
ro: *atributele de date* le corespund "variabilelor de instanță" din Smalltalk, respectiv "membrilor date" din C++. Atributele (de) date nu au nevoie să fie *declarate*; asemenea variabilelor locale, ele *prind viață* (sunt *vivificate*) doar atunci când li se face o atribuire *pentru prima oară*. De exemplu, dacă ``x`` este instanța lui :class:`!ClasaMea` creată mai sus, atunci următorul fragment de cod va produce afișarea lui ``16``, fără să lase urme (în starea viitoarea a lui ``x``)::

source: x.counter = 1 while x.counter < 10: x.counter = x.counter * 2 print(x.counter) del x.counter
ro: x.contor = 1 while x.contor < 10: x.contor = x.contor * 2 print(x.contor) del x.contor

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object.
ro: Celălalt fel de referențiere de atribute de care dispune instanța este *metoda*. O metodă este o funcție care "îi aparține" unui obiect.

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
ro: Numele valide de metode ale unui obiect instanță depind de clasa acestui obiect instanță. Prin definiție, toate atributele unei clase care sunt obiecte funcție definesc metodele corespunzătoare (omonime) ale instanțelor clasei. Așa că, în exemplul nostru, ``x.f`` este o referire validă la o metodă, deoarece ``ClasaMea.f`` este funcție, pe când ``x.i`` nu este validă ca referire la vreo metodă pentru că ``ClasaMea.i`` nu este funcție. Atenție, ``x.f`` nu este același lucru cu ``ClasaMea.f`` --- primul este un *obiect metodă*, nu un obiect funcție.

source: Method Objects
ro: Obiectele metodă

source: Usually, a method is called right after it is bound::
ro: Adesea, o metodă va fi apelată de îndată ce a fost legată (de un anumit obiect)::

source: In the :class:`!MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
ro: În exemplul cu :class:`!ClasaMea`, un atare apel va returna șirul de caractere ``'salutare, lume'``. Pe de altă parte, nu este nevoie să apelăm metodele imediat: cum ``x.f`` este un obiect metodă, el poate fi stocat undeva și apelat la momentul dorit. De exemplu::

source: will continue to print ``hello world`` until the end of time.
ro: va afișa ``salutare, lume`` fără să se mai oprească din a da binețe.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`!f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
ro: Ce se întâmplă, cu adevărat, atunci când se apelează o metodă? Probabil că ați remarcat faptul că ``x.f()`` a fost apelat, în codul de mai sus, fără să i se dea niciun argument, chiar dacă definiția lui :meth:`!f` specifica un anume argument. Oare ce s-a întâmplat cu acest argument? Doar știm că Python-ul va lansa o excepție atunci când vreo funcție care cerere argument este apelată fără niciun argument --- chiar dacă argumentul nici măcar nu urmează să fie folosit...

source: Actually, you may have guessed the answer: the special thing about methods is that the instance object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's instance object before the first argument.
ro: Păi, se prea poate să fi ghicit, deja, răspunsul: un lucru special privind metodele este acela că obiectul instanță îi este transmis metodei ca *prim argument* al său. În exemplul nostru, apelul ``x.f()`` este absolut echivalent cu ``ClasaMea.f(x)``. Practic, a apela o metodă cu o listă de *n* argumente este totuna cu a apela funcția corespondentă a acestei metode cu o listă de argumente formată prin inserarea obiectului instanță (de care *aparține* metoda) înaintea primului din cele *n* argumente.

source: In general, methods work as follows. When a non-data attribute of an instance is referenced, the instance's class is searched. If the name denotes a valid class attribute that is a function object, references to both the instance object and the function object are packed into a method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
ro: În general, metodele funcționează după cum urmează. Atunci când un atribut non-dată este referențiat, va fi căutată instanța clasei (sale). Dacă numele (atributului) denotă un atribut valid al clasei iar acest atribut este un obiect funcție, atunci referirile (referințele) respective, atât la obiectul instanță cât și la obiectul funcție, vor fi împachetate într-un obiect metodă. Dacă obiectul metodă este apelat cu o listă de argumente, atunci o nouă listă de argumente va fi construită din obiectul instanță și din elementele listei de argumente în cauză, obiectul funcție corespunzător fiind apelat cu această (nou formată) listă de argumente.

source: Class and Instance Variables
ro: Variabile de clasă și variabile de instanță

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
ro: În jargon POO, variabilele de instanță se referă la datele care îi sunt unice fiecărei instanțe, respectiv variabilele de clasă se referă la atributele și metodele comune tuturor instanțelor clasei respective::

source: class Dog: kind = 'canine' # class variable shared by all instances def __init__(self, name): self.name = name # instance variable unique to each instance >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.kind # shared by all dogs 'canine' >>> e.kind # shared by all dogs 'canine' >>> d.name # unique to d 'Fido' >>> e.name # unique to e 'Buddy'
ro: class Câine: genul = 'canis' # variabilă de clasă comună tuturor # instanțelor def __init__(self, numele): self.numele = numele # variabilă de instanță, unică fiecărei # instanțe >>> d = Câine('Fido') >>> e = Câine('Amicu'') >>> d.genul # comun tuturor câinilor 'canis' >>> e.genul # comun tuturor câinilor 'canis' >>> d.numele # doar al lui d 'Fido' >>> e.numele # doar al lui e "Amicu'"

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
ro: Precum spuneam în :ref:`tut-object`, organizarea datelor puse în comun (comune tuturor instanțelor unei clase; sau *partajate* de către toate instanțele unei clase; de la englezescul *shared*) poate produce efecte surprinzătoare dacă folosim la o atare acțiune obiecte :term:`mutable`, precum listele ori dicționarele de date. De exemplu, lista *trucuri* din codul de mai jos n-ar fi trebuit întrebuințată pe post de variabilă de clasă și aceasta pentru că va exista o singură listă ce va fi folosită *la comun* de către toate instanțele *Câine*::

source: class Dog: tricks = [] # mistaken use of a class variable def __init__(self, name): self.name = name def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('roll over') >>> e.add_trick('play dead') >>> d.tricks # unexpectedly shared by all dogs ['roll over', 'play dead']
ro: class Câine: trucuri = [] # folosită din greșeală ca variabilă de clasă def __init__(self, numele): self.numele = numele def adauga_trucul(self, trucul): self.trucuri.append(trucul) >>> d = Câine('Fido') >>> e = Câine('Amicu'') >>> d.adaugă_trucul('rostogol') >>> e.adaugă_trucul('mort') >>> d.trucuri # folosință la comun neașteptată ['rostogol', 'mort']

source: Correct design of the class should use an instance variable instead::
ro: O proiectare corectă a clasei ar trebui să folosescă, în locul unei variabile de clasă, o variabilă de instanță::

source: class Dog: def __init__(self, name): self.name = name self.tricks = [] # creates a new empty list for each dog def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('roll over') >>> e.add_trick('play dead') >>> d.tricks ['roll over'] >>> e.tricks ['play dead']
ro: class Câine: def __init__(self, numele): self.numele = numele self.trucuri = [] # creează câte o listă goală # pentru fiecare câine def adaugă_trucul(self, trucul): self.trucuri.append(trucul) >>> d = Câine('Fido') >>> e = Câine('Amicu'') >>> d.adaugă_trucul('rostogol') >>> e.adaugă_trucul('mort') >>> d.trucuri ['rostogol'] >>> e.trucuri ['mort']

source: Random Remarks
ro: Observații diverse

source: If the same attribute name occurs in both an instance and in a class, then attribute lookup prioritizes the instance::
ro: Dacă același nume de atribut va apărea și într-o instanță și într-o clasă, la găsirea atributului i se va da prioritate instanței::

source: >>> class Warehouse: ... purpose = 'storage' ... region = 'west' ... >>> w1 = Warehouse() >>> print(w1.purpose, w1.region) storage west >>> w2 = Warehouse() >>> w2.region = 'east' >>> print(w2.purpose, w2.region) storage east
ro: >>> class Depozitul: ... scopul = 'înmagazinare' ... regiunea = 'vestică' ... >>> d1 = Depozitul() >>> print(d1.scopul, d1.regiunea) înmagazinare vestică >>> d2 = Depozitul() >>> d2.regiunea = 'estică' >>> print(d2.scopul, d2.regiunea) înmagazinare estică

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
ro: Atributele de date pot fi referențiate atât de metode cât și de utilizatorii obișnuiți ("clienții") ai obiectului (având respectivele atribute). Cu alte cuvinte, clasele sunt inutilizabile la implementarea unor tipuri de *date abstracte* pure. Practic, nimic din Python nu ne poate ajuta să asigurăm *ascunderea datelor* --- totul se bazează pe o simplă convenție. (Pe de altă parte, implementarea de față a Python-ului, scrisă în C, poate să mascheze în totalitate detaliile de implementare, respectiv să controleze accesul la un anumit obiect, atunci când este nevoie de așa ceva; o asemenea capacitate poate fi întrebuințată de diversele extensii ale Python-ului scrise în C.)

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
ro: Clienții trebuie să folosească atributele de date cu grijă --- căci ei pot strica *invarianții* păstrați de metode dacă își vor pune amprenta pe atributele de date ale acestora. Nu uitați că clienții îi pot adăuga atribute după bunul lor plac unui obiect instanță fără ca prin aceasta să le afecteze validitatea metodelor, atâta timp cât se evită conflictele de nume --- și aici, întrebuințarea unei convenții de nume ne poate scăpa de o grămadă de bătăi de cap.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
ro: Nu ni se pune la dispoziție nicio scurtătură (și nici alte tehnici!) atunci când referențiem atribute de date din interiorul unei metode. Trebuie spus că o astfel de caracteristică a Python-ului crește lizibilitatea codului oricărei metode: deoarece nu avem nicio șansă să confundăm variabilele locale cu variabilele de instanță atunci când ne aruncăm privirea peste instrucțiunile dintr-o metodă.
