Repository: octaG-M/python-docs-ro
Catalog: tutorial/datastructures.po
Languages: ro

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
ro: Remarcați că este permisă operația de comparare a obiectelor de tipuri diferite folosind operatorii ``<`` sau ``>`` cu condiția ca obiectele corespunzătoare să posede metode de comparație potrivite. De exemplu, tipurile numerice diferite se compară folosind valoarea numerică a obiectelor lor, astfel că 0 este egal cu 0.0 șamd. În caz contrar, în loc să furnizeze o ordonare arbitrară, interpretorul va ridica o excepție :exc:`TypeError`.

source: Footnotes
ro: Note de subsol

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
ro: În alte limbaje de programare, este posibil să se returneze obiectul mutat, ceea ce va permite înlănțuirea metodelor, cum ar fi ``d->insert("a")->remove("b")->sort();``.
