Repository: octaG-M/python-docs-ro
Catalog: tutorial/datastructures.po
Languages: ro

source: Data Structures
ro: Structuri de date

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
ro: Capitolul de față se apleacă mai în detaliu asupra unor chestiuni cu care v-ați întâlnit deja, iar acestora le adaugă, firește, și lucruri noi.

source: More on Lists
ro: Mai multe despre liste

source: The list data type has some more methods. Here are all of the methods of list objects:
ro: Tipul de date listă dispune de mai multe metode. Iată toate aceste metode ale obiectelor listă:

source: Add an item to the end of the list. Similar to ``a[len(a):] = [x]``.
ro: Adaugă un element la finalul listei. La fel ca ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Similar to ``a[len(a):] = iterable``.
ro: Extinde lista prin adăugarea tuturor elementelor unui (obiect) iterabil. La fel ca ``a[len(a):] = iterabil``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
ro: Inserează un element la poziția dată. Primul argument este indicele elementului înaintea căruia se va face inserția, de aceea ``a.insert(0, x)`` va realiza o inserție la începutul listei în timp ce ``a.insert(len(a), x)`` este echivalentă cu ``a.append(x)``.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
ro: Elimină primul element din listă a cărui valoare este egală cu *x*. Va ridica o excepție :exc:`ValueError` dacă nu există niciun astfel de element.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. It raises an :exc:`IndexError` if the list is empty or the index is outside the list range.
ro: Elimină din listă elementul de la poziția dată și îl returnează. Dacă nu se specifică indicele elementului, atunci ``a.pop()`` va elimina și va returna ultimul element al listei. Ridică o excepție :exc:`IndexError` atunci când fie lista este goală fie când indicele se găsește în afara plajei de valori a indicilor elementelor listei.

source: Remove all items from the list. Similar to ``del a[:]``.
ro: Elimină toate elementele din listă. La fel ca ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
ro: Întoarce indicele, numerotat de la zero, al primului element al listei a cărui valoare este egală cu *x*. Ridică o excepție :exc:`ValueError` dacă nu există niciun asemenea element.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
ro: Argumentele opționale *start* și *end* sunt interpretate la fel ca în cazul unei felieri și sunt folosite la limitarea căutărilor într-o anumită sub-secvență a listei. Indicele returnat se calculează relativ la începutul întregii secvențe și nu începând de la argumentul *start*.

source: Return the number of times *x* appears in the list.
ro: Returnează numărul de apariții ale lui *x* în listă.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
ro: Sortează elementele listei păstrându-le în aceeași listă (argumentele pot fi folosite la construcția unei sortări personalizate, vezi :func:`sorted` pentru o justificare a lor).

source: Reverse the elements of the list in place.
ro: Scrie în ordine inversă elementele listei păstrându-le în aceeași listă.

source: Return a shallow copy of the list. Similar to ``a[:]``.
ro: Întoarce o copie superficială a listei. La fel ca ``a[:]``.

source: An example that uses most of the list methods::
ro: Un exemplu care întrebuințează majoritatea metodelor listei::

source: >>> fruits = ['orange', 'apple', 'pear', 'banana', 'kiwi', 'apple', 'banana'] >>> fruits.count('apple') 2 >>> fruits.count('tangerine') 0 >>> fruits.index('banana') 3 >>> fruits.index('banana', 4) # Find next banana starting at position 4 6 >>> fruits.reverse() >>> fruits ['banana', 'apple', 'kiwi', 'banana', 'pear', 'apple', 'orange'] >>> fruits.append('grape') >>> fruits ['banana', 'apple', 'kiwi', 'banana', 'pear', 'apple', 'orange', 'grape'] >>> fruits.sort() >>> fruits ['apple', 'apple', 'banana', 'banana', 'grape', 'kiwi', 'orange', 'pear'] >>> fruits.pop() 'pear'
ro: >>> fructe = ['portocală', 'măr', 'pară', 'banană', 'kiwi', 'măr', 'banană'] >>> fructe.count('măr') 2 >>> fructe.count('mandarină') 0 >>> fructe.index('banană') 3 >>> fructe.index('banană', 4) # Găsește prima banană situată la dreapta poziției 4 6 >>> fructe.reverse() >>> fructe ['banană', 'măr', 'kiwi', 'banană', 'pară', 'măr', 'portocală'] >>> fructe.append('struguri') >>> fructe ['banană', 'măr', 'kiwi', 'banană', 'pară', 'măr', 'portocală', 'struguri'] >>> fructe.sort() >>> fructe ['banană', 'banană', 'kiwi', 'măr', 'măr', 'pară', 'portocală', 'struguri'] >>> fructe.pop() 'struguri'

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [#]_ This is a design principle for all mutable data structures in Python.
ro: Poate că ați remarcat deja că metode precum ``insert``, ``remove`` sau ``sort``, adică metode care fac modificări în listă păstrând lista, nu afișează nicio valoare returnată -- în fapt, ele returnează valoarea prestabilită ``None``. [#]_ Acesta este un principiu de design valabil pentru toate structurile de date mutabile din Python.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and ``None`` can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
ro: Altă chestiune de remarcat este aceea că nu toate datele pot fi sortate și nici comparate. De exemplu, ``[None, 'salut', 10]`` nu se va sorta deoarece numerele întregi nu sunt comparabile cu șirurile de caractere iar ``None`` nu poate fi comparat cu niciun alt tip de date. De asemeni, există tipuri de date fără o relație de ordine `totală <https://en.wikipedia.org/wiki/Total_order>`_. Astfel, ``3+4j < 5+7j`` nu este o comparație validă.

source: Using Lists as Stacks
ro: Utilizarea listelor ca stive

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`!append`. To retrieve an item from the top of the stack, use :meth:`!pop` without an explicit index. For example::
ro: Metodele tipului listă ne permit să utilizăm listele cu ușurință pe post de stive, adică de instanțe ale acelui tip de date la care ultimul element adăugat va fi extras primul ("ultimul intrat, primul ieșit"). Pentru a pune un element în vârful stivei, folosiți :meth:`!append`. Pentru a scoate un element din vârful stivei, folosiți :meth:`!pop` fără să precizați niciun index. De exemplu::

source: >>> stack = [3, 4, 5] >>> stack.append(6) >>> stack.append(7) >>> stack [3, 4, 5, 6, 7] >>> stack.pop() 7 >>> stack [3, 4, 5, 6] >>> stack.pop() 6 >>> stack.pop() 5 >>> stack [3, 4]
ro: >>> stiva = [3, 4, 5] >>> stiva.append(6) >>> stiva.append(7) >>> stiva [3, 4, 5, 6, 7] >>> stiva.pop() 7 >>> stiva [3, 4, 5, 6] >>> stiva.pop() 6 >>> stiva.pop() 5 >>> stiva [3, 4]

source: Using Lists as Queues
ro: Făcând cozi din liste

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
ro: Se poate să întrebuințăm o listă aidoma unei cozi, adică a unei instanțe a acelui tip de date la care primul element adăugat va fi extras primul ("primul intrat, primul ieșit"); însă listele nu au fost proiectate ca să fie eficiente în acest scop. În timp ce adăugările la final și extragerile de la finalul unei liste sunt rapide, realizarea de inserări la început și de eliminări de la începutul unei liste sunt operații lente (aceasta deoarece toate celelalte elemente trebuie deplasate în lateral cu câte o poziție).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
ro: Pentru a implementa o coadă, folosiți :class:`collections.deque` care a fost proiectată special ca să realizeze adăugiri și eliminări rapide la ambele capete. De exemplu::

source: >>> from collections import deque >>> queue = deque(["Eric", "John", "Michael"]) >>> queue.append("Terry") # Terry arrives >>> queue.append("Graham") # Graham arrives >>> queue.popleft() # The first to arrive now leaves 'Eric' >>> queue.popleft() # The second to arrive now leaves 'John' >>> queue # Remaining queue in order of arrival deque(['Michael', 'Terry', 'Graham'])
ro: >>> from collections import deque >>> coadă = deque(["Eric", "John", "Michael"]) >>> coadă.append("Terry") # Terry intră în scenă >>> coadă.append("Graham") # Graham intră în scenă >>> coadă.popleft() # Primul sosit iese din scenă 'Eric' >>> coadă.popleft() # Al doilea sosit iese din scenă 'John' >>> coadă # Coada rămasă, în ordinea intrărilor în scenă deque(['Michael', 'Terry', 'Graham'])

source: List Comprehensions
ro: Comprehensiunea listelor

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
ro: Comprehensiunea listelor (*înțelegerea* dar și *explicarea* lor) reprezintă o metodă succintă de a crea liste. Aplicațiile esențiale ale acesteia sunt construcțiile de liste noi ale căror elemente să fie rezultatul realizării anumitor operații cu fiecare din membrii unei secvențe ori ai unui iterabil, respectiv crearea unei sub-secvențe din acele elemente ale unei secvențe date care îndeplinesc o anumită condiție.

source: For example, assume we want to create a list of squares, like::
ro: De exemplu, să presupunem că dorim să creăm o listă de pătrate perfecte, precum urmează::

source: >>> squares = [] >>> for x in range(10): ... squares.append(x**2) ... >>> squares [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]
ro: >>> pătrate_perfecte = [] >>> for x in range(10): ... pătrate_perfecte.append(x**2) ... >>> pătrate_perfecte [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
ro: Să remarcăm că procedeul anterior creează (ori suprascrie) o variabilă numită ``x`` care va exista și după încheierea ciclului :keyword:`!for`. Putem calcula lista pătratelor perfecte și fără asemenea efecte secundare dacă utilizăm fie expresia::

source: squares = list(map(lambda x: x**2, range(10)))
ro: pătrate_perfecte = list(map(lambda x: x**2, range(10)))

source: or, equivalently::
ro: fie pe cea echivalentă acesteia::

source: squares = [x**2 for x in range(10)]
ro: pătrate_perfecte = [x**2 for x in range(10)]

source: which is more concise and readable.
ro: care este mai concisă și mai ușor de citit.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
ro: Comprehensiunea unei liste constă din paranteze drepte care încadrează o expresie urmată de o clauză :keyword:`!for`, apoi de zero sau mai multe clauze :keyword:`!for` ori clauze :keyword:`!if`. Rezultatul comprehensiunii va fi o listă nouă, produsă ca urmare a evaluării expresiei în contextul clauzelor :keyword:`!for` și :keyword:`!if` care îi urmează în cod. De exemplu, următoarea comprehensiune de liste (în englezește, ca jargon, *listcomp*) combină elementele a două liste atunci când aceste elemente nu sunt egale::

source: and it's equivalent to::
ro: și este echivalentă cu::

source: >>> combs = [] >>> for x in [1,2,3]: ... for y in [3,1,4]: ... if x != y: ... combs.append((x, y)) ... >>> combs [(1, 3), (1, 4), (2, 3), (2, 1), (2, 4), (3, 1), (3, 4)]
ro: >>> combinații = [] >>> for x in [1,2,3]: ... for y in [3,1,4]: ... if x != y: ... combinații.append((x, y)) ... >>> combinații [(1, 3), (1, 4), (2, 3), (2, 1), (2, 4), (3, 1), (3, 4)]

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
ro: Remarcați că ordinea instrucțiunilor :keyword:`for` și :keyword:`if` se păstrează în ambele fragmente de cod.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
ro: Dacă expresia este un tuplu (precum ``(x, y)``-ul din exemplul precedent), atunci ea trebuie încadrată de paranteze. ::

source: >>> vec = [-4, -2, 0, 2, 4] >>> # create a new list with the values doubled >>> [x*2 for x in vec] [-8, -4, 0, 4, 8] >>> # filter the list to exclude negative numbers >>> [x for x in vec if x >= 0] [0, 2, 4] >>> # apply a function to all the elements >>> [abs(x) for x in vec] [4, 2, 0, 2, 4] >>> # call a method on each element >>> freshfruit = [' banana', ' loganberry ', 'passion fruit '] >>> [weapon.strip() for weapon in freshfruit] ['banana', 'loganberry', 'passion fruit'] >>> # create a list of 2-tuples like (number, square) >>> [(x, x**2) for x in range(6)] [(0, 0), (1, 1), (2, 4), (3, 9), (4, 16), (5, 25)] >>> # the tuple must be parenthesized, otherwise an error is raised >>> [x, x**2 for x in range(6)] File "<stdin>", line 1 [x, x**2 for x in range(6)] ^^^^^^^ SyntaxError: did you forget parentheses around the comprehension target? >>> # flatten a list using a listcomp with two 'for' >>> vec = [[1,2,3], [4,5,6], [7,8,9]] >>> [num for elem in vec for num in elem] [1, 2, 3, 4, 5, 6, 7, 8, 9]
ro: >>> vectorul = [-4, -2, 0, 2, 4] >>> # crearea unei liste noi cu valoarea elementelor dublată >>> [x*2 for x in vectorul] [-8, -4, 0, 4, 8] >>> # filtrarea listei pentru a exclude numerele negative >>> [x for x in vectorul if x >= 0] [0, 2, 4] >>> # aplicarea unei funcții fiecărui element din listă >>> [abs(x) for x in vectorul] [4, 2, 0, 2, 4] >>> # apelul unei metode a fiecărui element din listă >>> fructe_proaspete = [' banană', ' hibrid de mure și zmeură ', 'fructul pasiunii '] >>> [armă.strip() for armă in fructe_proaspete] ['banană', 'hibrid de mure și zmeură', 'fructul pasiunii'] >>> # crearea unei liste de 2-tupluri de felul (numărul, pătratul său) >>> [(x, x**2) for x in range(6)] [(0, 0), (1, 1), (2, 4), (3, 9), (4, 16), (5, 25)] >>> # tuplul trebuie încadrat de paranteze, în caz contrar producându-se o eroare >>> [x, x**2 for x in range(6)] File "<stdin>", line 1 [x, x**2 for x in range(6)] ^^^^^^^ SyntaxError: did you forget parentheses around the comprehension target? >>> # serializarea unei liste folosind o listcomp cu două 'for'-uri >>> vectorul = [[1,2,3], [4,5,6], [7,8,9]] >>> [numărul for elementul in vectorul for numărul in elementul] [1, 2, 3, 4, 5, 6, 7, 8, 9]

source: List comprehensions can contain complex expressions and nested functions::
ro: Comprehensiunile de liste pot conține atât expresii complexe cât și funcții imbricate::

source: Nested List Comprehensions
ro: Comprehensiuni imbricate de liste

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
ro: Expresia inițială dintr-o comprehensiune de liste poate fi orice fel de expresie, deci poate include și o (altă) comprehensiune de liste.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
ro: Să luăm în considerare următorul exemplu de matrice 3x4 implementată ca listă formată din 3 liste de lungime 4::

source: >>> matrix = [ ... [1, 2, 3, 4], ... [5, 6, 7, 8], ... [9, 10, 11, 12], ... ]
ro: >>> matrice = [ ... [1, 2, 3, 4], ... [5, 6, 7, 8], ... [9, 10, 11, 12], ... ]

source: The following list comprehension will transpose rows and columns::
ro: Comprehensiunea de liste care urmează va `transpune <https://en.wikipedia.org/wiki/Transpose>`_ liniile și coloanele matricei::

source: >>> [[row[i] for row in matrix] for i in range(4)] [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
ro: >>> [[linia[i] for linia in matrice] for i in range(4)] [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]

source: As we saw in the previous section, the inner list comprehension is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
ro: Așa cum am văzut în secțiunea anterioară, comprehensiunea listei interioare este evaluată în contextul :keyword:`for`-ul care îi urmează listei, așa că exemplul de cod este echivalent cu::

source: >>> transposed = [] >>> for i in range(4): ... transposed.append([row[i] for row in matrix]) ... >>> transposed [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
ro: >>> transpusa = [] >>> for i in range(4): ... transpusa.append([linia[i] for linia in matrice]) ... >>> transpusa [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]

source: which, in turn, is the same as::
ro: cod care, la rândul său, este identic cu::

source: >>> transposed = [] >>> for i in range(4): ... # the following 3 lines implement the nested listcomp ... transposed_row = [] ... for row in matrix: ... transposed_row.append(row[i]) ... transposed.append(transposed_row) ... >>> transposed [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
ro: >>> transpusa = [] >>> for i in range(4): ... # următoarele 3 linii de cod implementează listcomp-a imbricată ... linia_transpusei = [] ... for linia in matrice: ... linia_transpusei.append(linia[i]) ... transpusa.append(linia_transpusei) ... >>> transpusa [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
ro: În lumea reală, preferați funcțiile predefinite oricăror instrucțiuni iterative complexe. Funcția :func:`zip` s-ar descurca de minune în cazul de întrebuințare pe care îl studiem::

source: >>> list(zip(*matrix)) [(1, 5, 9), (2, 6, 10), (3, 7, 11), (4, 8, 12)]
ro: >>> list(zip(*matrice)) [(1, 5, 9), (2, 6, 10), (3, 7, 11), (4, 8, 12)]

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
ro: A se vedea :ref:`tut-unpacking-arguments` pentru detalii despre asteriscul de pe această linie de cod.

source: The :keyword:`!del` statement
ro: Instrucțiunea :keyword:`!del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`!pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
ro: Există o modalitate de a elimina un element dintr-o listă atunci când îi știm indicele (poziția) dar nu și valoarea: instrucțiunea :keyword:`del`. Aceasta diferă de metoda :meth:`!pop` care returnează valoarea elementului eliminat. Instrucțiunea :keyword:`!del` poate fi utilizată și la eliminarea de felii din listă ori la golirea întregii liste (ceea ce am făcut anterior atribuindu-i feliei o listă goală). De exemplu::

source: :keyword:`del` can also be used to delete entire variables::
ro: :keyword:`del` poate fi folosită și la ștergerea completă a unei variabile::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
ro: Referențierea numelui ``a`` de acum înainte este eronată (cel puțin până când acestui nume îi vom atribui o valoare). Îi vom găsi ulterior și alte întrebuințări lui :keyword:`del`.

source: Tuples and Sequences
ro: Tupluri și secvențe

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
ro: Am văzut că șirurile de caractere și listele au multe proprietăți în comun, cum ar fi operațiile de indexare și de feliere. Tipurile acestor obiecte sunt exemple de tipuri de date *secvență* (vezi :ref:`typesseq`). Deoarece Python-ul este un limbaj aflat în plină evoluție, se poate ca și alte tipuri secvență de date să îi fie adăugate. Mai există un tip secvență de date standard: *tuplul*.

source: A tuple consists of a number of values separated by commas, for instance::
ro: Un tuplu constă dintr-un număr de valori separate prin virgulă, cum ar fi::

source: >>> t = 12345, 54321, 'hello!' >>> t[0] 12345 >>> t (12345, 54321, 'hello!') >>> # Tuples may be nested: >>> u = t, (1, 2, 3, 4, 5) >>> u ((12345, 54321, 'hello!'), (1, 2, 3, 4, 5)) >>> # Tuples are immutable: >>> t[0] = 88888 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'tuple' object does not support item assignment >>> # but they can contain mutable objects: >>> v = ([1, 2, 3], [3, 2, 1]) >>> v ([1, 2, 3], [3, 2, 1])
ro: >>> t = 12345, 54321, 'salut!' >>> t[0] 12345 >>> t (12345, 54321, 'salut!') >>> # Tuplurile pot fi imbricate: >>> u = t, (1, 2, 3, 4, 5) >>> u ((12345, 54321, 'salut!'), (1, 2, 3, 4, 5)) >>> # Tuplurile sunt imutabile: >>> t[0] = 88888 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'tuple' object does not support item assignment >>> # însă pot conține obiecte mutabile: >>> v = ([1, 2, 3], [3, 2, 1]) >>> v ([1, 2, 3], [3, 2, 1])

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
ro: După cum puteți observa, atunci când sunt afișate, tuplurile apar întotdeauna încadrate de paranteze, drept pentru care tuplurile imbricate vor putea fi interpretate corect; pe de altă parte, ele pot fi introduse cu sau fără paranteze, chiar dacă adesea parantezele sunt necesare (atunci când tuplul face parte dintr-o expresie mai cuprinzătoare). Deși nu îi putem atribui valori niciunui element individual al unui tuplu, putem crea tupluri care conțin obiecte mutabile, precum listele.
