Repository: octaG-M/python-docs-ro
Catalog: tutorial/datastructures.po
Languages: ro

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
ro: Chiar dacă tuplurile par să semene cu listele, ele se folosesc adesea în situații diferite și pentru scopuri diferite de cele ale utilizării listelor. Tuplurile sunt :term:`immutable` și conțin, de obicei, o secvență eterogenă de elemente care pot fi accesate fie via despachetare (după cum vom vedea ulterior în secțiunea de față) fie prin indexare (ba chiar și prin intermediul atributelor în cazul :func:`namedtuples <collections.namedtuple>`). În schimb, listele sunt :term:`mutable` iar elementele unei liste sunt omogene, de obicei, și se accesează prin iterări de-a lungul listei.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
ro: O problemă aparte o constituie construcția de tupluri cu 0 sau 1 elemente: sintaxa impune câteva adaosuri ciudate pentru a le acomoda. Astfel, tuplurile goale se construiesc cu o pereche goală de paranteze rotunde; un tuplu cu un singur element este construit dintr-o valoare urmată de o virgulă (nu este suficient să încadrăm valoarea între paranteze). Neplăcut, dar eficient. Ca, de exemplu::

source: >>> empty = () >>> singleton = 'hello', # <-- note trailing comma >>> len(empty) 0 >>> len(singleton) 1 >>> singleton ('hello',)
ro: >>> gol = () >>> singular = 'salut', # <-- remarcați virgula de final >>> len(gol) 0 >>> len(singular) 1 >>> singular ('salut',)

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
ro: Instrucțiunea ``t = 12345, 54321, 'salut!'`` este un exemplu de *împachetare în tuplu*: valorile ``12345``, ``54321`` și ``'salut!'`` sunt puse laolaltă într-un tuplu. Este posibilă și operația inversă::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
ro: Aceasta se numește, destul de potrivit, *despachetarea secvenței* și funcționează pentru orice secvență admisă ca valoare de pe partea dreaptă (ori `r-valoare <https://en.wikipedia.org/wiki/Value_(computer_science)>`_). Despachetarea secvențelor cere să fie tot atâtea variabile pe partea stângă a semnului egal câte elemente are secvența. Să observăm că atribuirea multiplă este, în realitate, doar o combinație de împachetări de tupluri și de despachetări de secvențe.

source: Sets
ro: Seturi

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
ro: Python-ul posedă și un tip de date pentru tratamentul *mulțimilor* (al *seturilor*). Un set este o colecție neordonată de elemente, fără duplicate. Întrebuințările de bază ale acestui tip de date includ verificarea apartenenței și eliminarea duplicatelor de elemente. Obiectele mulțime suportă, de asemeni, și operații matematice precum reuniunea, intersecția, diferența ori diferența simetrică.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
ro: Atât acoladele cât și funcția :func:`set` pot fi folosite la crearea de mulțimi. Remarcă: pentru a crea o mulțime vidă trebuie să utilizați ``set()``, nu ``{}``; cea din urmă formulă va construi un dicționar de date gol, iar despre o asemenea structură de date vom discuta în secțiunea următoare.

source: Here is a brief demonstration::
ro: Iată o scurtă demonstrație::

source: >>> basket = {'apple', 'orange', 'apple', 'pear', 'orange', 'banana'} >>> print(basket) # show that duplicates have been removed {'orange', 'banana', 'pear', 'apple'} >>> 'orange' in basket # fast membership testing True >>> 'crabgrass' in basket False >>> # Demonstrate set operations on unique letters from two words >>> >>> a = set('abracadabra') >>> b = set('alacazam') >>> a # unique letters in a {'a', 'r', 'b', 'c', 'd'} >>> a - b # letters in a but not in b {'r', 'd', 'b'} >>> a | b # letters in a or b or both {'a', 'c', 'r', 'd', 'b', 'm', 'z', 'l'} >>> a & b # letters in both a and b {'a', 'c'} >>> a ^ b # letters in a or b but not both {'r', 'd', 'b', 'm', 'z', 'l'}
ro: >>> coș = {'măr', 'portocală', 'măr', 'pară', 'portocală', 'banană'} >>> print(coș) # arată că duplicatele au fost eliminate {'portocală', 'banană', 'pară', 'măr'} >>> 'portocală' in coș # testarea rapidă a apartenenței True >>> 'pălămidă' in coș False >>> # Demonstrarea operațiilor cu mulțimi într-o problemă >>> # privind literele unicat din două cuvinte >>> >>> a = set('abracadabra') >>> b = set('alacazam') >>> a # litere unicat în a {'a', 'r', 'b', 'c', 'd'} >>> a - b # literele care sunt în a dar nu sunt în b {'r', 'd', 'b'} >>> a | b # literele care sunt sau în a sau în b sau în amândouă {'a', 'c', 'r', 'd', 'b', 'm', 'z', 'l'} >>> a & b # literele care sunt și în a și în b {'a', 'c'} >>> a ^ b # literele care sunt sau în a sau în b dar nu în amândouă {'r', 'd', 'b', 'm', 'z', 'l'}

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
ro: Asemănător :ref:`comprehensiunii listelor <tut-listcomps>`, sunt permise și comprehensiunile de mulțimi::

source: Dictionaries
ro: Dicționare de date

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`!append` and :meth:`!extend`.
ro: Alt tip de date util, predefinit în Python, este *dicționarul* (de date, vezi :ref:`typesmapping`). Dicționare de date se găsesc și în alte limbaje de programare, numite uneori "memorii asociative" ori "tablouri asociative" (de la englezescul *array*). Spre deosebire de secvențe, ale căror elemente sunt indexate cu indici dintr-un domeniu de valori numerice, dicționarele de date au elementele indexate cu *chei*, acestea putând fi obiecte ale oricărui tip de date imutabile.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
ro: Cel mai bine este să ne gândim la dicționarul de date ca la o mulțime de perechi *cheie: valoare* pentru care se cere să avem chei unice (într-un singur dicționar). O pereche de acolade creează un dicționar gol: ``{}``. Plasând o listă de perechi cheie:valoare cu elementele separate prin virgule între aceste acolade, vom adăuga perechile cheie:valoare din listă la dicționarul de date; acesta este, de fapt, modul în care dicționarele sunt afișate.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
ro: Operațiile principale pe care le realizăm asupra unui dicționar sunt inserarea unei valori cu ajutorul unei anumite chei și extragerea unei valori căreia îi știm cheia. Este, de asemeni, posibil să elimnăm o pereche cheie:valoare cu ajutorul lui ``del``. Dacă inserăm o valoare folosind o cheie care a fost deja asociată unei anumite valori, atunci vechea valoare se va pierde. Încercarea de a extrage o valoare folosind o cheie inexistentă va produce o eroare.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
ro: Executând instrucțiunea ``list(d)`` asupra unui dicționar de date ``d``, se va returna lista tuturor cheilor utilizate de dicționar, în ordinea în care ele au fost folosite la inserarea de valori (dacă le doriți sortate, atunci folosiți ``sorted(d)`` în locul instrucțiunii anterioare). Pentru a determina dacă o anumită cheie a fost deja inclusă în dicționar, întrebuințați cuvântul-cheie :keyword:`in`.

source: Here is a small example using a dictionary::
ro: Iată un exemplu succint de utilizare a dicționarului::

source: >>> tel = {'jack': 4098, 'sape': 4139} >>> tel['guido'] = 4127 >>> tel {'jack': 4098, 'sape': 4139, 'guido': 4127} >>> tel['jack'] 4098 >>> del tel['sape'] >>> tel['irv'] = 4127 >>> tel {'jack': 4098, 'guido': 4127, 'irv': 4127} >>> list(tel) ['jack', 'guido', 'irv'] >>> sorted(tel) ['guido', 'irv', 'jack'] >>> 'guido' in tel True >>> 'jack' not in tel False
ro: >>> telefon_interior = {'jack': 4098, 'sape': 4139} >>> telefon_interior['guido'] = 4127 >>> telefon_interior {'jack': 4098, 'sape': 4139, 'guido': 4127} >>> telefon_interior['jack'] 4098 >>> del telefon_interior['sape'] >>> telefon_interior['irv'] = 4127 >>> telefon_interior {'jack': 4098, 'guido': 4127, 'irv': 4127} >>> list(telefon_interior) ['jack', 'guido', 'irv'] >>> sorted(telefon_interior) ['guido', 'irv', 'jack'] >>> 'guido' in telefon_interior True >>> 'jack' not in telefon_interior False

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
ro: Constructorul :func:`dict` produce dicționare de date direct din secvențe de perechi cheie-valoare::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
ro: În plus, comprehensiunile de dicționare pot fi întrebuințate la a crea dicționare de date din expresii arbitrare folosite de post de chei și de valori::

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
ro: Atunci când cheile sunt simple șiruri de caractere este mai convenabil, uneori, să specificăm perechile dicționarului folosind argumente cuvânt-cheie::

source: Looping Techniques
ro: Tehnici de iterare

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`~dict.items` method. ::
ro: Atunci când iterăm de-a lungul unui dicționar, cheia și valoarea corespunzătoare ei pot fi capturate simultan cu ajutorul metodei :meth:`~dict.items`. ::

source: >>> knights = {'gallahad': 'the pure', 'robin': 'the brave'} >>> for k, v in knights.items(): ... print(k, v) ... gallahad the pure robin the brave
ro: >>> cavaleri = {'Gallahad': 'cel fără de prihană', 'Robin': 'cel viteaz'} >>> for k, v in cavaleri.items(): ... print(k, v) ... Gallahad cel fără de prihană Robin cel viteaz

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
ro: Atunci când iterăm de-a lungul unei secvențe, indicele de poziție și valoarea corespunzătoare lui pot fi capturate simultan cu ajutorul funcției :func:`enumerate`. ::

source: >>> for i, v in enumerate(['tic', 'tac', 'toe']): ... print(i, v) ... 0 tic 1 tac 2 toe
ro: >>> for i, v in enumerate(['x', 'și', 'zero']): ... print(i, v) ... 0 x 1 și 2 zero

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
ro: Pentru a itera de-a lungul a două sau mai multe secvențe în același timp, elementele acestora pot fi împerecheate cu ajutorul funcției :func:`zip`. ::

source: >>> questions = ['name', 'quest', 'favorite color'] >>> answers = ['lancelot', 'the holy grail', 'blue'] >>> for q, a in zip(questions, answers): ... print('What is your {0}? It is {1}.'.format(q, a)) ... What is your name? It is lancelot. What is your quest? It is the holy grail. What is your favorite color? It is blue.
ro: >>> întrebări = ['numele', 'țelul', 'stindardul tău'] >>> răspunsuri = ['Lancelot', 'Sfântul Potir', 'cel albastru'] >>> for q, a in zip(întrebări, răspunsuri): ... print('Care este {0} tău? Este {1}.'.format(q, a)) ... Care este numele tău? Este Lancelot. Care este țelul tău? Este Sfântul Potir. Care este stindardul tău? Este cel albastru.

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
ro: Pentru a itera de-a lungul unei secvențe în sens invers, mai întâi precizați secvența în ordinea ei obișnuită după care apelați funcția :func:`reversed`. ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
ro: Ca să iterați de-a lungul unei secvențe în ordinea sortării ei, utilizați funcția :func:`sorted` care va returna o listă nouă, sortată, lăsând nemodificată lista inițială. ::

source: >>> basket = ['apple', 'orange', 'apple', 'pear', 'orange', 'banana'] >>> for i in sorted(basket): ... print(i) ... apple apple banana orange orange pear
ro: >>> coș = ['măr', 'portocală', 'măr', 'pară', 'portocală', 'banană'] >>> for i in sorted(coș): ... print(i) ... banană măr măr pară portocală portocală

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
ro: Aplicând :func:`set` asupra unei secvențe îi eliminăm duplicatele. Întrebuințarea lui :func:`sorted` în combinație cu :func:`set` asupra unei secvențe constituie o modalitate idiomatică de a itera de-a lungul elementelor unicat ale secvenței în ordinea sortării acesteia. ::

source: >>> basket = ['apple', 'orange', 'apple', 'pear', 'orange', 'banana'] >>> for f in sorted(set(basket)): ... print(f) ... apple banana orange pear
ro: >>> coș = ['măr', 'portocală', 'măr', 'pară', 'portocală', 'banană'] >>> for f in sorted(set(coș)): ... print(f) ... banană măr pară portocală

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
ro: Este tentant, uneori, să modificăm o listă în timp ce iterăm de-a lungul ei; cu toate acestea, este adesea mai simplu și mai sigur să creăm o listă nouă în loc să o modificăm pe cea inițială. ::

source: >>> import math >>> raw_data = [56.2, float('NaN'), 51.7, 55.3, 52.5, float('NaN'), 47.8] >>> filtered_data = [] >>> for value in raw_data: ... if not math.isnan(value): ... filtered_data.append(value) ... >>> filtered_data [56.2, 51.7, 55.3, 52.5, 47.8]
ro: >>> import math >>> date_brute = [56.2, float('NaN'), 51.7, 55.3, 52.5, float('NaN'), 47.8] >>> date_filtrate = [] >>> for valoarea in date_brute: ... if not math.isnan(valoarea): ... date_filtrate.append(valoarea) ... >>> date_filtrate [56.2, 51.7, 55.3, 52.5, 47.8]

source: More on Conditions
ro: Mai multe despre expresiile de control

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
ro: *Condițiile* de îndeplinit (sau *expresiile condiționale* ori *expresiile de control*) conținute în instrucțiunile ``while`` și ``if`` pot folosi orice fel de operatori nu doar pe cei de comparație (relaționali).

source: The comparison operators ``in`` and ``not in`` are membership tests that determine whether a value is in (or not in) a container. The operators ``is`` and ``is not`` compare whether two objects are really the same object. All comparison operators have the same priority, which is lower than that of all numerical operators.
ro: Operatorii de comparație ``in`` și ``not in`` realizează teste de apartenență care determină dacă o valoare se află (sau nu se află) într-un container. Operatorii ``is`` și ``is not`` compară două obiecte pentru a stabili dacă ele sunt, cu adevărat, același obiect. Toți operatorii de comparație au aceeași prioritate, aceasta fiind mai mică decât cea a indiferent cărui operator numeric.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
ro: Operațiile de comparație pot fi înlănțuite. De exemplu, ``a < b == c`` va testa dacă ``a`` este (strict) mai mic decât ``b`` și dacă ``b`` este egal cu ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
ro: Expresiile condiționale pot fi combinate folosind operatorii booleeni ``and`` și ``or``, iar rezultatul unei comparații (ori valoarea de adevăr a oricărei alte expresii booleene) poate fi negat cu ``not``. Acești operatori booleeni au priorități mai mici decât cele ale operatorilor de comparație; dintre ei, ``not`` are prioritatea cea mai mare iar ``or`` pe cea mai mică, astfel că expresia ``A and not B or C`` este echivalentă cu ``(A and (not B)) or C``. Ca de obicei, parantezele rotunde pot fi întrebuințate la construcția compoziției dorite a oricărei expresii.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
ro: Operatorii booleeni ``and`` și ``or`` fac parte din așa-numiții *operatori de scurtcircuit*: argumentele (operanzii) lor se evaluează de la stânga către dreapta iar evaluarea se oprește de îndată ce rezultatul este determinat. De exemplu, dacă expresiile ``A`` și ``C`` sunt adevărate iar ``B`` este falsă, atunci evaluarea expresiei ``A and B and C`` nu necesită evaluarea lui ``C``. Dacă este folosită ca valoare generală și nu ca dată booleană (valoare de adevăr), valoarea returnată de un operator de scurtcircuit este ultimul argument evaluat.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
ro: Este posibil să atribuim rezultatul unei operații de comparare ori pe cel al evaluării altei expresii booleene unei variabile. De exemplu, ::

source: >>> string1, string2, string3 = '', 'Trondheim', 'Hammer Dance' >>> non_null = string1 or string2 or string3 >>> non_null 'Trondheim'
ro: >>> șirul1, șirul2, șirul3 = '', 'Trondheim', 'Hammer Dance' >>> nenul = șirul1 or șirul2 or șirul3 >>> nenul 'Trondheim'

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
ro: Atenție la faptul că în Python, spre deosebire de C, atribuirile din interiorul expresiilor trebuie realizate folosind în mod explicit :ref:`operatorul morsă <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. Această restricție ne permite să evităm un tip de dificultăți întâlnite în mod obișnuit la programarea în C: situația în care tastăm ``=`` într-o expresie în care intenționam să introducem ``==``.

source: Comparing Sequences and Other Types
ro: Comparând secvențe și alte tipuri de obiecte

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
ro: Obiectele secvență se compară, de obicei, cu alte obiecte de același tip secvență. Operația de comparare folosește ordinea *lexicografică*: mai întâi sunt comparate primul element al unuia din cele două obiecte cu primul element al celuilalt obiect, iar dacă acestea diferă unul de celălalt, atunci diferența dintre ele determină rezultatul comparației; în schimb, dacă cele două elemente sunt egale, atunci se va compara cel de-al doilea element al primului obiect cu cel de-al doilea element al celuilalt obiect și așa mai departe, până când vom ajunge la finalul (măcar) unuia dintre obiecte. Dacă se întâmplă ca elementele care sunt comparate să fie ele însele obiecte ale aceluiași tip secvență, atunci comparația lexicografică va fi continuată în mod recursiv. Dacă toate elementele celor două obiecte secvență sunt egale două câte două, atunci obiectele secvență vor fi considerate egale. Dacă unul dintre obiecte este, de la început, o sub-secvență a celuilalt obiect, atunci obiectul mai scurt este cel mai mic (dintre cele două). Ordinea lexicografică a șirurilor de caractere întrebuințează numerele de punct de cod Unicode pentru ordonarea caracterelor individuale. Iată câteva exemple de comparații între secvențe de același tip::
