Repository: octaG-M/python-docs-ro
Catalog: tutorial/errors.po
Languages: ro

source: Errors and Exceptions
ro: Erori și excepții

source: Until now error messages haven't been more than mentioned, but if you have tried out the examples you have probably seen some. There are (at least) two distinguishable kinds of errors: *syntax errors* and *exceptions*.
ro: Până la momentul de față, mesajele de eroare au cam fost trecute cu vederea, însă, dacă ați încercat toate exemplele, probabil că v-ați întâlnit cu ele. Există (cel puțin) două feluri distincte de erori: *erorile de sintaxă* și *excepțiile*.

source: Syntax Errors
ro: Erori de sintaxă

source: Syntax errors, also known as parsing errors, are perhaps the most common kind of complaint you get while you are still learning Python::
ro: Erorile de sintaxă, cunoscute și ca *erori de parsare*, sunt, de obicei, cele mai obișnuite tipuri de plângeri pe care vi le va adresa interpretorul cât timp n-ați terminat de învățat Python-ul::

source: >>> while True print('Hello world') File "<stdin>", line 1 while True print('Hello world') ^^^^^ SyntaxError: invalid syntax
ro: >>> while True print('Salutare, lume') File "<stdin>", line 1 while True print('Salutare, lume') ^^^^^ SyntaxError: invalid syntax

source: The parser repeats the offending line and displays little arrows pointing at the place where the error was detected. Note that this is not always the place that needs to be fixed. In the example, the error is detected at the function :func:`print`, since a colon (``':'``) is missing just before it.
ro: *Parserul* (parte a interpretorului) afișează linia care l-a supărat și îi adaugă vârfuri de săgeată îndreptate către porțiunea din linie unde a găsit o eroare. Remarcați că porțiunea indicată nu este, neapărat, cea în care trebuie făcute corecturi. În exemplu, greșeala este detectată în dreptul funcției :func:`print`, iar aceasta deoarece semnul de punctuație *două puncte* (``':'``) lipsește chiar din fața numelui funcției.

source: The file name (``<stdin>`` in our example) and line number are printed so you know where to look in case the input came from a file.
ro: Numele fișierului (în cazul nostru, ``<stdin>``) și numărul liniei de cod sunt și ele afișate pentru ca dumneavoastră să știți de unde să începeți căutarea erorii atunci când codul eronat provine dintr-un fișier.

source: Exceptions
ro: Excepții

source: Even if a statement or expression is syntactically correct, it may cause an error when an attempt is made to execute it. Errors detected during execution are called *exceptions* and are not unconditionally fatal: you will soon learn how to handle them in Python programs. Most exceptions are not handled by programs, however, and result in error messages as shown here::
ro: Chiar și atunci când o instrucțiune ori o expresie sunt corecte sintactic, ele pot cauza erori dacă încercăm să le executăm. Erorile detectate în timpul execuției codului se numesc *excepții* și nu sunt, obligatoriu, fatale: vom învăța în curând cum să le manevrăm în programele scrise în Python. Totuși, majoritatea excepțiilor nu sunt tratate de codul programului, conducând la mesaje de eroare aidoma celui arătat aici::

source: >>> 10 * (1/0) Traceback (most recent call last): File "<stdin>", line 1, in <module> 10 * (1/0) ~^~ ZeroDivisionError: division by zero >>> 4 + spam*3 Traceback (most recent call last): File "<stdin>", line 1, in <module> 4 + spam*3 ^^^^ NameError: name 'spam' is not defined >>> '2' + 2 Traceback (most recent call last): File "<stdin>", line 1, in <module> '2' + 2 ~~~~^~~ TypeError: can only concatenate str (not "int") to str
ro: >>> 10 * (1/0) Traceback (most recent call last): File "<stdin>", line 1, in <module> 10 * (1/0) ~^~ ZeroDivisionError: division by zero >>> 4 + varză*3 Traceback (most recent call last): File "<stdin>", line 1, in <module> 4 + varză*3 ^^^^^ NameError: name 'varză' is not defined >>> '2' + 2 Traceback (most recent call last): File "<stdin>", line 1, in <module> '2' + 2 ~~~~^~~ TypeError: can only concatenate str (not "int") to str

source: The last line of the error message indicates what happened. Exceptions come in different types, and the type is printed as part of the message: the types in the example are :exc:`ZeroDivisionError`, :exc:`NameError` and :exc:`TypeError`. The string printed as the exception type is the name of the built-in exception that occurred. This is true for all built-in exceptions, but need not be true for user-defined exceptions (although it is a useful convention). Standard exception names are built-in identifiers (not reserved keywords).
ro: Ultimul rând al mesajului de eroare ne informează despre ce s-a întâmplat. Excepțiile sunt de tipuri diferite, iar tipul lor este afișat ca parte a mesajului: tipurile excepțiilor din exemplu sunt :exc:`ZeroDivisionError`, :exc:`NameError` și :exc:`TypeError`. Șirul de caractere afișat pe post de tip al excepției este numele excepției predefinite care s-a produs. Acest comportament al interpretorului este regulă în ceea ce privește excepțiile predefinite, însă se poate să nu se adeverească și pentru indiferent care excepție definită de utilizator (chiar dacă reprezintă o convenție foarte utilă). Numele de excepții standard sunt identificatori predefiniți (dar nu cuvinte cheie rezervate).

source: The rest of the line provides detail based on the type of exception and what caused it.
ro: Restul rândului de mesaj oferă detalii bazate pe tipul de excepție și pe cauza (producerii) ei.

source: The preceding part of the error message shows the context where the exception occurred, in the form of a stack traceback. In general it contains a stack traceback listing source lines; however, it will not display lines read from standard input.
ro: Partea precedentă a mesajului de eroare ne arată contextul în care a apărut excepția, sub forma *derulării* (de la englezescul, ca jargon, *traceback*) unei *stive*. De obicei, această parte va conține derularea liniilor (rândurilor) de conținut ale stivei; cu toate acestea, nu vor fi afișate rândurile citite de la intrarea standard.

source: :ref:`bltin-exceptions` lists the built-in exceptions and their meanings.
ro: În :ref:`bltin-exceptions` se găsesc lista excepțiilor predefinite împreună cu semnificațiile acestora.

source: Handling Exceptions
ro: Tratarea excepțiilor

source: It is possible to write programs that handle selected exceptions. Look at the following example, which asks the user for input until a valid integer has been entered, but allows the user to interrupt the program (using :kbd:`Control-C` or whatever the operating system supports); note that a user-generated interruption is signalled by raising the :exc:`KeyboardInterrupt` exception. ::
ro: Putem scrie programe care să trateze (doar) anumite excepții. Haideți să aruncăm o privire asupra exemplului de mai jos, în care utilizatorului i se cere să introducă numere până când un număr întreg convenabil va fi tastat, îngăduindu-i-se, în schimb, să oprească execuția programului oricând dorește (cu combinația de taste :kbd:`Control-C` sau cu orice permite sistemul de operare folosit); trebuie remarcat că întreruperea (execuției) produsă de utilizator va fi semnalată prin *ridicarea* (de la englezescul *raising*; sau *lansarea*) excepției (de tipul) :exc:`KeyboardInterrupt`. ::

source: >>> while True: ... try: ... x = int(input("Please enter a number: ")) ... break ... except ValueError: ... print("Oops! That was no valid number. Try again...") ...
ro: >>> while True: ... try: ... x = int(input("Vă rog să introduceți un număr: ")) ... break ... except ValueError: ... print("Vai! Acest număr nu e bun. Mai încercați...") ...

source: The :keyword:`try` statement works as follows.
ro: Instrucțiunea :keyword:`try` funcționează după cum urmează.

source: First, the *try clause* (the statement(s) between the :keyword:`try` and :keyword:`except` keywords) is executed.
ro: Prima se execută *clauza try* (adică, grupul de instrucțiuni situate între cuvintele-cheie :keyword:`try` și :keyword:`except`).

source: If no exception occurs, the *except clause* is skipped and execution of the :keyword:`try` statement is finished.
ro: Dacă nu sunt întâlnite excepții, atunci se va sări peste *clauza except*, execuția instrucțiunii :keyword:`try` încheindu-se.

source: If an exception occurs during execution of the :keyword:`try` clause, the rest of the clause is skipped. Then, if its type matches the exception named after the :keyword:`except` keyword, the *except clause* is executed, and then execution continues after the try/except block.
ro: Dacă survine vreo excepție în timpul execuției clauzei :keyword:`try`, atunci se va sări peste restul clauzei. Presupunând că tipul excepției *se potrivește* (de la englezescul *match*) numelui de (tip de) excepție scris după cuvântul-cheie :keyword:`except`, se va executa *clauza except*, apoi execuția codului Python va trece la instrucțiunile situate după blocul try/except.

source: If an exception occurs which does not match the exception named in the *except clause*, it is passed on to outer :keyword:`try` statements; if no handler is found, it is an *unhandled exception* and execution stops with an error message.
ro: În cazul când numele excepției survenite nu se potrivește cu cel precizat în *clauza except*, acest nume va fi transmis către instrucțiunile :keyword:`try` exterioare; dacă nu va fi găsit niciun *manipulator de excepție* (de la englezescul *handler*; sau *procedură de tratare a excepției*) convenabil, atunci ne vom afla în fața unei *excepții netratate* (de către codul nostru Python; sau a unei *excepții neinterceptate*) iar execuția programului se va încheia brusc, furnizându-se un mesaj de eroare.

source: A :keyword:`try` statement may have more than one *except clause*, to specify handlers for different exceptions. At most one handler will be executed. Handlers only handle exceptions that occur in the corresponding *try clause*, not in other handlers of the same :keyword:`!try` statement. An *except clause* may name multiple exceptions as a parenthesized tuple, for example::
ro: O instrucțiune :keyword:`try` poate avea mai mult de o singură *clauză except*, deținând, din acest motiv, manipulatori (de excepție) pentru felurite excepții. Cel mult unul dintre acești manipulatori va fi executat. Un manipulator tratează acea excepție care survine în timpul execuției *clauzei try* corespunzătoare, nu și acele (eventuale) excepții care intervin în ceilalți manipulatori din aceeași instrucțiune :keyword:`!try`. O *clauză except* poate numi mai multe excepții, sub forma unui tuplu încadrat de paranteze rotunde, precum::

source: A class in an :keyword:`except` clause matches exceptions which are instances of the class itself or one of its derived classes (but not the other way around --- an *except clause* listing a derived class does not match instances of its base classes). For example, the following code will print B, C, D in that order::
ro: O clasă (numită) într-o clauză :keyword:`except` li se potrivește acelor excepții care sunt instanțe ale clasei însăși ori ale vreuneia din clasele derivate din clasa în cauză (dar nu și invers -- o *clauză except* care conține numele unei clase derivate nu se va potrivi cu nicio instanță a vreunei clase de bază). De exemplu, codul următor va afișa B, C, D în exact această ordine::

source: class B(Exception): pass class C(B): pass class D(C): pass for cls in [B, C, D]: try: raise cls() except D: print("D") except C: print("C") except B: print("B")
ro: class B(Exception): pass class C(B): pass class D(C): pass for clase in [B, C, D]: try: raise clase() except D: print("D") except C: print("C") except B: print("B")

source: Note that if the *except clauses* were reversed (with ``except B`` first), it would have printed B, B, B --- the first matching *except clause* is triggered.
ro: Observați că, dacă am fi inversat *clauzele except* (așezând-o pe ``except B`` prima), atunci s-ar fi afișat B, B, B --- deoarece prima *clauză except* potrivită (excepțiilor) s-ar fi declanșat.

source: When an exception occurs, it may have associated values, also known as the exception's *arguments*. The presence and types of the arguments depend on the exception type.
ro: Atunci când intervine o excepție, ei îi pot fi asociate diverse valori, cunoscute și sub numele de *argumente* ale excepției în cauză. Atât existența unor asemenea argumente cât și tipurile lor depind de tipul de excepție.

source: The *except clause* may specify a variable after the exception name. The variable is bound to the exception instance which typically has an ``args`` attribute that stores the arguments. For convenience, builtin exception types define :meth:`~object.__str__` to print all the arguments without explicitly accessing ``.args``. ::
ro: *Clauza except* poate specifica o variabilă la dreapta numelui excepției. Această variabilă este legată de instanța excepției, excepția având, de obicei, un atribut ``args`` în care sunt stocate asemenea valori (argumente ale excepției). Din rațiuni de utilitate, tipurile *builtin* (predefinite) de excepții definesc metoda :meth:`~object.__str__` ca să putem afișa argumentele unor asemenea excepții fără să mai fie nevoie de accesarea în mod explicit a lui ``.args``. ::

source: >>> try: ... raise Exception('spam', 'eggs') ... except Exception as inst: ... print(type(inst)) # the exception type ... print(inst.args) # arguments stored in .args ... print(inst) # __str__ allows args to be printed directly, ... # but may be overridden in exception subclasses ... x, y = inst.args # unpack args ... print('x =', x) ... print('y =', y) ... <class 'Exception'> ('spam', 'eggs') ('spam', 'eggs') x = spam y = eggs
ro: >>> try: ... raise Exception('șuncă presată', 'ouă') ... except Exception as hrană: ... print(type(hrană)) # tipul de excepție ... print(hrană.args) # valorile stocate în .args ... print(hrană) # __str__ ne permite să afișăm direct argumentele, ... # însă poate fi suprascrisă în moștenitorii clasei ... x, y = hrană.args # despachetarea lui args ... print('x =', x) ... print('y =', y) ... <class 'Exception'> ('șuncă presată', 'ouă') ('șuncă presată', 'ouă') x = șuncă presată y = ouă

source: The exception's :meth:`~object.__str__` output is printed as the last part ('detail') of the message for unhandled exceptions.
ro: Șirul returnat de metoda :meth:`~object.__str__` a unei excepții va fi afișat ca ultimă parte (cea de 'detalii') a mesajului de eroare produs de intervenția unei *excepții netratate*.

source: :exc:`BaseException` is the common base class of all exceptions. One of its subclasses, :exc:`Exception`, is the base class of all the non-fatal exceptions. Exceptions which are not subclasses of :exc:`Exception` are not typically handled, because they are used to indicate that the program should terminate. They include :exc:`SystemExit` which is raised by :meth:`sys.exit` and :exc:`KeyboardInterrupt` which is raised when a user wishes to interrupt the program.
ro: :exc:`BaseException` este clasa de bază (superclasa) a tuturor excepțiilor. Una din moștenitoarele sale, :exc:`Exception`, este clasa de bază a tuturor excepțiilor non-fatale. Excepțiile care nu-i sunt subclase (urmași) lui :exc:`Exception` nu sunt, de obicei, tratate (cu manipulatori de excepție), deoarece ele sunt întrebuințate la a ne arăta că execuția programului trebuie oprită. Asemenea excepții includ :exc:`SystemExit`, ridicată de :meth:`sys.exit`, respectiv :exc:`KeyboardInterrupt`, ridicată atunci când utilizatorul dorește să întrerupă programul.

source: :exc:`Exception` can be used as a wildcard that catches (almost) everything. However, it is good practice to be as specific as possible with the types of exceptions that we intend to handle, and to allow any unexpected exceptions to propagate on.
ro: :exc:`Exception` poate fi utilizată pe post de înlocuitor (de excepții specifice) capabil să *intercepteze* (de la englezescul *catch*) aproape orice fel de excepție. Cu toate acestea, *bunele practici* recomandă să fim cât mai la obiect cu putință vizavi de tipurile de excepții pe care suntem preocupați să le tratăm, permițându-le, în schimb, celorlalte excepții să se propage.

source: The most common pattern for handling :exc:`Exception` is to print or log the exception and then re-raise it (allowing a caller to handle the exception as well)::
ro: Șablonul (cel mai) obișnuit de tratare a lui :exc:`Exception` este fie prin afișarea excepției fie prin jurnalizarea ei, urmată de o nouă ridicare a excepției (ceea ce îi va permite unui apelant --- al codului --- să trateze, la rândul său, excepția)::

source: import sys try: f = open('myfile.txt') s = f.readline() i = int(s.strip()) except OSError as err: print("OS error:", err) except ValueError: print("Could not convert data to an integer.") except Exception as err: print(f"Unexpected {err=}, {type(err)=}") raise
ro: import sys try: f = open('fișierul_meu.txt') s = f.readline() i = int(s.strip()) except OSError as eroare: print("Eroare SO:", eroare) except ValueError: print("Data nu poate fi convertită într-un număr întreg.") except Exception as eroare: print(f"O (neașteptată) {eroare=}, {type(eroare)=}") raise

source: The :keyword:`try` ... :keyword:`except` statement has an optional *else clause*, which, when present, must follow all *except clauses*. It is useful for code that must be executed if the *try clause* does not raise an exception. For example::
ro: Instrucțiunea :keyword:`try` ... :keyword:`except` dispune și de o *clauză else* opțională, care, dacă o introducem în programul nostru, trebuie să fie poziționată *după* toate *clauzele except*. Ea este utilă atunci când execuția *clauzei try* nu va ridica nicio excepție. Ca exemplu::

source: for arg in sys.argv[1:]: try: f = open(arg, 'r') except OSError: print('cannot open', arg) else: print(arg, 'has', len(f.readlines()), 'lines') f.close()
ro: for argumentul in sys.argv[1:]: try: f = open(argumentul, 'r') except OSError: print('nu poate fi deschis', argumentul) else: print(argumentul, 'are', len(f.readlines()), 'linii') f.close()

source: The use of the :keyword:`!else` clause is better than adding additional code to the :keyword:`try` clause because it avoids accidentally catching an exception that wasn't raised by the code being protected by the :keyword:`!try` ... :keyword:`!except` statement.
ro: Întrebuințarea clauzei :keyword:`!else` este mai nimerită, în practică, decât adăugirile de cod în corpul clauzei :keyword:`try` și aceasta în special pentru că se evită interceptarea unor excepții care să nu fi fost ridicate chiar de către codul pe care l-am protejat cu instrucțiunea :keyword:`!try` ... :keyword:`!except`.

source: Exception handlers do not handle only exceptions that occur immediately in the *try clause*, but also those that occur inside functions that are called (even indirectly) in the *try clause*. For example::
ro: Manipulatorii de excepții nu tratează doar acele excepții care intervin direct în codul din *clauza try*, ci și pe acelea care survin în codul funcțiilor apelate (fie și indirect) în cadrul *clauzei try*. Precum aici (expresia englezească *run-time*, de jargon informatic, se poate traduce prin *în timpul execuției*)::

source: >>> def this_fails(): ... x = 1/0 ... >>> try: ... this_fails() ... except ZeroDivisionError as err: ... print('Handling run-time error:', err) ... Handling run-time error: division by zero
ro: >>> def cod_care_nu_funcționează(): ... x = 1/0 ... >>> try: ... cod_care_nu_funcționează() ... except ZeroDivisionError as eroarea: ... print('Tratând o eroare din timpul execuției:', eroarea) ... Tratând o eroare din timpul execuției: division by zero

source: Raising Exceptions
ro: Ridicând excepții

source: The :keyword:`raise` statement allows the programmer to force a specified exception to occur. For example::
ro: Instrucțiunea :keyword:`raise` îi îngăduie programatorului să *forțeze* apariția unei anumite excepții. De exemplu::

source: >>> raise NameError('HiThere') Traceback (most recent call last): File "<stdin>", line 1, in <module> raise NameError('HiThere') NameError: HiThere
ro: >>> raise NameError('Salutare') Traceback (most recent call last): File "<stdin>", line 1, in <module> raise NameError('Salutare') NameError: Salutare

source: The sole argument to :keyword:`raise` indicates the exception to be raised. This must be either an exception instance or an exception class (a class that derives from :class:`BaseException`, such as :exc:`Exception` or one of its subclasses). If an exception class is passed, it will be implicitly instantiated by calling its constructor with no arguments::
ro: Argumentul (unic al) lui :keyword:`raise` indică excepția care urmează a fi ridicată. Aceasta trebuie să fie sau instanța unei (clase de) excepții sau chiar o clasă de excepții (adică, o clasă derivată din :class:`BaseException`, precum :exc:`Exception` ori vreunul din urmașii ei). Atunci când se transmite (drept argument unic) o clasă de excepții, aceasta va fi instanțiată în mod implicit prin apelarea constructorului fără argumente de care dispune::

source: raise ValueError # shorthand for 'raise ValueError()'
ro: raise ValueError # o prescurtare a lui 'raise ValueError()'

source: If you need to determine whether an exception was raised but don't intend to handle it, a simpler form of the :keyword:`raise` statement allows you to re-raise the exception::
ro: Presupunând că doriți să știți dacă s-a ridicat vreo excepție însă nu vă interesează și să o tratați, puteți folosi forma simplificată a instrucțiunii :keyword:`raise` în cadrul căreia vi se permite relansarea excepției în cauză::

source: >>> try: ... raise NameError('HiThere') ... except NameError: ... print('An exception flew by!') ... raise ... An exception flew by! Traceback (most recent call last): File "<stdin>", line 2, in <module> raise NameError('HiThere') NameError: HiThere
ro: >>> try: ... raise NameError('Salutare') ... except NameError: ... print('Tocmai ne-a depășit o excepție!') ... raise ... Tocmai ne-a depășit o excepție! Traceback (most recent call last): File "<stdin>", line 2, in <module> raise NameError('Salutare') NameError: Salutare

source: Exception Chaining
ro: Înlănțuirea excepțiilor

source: If an unhandled exception occurs inside an :keyword:`except` section, it will have the exception being handled attached to it and included in the error message::
ro: Atunci când o excepție netratată survine în interiorul unei secțiuni (clauze) :keyword:`except`, excepția care chiar este tratată îi va fi atașată, respectiv va fi menționată în mesajul de eroare::

source: >>> try: ... open("database.sqlite") ... except OSError: ... raise RuntimeError("unable to handle error") ... Traceback (most recent call last): File "<stdin>", line 2, in <module> open("database.sqlite") ~~~~^^^^^^^^^^^^^^^^^^^ FileNotFoundError: [Errno 2] No such file or directory: 'database.sqlite' During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError("unable to handle error") RuntimeError: unable to handle error
ro: >>> try: ... open("baza_de_date.sqlite") ... except OSError: ... raise RuntimeError("nu putem trata eroarea") ... Traceback (most recent call last): File "<stdin>", line 2, in <module> open("baza_de_date.sqlite") ~~~~^^^^^^^^^^^^^^^^^^^^^^^ FileNotFoundError: [Errno 2] No such file or directory: 'baza_de_date.sqlite' During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError("nu putem trata eroarea") RuntimeError: nu putem trata eroarea
