Repository: octaG-M/python-docs-ro
Catalog: tutorial/errors.po
Languages: ro

source: >>> def f(): ... raise OSError('operation failed') ... >>> excs = [] >>> for i in range(3): ... try: ... f() ... except Exception as e: ... e.add_note(f'Happened in Iteration {i+1}') ... excs.append(e) ... >>> raise ExceptionGroup('We have some problems', excs) + Exception Group Traceback (most recent call last): | File "<stdin>", line 1, in <module> | raise ExceptionGroup('We have some problems', excs) | ExceptionGroup: We have some problems (3 sub-exceptions) +-+---------------- 1 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | f() | ~^^ | File "<stdin>", line 2, in f | raise OSError('operation failed') | OSError: operation failed | Happened in Iteration 1 +---------------- 2 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | f() | ~^^ | File "<stdin>", line 2, in f | raise OSError('operation failed') | OSError: operation failed | Happened in Iteration 2 +---------------- 3 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | f() | ~^^ | File "<stdin>", line 2, in f | raise OSError('operation failed') | OSError: operation failed | Happened in Iteration 3 +------------------------------------ >>>
ro: >>> def funcția(): ... raise OSError('operația a dat greș') ... >>> excepțiile = [] >>> for i in range(3): ... try: ... funcția() ... except Exception as excepția: ... excepția.add_note(f'A survenit la iterația {i+1}') ... excepțiile.append(excepția) ... >>> raise ExceptionGroup('Au apărut probleme', excepțiile) + Exception Group Traceback (most recent call last): | File "<stdin>", line 1, in <module> | raise ExceptionGroup('Au apărut probleme', excepțiile) | ExceptionGroup: Au apărut probleme (3 sub-exceptions) +-+---------------- 1 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | funcția() | ~~~~~~~^^ | File "<stdin>", line 2, in funcția | raise OSError('operația a dat greș') | OSError: operația a dat greș | A survenit la iterația 1 +---------------- 2 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | funcția() | ~~~~~~~^^ | File "<stdin>", line 2, in funcția | raise OSError('operația a dat greș') | OSError: operația a dat greș | A survenit la iterația 2 +---------------- 3 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | funcția() | ~~~~~~~^^ | File "<stdin>", line 2, in funcția | raise OSError('operația a dat greș') | OSError: operația a dat greș | A survenit la iterația 3 +------------------------------------ >>>
