Repository: octaG-M/python-docs-ro
Catalog: tutorial/errors.po
Languages: ro

source: To indicate that an exception is a direct consequence of another, the :keyword:`raise` statement allows an optional :keyword:`from<raise>` clause::
ro: Pentru a indica faptul că o excepție este consecința directă a altei excepții, instrucțiunea :keyword:`raise` dispune de clauza opțională :keyword:`from<raise>`::

source: # exc must be exception instance or None. raise RuntimeError from exc
ro: # excepția este fie instanța unei excepții fie None. raise RuntimeError from excepția

source: This can be useful when you are transforming exceptions. For example::
ro: Această clauză ne poate fi de folos atunci când transformăm excepții. Ca aici::

source: >>> def func(): ... raise ConnectionError ... >>> try: ... func() ... except ConnectionError as exc: ... raise RuntimeError('Failed to open database') from exc ... Traceback (most recent call last): File "<stdin>", line 2, in <module> func() ~~~~^^ File "<stdin>", line 2, in func ConnectionError The above exception was the direct cause of the following exception: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError('Failed to open database') from exc RuntimeError: Failed to open database
ro: >>> def funcția(): ... raise ConnectionError ... >>> try: ... funcția() ... except ConnectionError as excepția: ... raise RuntimeError('Nu putem deschide baza de date') from excepția ... Traceback (most recent call last): File "<stdin>", line 2, in <module> funcția() ~~~~~~~^^ File "<stdin>", line 2, in funcția ConnectionError The above exception was the direct cause of the following exception: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError('Nu putem deschide baza de date') from excepția RuntimeError: Nu putem deschide baza de date

source: It also allows disabling automatic exception chaining using the ``from None`` idiom::
ro: Tot ea ne ajută să dezafectăm înlănțuirea automată de excepții, cu ajutorul idiomului ``from None``::

source: >>> try: ... open('database.sqlite') ... except OSError: ... raise RuntimeError from None ... Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError from None RuntimeError
ro: >>> try: ... open('baza_de_date.sqlite') ... except OSError: ... raise RuntimeError from None ... Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError from None RuntimeError

source: For more information about chaining mechanics, see :ref:`bltin-exceptions`.
ro: Pentru mai multe informații privitoare la mecanismul înlănțuirii, vezi :ref:`bltin-exceptions`.

source: User-defined Exceptions
ro: Excepții definite de utilizator

source: Programs may name their own exceptions by creating a new exception class (see :ref:`tut-classes` for more about Python classes). Exceptions should typically be derived from the :exc:`Exception` class, either directly or indirectly.
ro: Programatorii își pot denumi propriile excepții prin crearea unei noi clase de excepții (a se vedea :ref:`tut-classes` pentru mai multe despre clase în Python). Excepțiile derivă, în mod obișnuit, din clasa :exc:`Exception`, atât direct cât și indirect.

source: Exception classes can be defined which do anything any other class can do, but are usually kept simple, often only offering a number of attributes that allow information about the error to be extracted by handlers for the exception.
ro: Clasele de excepții pot realiza tot ce poate realiza oricare altă clasă în Python, însă se recomandă să fie păstrate simple, dispunând doar de un număr limitat de atribute care să le permită manipulatorilor de excepții asociați lor să extragă informații despre excepția survenită.

source: Most exceptions are defined with names that end in "Error", similar to the naming of the standard exceptions.
ro: Majoritatea excepțiilor se definesc cu nume terminate în "Error" (Eroare), aidoma denumirii excepțiilor standard.

source: Many standard modules define their own exceptions to report errors that may occur in functions they define.
ro: Multe module standard își definesc propriile excepții pentru a raporta erorile ce pot apărea la execuția funcțiilor conținute în modulele respective.

source: Defining Clean-up Actions
ro: Definirea unor acțiuni de curățare

source: The :keyword:`try` statement has another optional clause which is intended to define clean-up actions that must be executed under all circumstances. For example::
ro: Instrucțiunea :keyword:`try` posedă încă o clauză opțională, destinată (mai ales) acțiunilor de *curățare* care trebuie realizate în absolut toate împrejurările. Cum ar fi::

source: >>> try: ... raise KeyboardInterrupt ... finally: ... print('Goodbye, world!') ... Goodbye, world! Traceback (most recent call last): File "<stdin>", line 2, in <module> raise KeyboardInterrupt KeyboardInterrupt
ro: >>> try: ... raise KeyboardInterrupt ... finally: ... print('Adio, lume!') ... Adio, lume! Traceback (most recent call last): File "<stdin>", line 2, in <module> raise KeyboardInterrupt KeyboardInterrupt

source: If a :keyword:`finally` clause is present, the :keyword:`!finally` clause will execute as the last task before the :keyword:`try` statement completes. The :keyword:`!finally` clause runs whether or not the :keyword:`!try` statement produces an exception. The following points discuss more complex cases when an exception occurs:
ro: Atunci când clauza :keyword:`finally` este prezentă, această clauză :keyword:`!finally` va fi executată ca *ultima* activitate din cadrul instrucțiunii :keyword:`try`. Codul din clauza :keyword:`!finally` va fi rulat indiferent dacă instrucțiunea :keyword:`!try` a condus sau nu la apariția de excepții. La punctele care urmează, discutăm despre situațiile mai complicate când poate apărea vreo excepție:

source: If an exception occurs during execution of the :keyword:`!try` clause, the exception may be handled by an :keyword:`except` clause. If the exception is not handled by an :keyword:`!except` clause, the exception is re-raised after the :keyword:`!finally` clause has been executed.
ro: Dacă survine o excepție în timpul executării clauzei :keyword:`!try`, excepția în cauză poate fi tratată de una din clauzele :keyword:`except`. Presupunând că excepția nu va fi interceptată de niciuna din clauzele :keyword:`!except`, ea va fi relansată după încheierea execuției clauzei :keyword:`!finally`.

source: An exception could occur during execution of an :keyword:`!except` or :keyword:`!else` clause. Again, the exception is re-raised after the :keyword:`!finally` clause has been executed.
ro: Se poate ca vreo excepție să survină când este executată fie una din clauzele :keyword:`!except` fie clauza :keyword:`!else`. Și aici, excepția va fi relansată după ce se va încheia executarea codului din clauza :keyword:`!finally`.

source: If the :keyword:`!finally` clause executes a :keyword:`break`, :keyword:`continue` or :keyword:`return` statement, exceptions are not re-raised.
ro: Dacă în clauza :keyword:`!finally` se execută vreuna din instrucțiunile :keyword:`break`, :keyword:`continue` ori :keyword:`return`, eventualele excepții nu vor mai fi relansate.

source: If the :keyword:`!try` statement reaches a :keyword:`break`, :keyword:`continue` or :keyword:`return` statement, the :keyword:`!finally` clause will execute just prior to the :keyword:`!break`, :keyword:`!continue` or :keyword:`!return` statement's execution.
ro: Atunci când, la execuția codului din instrucțiunea :keyword:`!try` întâlnim vreuna din instrucțiunile :keyword:`break`, :keyword:`continue` sau :keyword:`return`, clauza :keyword:`!finally` va fi executată *chiar înainte* de execuția oricăreia din instrucțiunile :keyword:`!break`, :keyword:`!continue` ori :keyword:`!return`.

source: If a :keyword:`!finally` clause includes a :keyword:`!return` statement, the returned value will be the one from the :keyword:`!finally` clause's :keyword:`!return` statement, not the value from the :keyword:`!try` clause's :keyword:`!return` statement.
ro: Dacă clauza :keyword:`!finally` include vreo instrucțiune :keyword:`!return`, atunci valoarea returnată va fi cea dată de instrucțiunea :keyword:`!return` a respectivei clauze :keyword:`!finally` și nu valoarea dată de eventuala instrucțiune :keyword:`!return` a clauzei :keyword:`!try`.

source: For example::
ro: Un exemplu::

source: >>> def bool_return(): ... try: ... return True ... finally: ... return False ... >>> bool_return() False
ro: >>> def întoarce_valoare_de_adevăr(): ... try: ... return True ... finally: ... return False ... >>> întoarce_valoare_de_adevăr() False

source: A more complicated example::
ro: Alt exemplu, mai sofisticat::

source: >>> def divide(x, y): ... try: ... result = x / y ... except ZeroDivisionError: ... print("division by zero!") ... else: ... print("result is", result) ... finally: ... print("executing finally clause") ... >>> divide(2, 1) result is 2.0 executing finally clause >>> divide(2, 0) division by zero! executing finally clause >>> divide("2", "1") executing finally clause Traceback (most recent call last): File "<stdin>", line 1, in <module> divide("2", "1") ~~~~~~^^^^^^^^^^ File "<stdin>", line 3, in divide result = x / y ~~^~~ TypeError: unsupported operand type(s) for /: 'str' and 'str'
ro: >>> def împărțire(x, y): ... try: ... rezultat = x / y ... except ZeroDivisionError: ... print("împărțire la zero!") ... else: ... print("rezultatul este", rezultat) ... finally: ... print("executăm clauza finally") ... >>> împărțire(2, 1) rezultatul este 2.0 executăm clauza finally >>> împărțire(2, 0) împărțire la zero! executăm clauza finally >>> împărțire("2", "1") executăm clauza finally Traceback (most recent call last): File "<stdin>", line 1, in <module> împărțire("2", "1") ~~~~~~~~~^^^^^^^^^^ File "<stdin>", line 3, in împărțire rezultat = x / y ~~^~~ TypeError: unsupported operand type(s) for /: 'str' and 'str'

source: As you can see, the :keyword:`finally` clause is executed in any event. The :exc:`TypeError` raised by dividing two strings is not handled by the :keyword:`except` clause and therefore re-raised after the :keyword:`!finally` clause has been executed.
ro: După cum puteți vedea, clauza :keyword:`finally` a fost executată în toate situațiile. Excepția :exc:`TypeError`, ridicată de încercarea de a realiza împărțirea a două șiruri de caractere, nu este tratată de clauza :keyword:`except` și, prin urmare, a fost relansată după ce s-a încheiat execuția clauzei :keyword:`!finally`.

source: In real world applications, the :keyword:`finally` clause is useful for releasing external resources (such as files or network connections), regardless of whether the use of the resource was successful.
ro: În aplicațiile *din lumea reală* (sau *de producție*), clauza :keyword:`finally` se întrebuințează (mai ales) la *eliberarea* resurselor externe (precum fișierele sau conexiunile la rețeaua Internet), indiferent dacă accesul la acestea a putut fi realizat.

source: Predefined Clean-up Actions
ro: Acțiuni de curățare predefinite

source: Some objects define standard clean-up actions to be undertaken when the object is no longer needed, regardless of whether or not the operation using the object succeeded or failed. Look at the following example, which tries to open a file and print its contents to the screen. ::
ro: Anumite obiecte definesc acțiuni de curățare standard, acestea urmând să fie realizate atunci când nu mai avem nevoie de obiectul în cauză, indiferent dacă operația care a folosit obiectul respectiv s-a putut sau nu realiza. Să aruncăm o privire asupra exemplului de mai jos, în care se încearcă deschiderea unui fișier, urmată de afișarea conținutului acestuia. ::

source: for line in open("myfile.txt"): print(line, end="")
ro: for rândul in open("fișierul_meu.txt"): print(rândul, end="")

source: The problem with this code is that it leaves the file open for an indeterminate amount of time after this part of the code has finished executing. This is not an issue in simple scripts, but can be a problem for larger applications. The :keyword:`with` statement allows objects like files to be used in a way that ensures they are always cleaned up promptly and correctly. ::
ro: Scăparea (programatică) din acest cod este aceea că fișierul va fi lăsat deschis pe o durată nedeterminată după ce interpretorul a terminat de executat codul. O asemenea situație nu le impietează prea mult unor scripturi simple, însă poate deveni problematică pentru aplicații complexe. Instrucțiunea :keyword:`with` le facilitează obiectelor precum fișierele o utilizare corectă, astfel încât resursele blocate de ele să fie eliberate prompt și corect, întotdeauna.

source: with open("myfile.txt") as f: for line in f: print(line, end="")
ro: with open("fișierul_meu.txt") as fișier: for rândul in fișier: print(rândul, end="")

source: After the statement is executed, the file *f* is always closed, even if a problem was encountered while processing the lines. Objects which, like files, provide predefined clean-up actions will indicate this in their documentation.
ro: Odată ce instrucțiunea a fost executată, fișierul *fișier* va fi închis, în mod garantat, inclusiv în situația în care ar fi existat dificultăți la procesarea rândurilor sale. Acele obiecte care, aidoma obiectelor fișier, oferă acțiuni de curățare (eliberare de resurse) predefinite, trebuie să indice o atare capacitate în documentația aferentă.

source: Raising and Handling Multiple Unrelated Exceptions
ro: Ridicarea și tratarea de excepții grupate, fără legătură una cu alta

source: There are situations where it is necessary to report several exceptions that have occurred. This is often the case in concurrency frameworks, when several tasks may have failed in parallel, but there are also other use cases where it is desirable to continue execution and collect multiple errors rather than raise the first exception.
ro: Vom întâlni situații în care va fi nevoie să raportăm laolaltă apariția mai multor excepții. Un exemplu frecvent este dat de incidentele de pe platformele de programare concurentă (de la englezescul, în jargon, *concurency framework*), atunci când mai multe activități eșuează simultan, dar nu sunt rare nici cazurile când dorim ca execuția unui program să continue în pofida apariției unei erori, colectând toate erorile survenite pe parcurs în loc să lansăm o excepție chiar de la producerea primului incident.

source: The builtin :exc:`ExceptionGroup` wraps a list of exception instances so that they can be raised together. It is an exception itself, so it can be caught like any other exception. ::
ro: Clasa predefinită :exc:`ExceptionGroup` aduce împreună o listă de instanțe ale unor (clase de) excepții astfel încât acestea să poată fi ridicate simultan. Ea însăși este o excepție, așadar poate fi interceptată ca orice altă excepție. ::

source: >>> def f(): ... excs = [OSError('error 1'), SystemError('error 2')] ... raise ExceptionGroup('there were problems', excs) ... >>> f() + Exception Group Traceback (most recent call last): | File "<stdin>", line 1, in <module> | f() | ~^^ | File "<stdin>", line 3, in f | raise ExceptionGroup('there were problems', excs) | ExceptionGroup: there were problems (2 sub-exceptions) +-+---------------- 1 ---------------- | OSError: error 1 +---------------- 2 ---------------- | SystemError: error 2 +------------------------------------ >>> try: ... f() ... except Exception as e: ... print(f'caught {type(e)}: e') ... caught <class 'ExceptionGroup'>: e >>>
ro: >>> def funcția(): ... excepțiile = [OSError('eroarea 1'), SystemError('eroarea 2')] ... raise ExceptionGroup('am avut probleme', excepțiile) ... >>> funcția() + Exception Group Traceback (most recent call last): | File "<stdin>", line 1, in <module> | funcția() | ~~~~~~~^^ | File "<stdin>", line 3, in funcția | raise ExceptionGroup('am avut probleme', excepțiile) | ExceptionGroup: am avut probleme (2 sub-exceptions) +-+---------------- 1 ---------------- | OSError: eroarea 1 +---------------- 2 ---------------- | SystemError: eroarea 2 +------------------------------------ >>> try: ... funcția() ... except Exception as excepție: ... print(f'am interceptat {type(excepție)}: excepție') ... am interceptat <class 'ExceptionGroup'>: excepție >>>

source: By using ``except*`` instead of ``except``, we can selectively handle only the exceptions in the group that match a certain type. In the following example, which shows a nested exception group, each ``except*`` clause extracts from the group exceptions of a certain type while letting all other exceptions propagate to other clauses and eventually to be reraised. ::
ro: Întrebuințându-l pe ``except*`` în locul lui ``except``, vom putea trata selectiv excepțiile, adică ne vom putea ocupa *doar* de acelea care se potrivesc unui anumit tip. În exemplul dat în continuare, care evidențiază grupuri imbricate de excepții, fiecare clauză ``except*`` extrage din aceste grupuri imbricate doar excepțiile de un anume tip, lăsându-le pe toate celelalte să se propage la restul clauzelor pentru a fi, eventual, relansate. ::

source: >>> def f(): ... raise ExceptionGroup( ... "group1", ... [ ... OSError(1), ... SystemError(2), ... ExceptionGroup( ... "group2", ... [ ... OSError(3), ... RecursionError(4) ... ] ... ) ... ] ... ) ... >>> try: ... f() ... except* OSError as e: ... print("There were OSErrors") ... except* SystemError as e: ... print("There were SystemErrors") ... There were OSErrors There were SystemErrors + Exception Group Traceback (most recent call last): | File "<stdin>", line 2, in <module> | f() | ~^^ | File "<stdin>", line 2, in f | raise ExceptionGroup( | ...<12 lines>... | ) | ExceptionGroup: group1 (1 sub-exception) +-+---------------- 1 ---------------- | ExceptionGroup: group2 (1 sub-exception) +-+---------------- 1 ---------------- | RecursionError: 4 +------------------------------------ >>>
ro: >>> def funcția(): ... raise ExceptionGroup( ... "grupul1", ... [ ... OSError(1), ... SystemError(2), ... ExceptionGroup( ... "grupul2", ... [ ... OSError(3), ... RecursionError(4) ... ] ... ) ... ] ... ) ... >>> try: ... funcția() ... except* OSError as excepție: ... print("Au apărut erori SO") ... except* SystemError as excepție: ... print("Au apărut erori de sistem") ... Au apărut erori SO Au apărut erori de sistem + Exception Group Traceback (most recent call last): | File "<stdin>", line 2, in <module> | funcția() | ~~~~~~~^^ | File "<stdin>", line 2, in funcția | raise ExceptionGroup( | ...<12 lines>... | ) | ExceptionGroup: grupul1 (1 sub-exception) +-+---------------- 1 ---------------- | ExceptionGroup: grupul2 (1 sub-exception) +-+---------------- 1 ---------------- | RecursionError: 4 +------------------------------------ >>>

source: Note that the exceptions nested in an exception group must be instances, not types. This is because in practice the exceptions would typically be ones that have already been raised and caught by the program, along the following pattern::
ro: Să remarcăm că excepțiile imbricate într-un grup de excepții trebuie să fie instanțe (ale unor clase de excepții) și nu tipuri (adică, clase de excepții). Aceasta pentru că, în practică, asemenea excepții imbricate sunt, de obicei, acelea pe care programul deja le-a lansat și le-a interceptat, urmând șablonul de aici::

source: >>> excs = [] ... for test in tests: ... try: ... test.run() ... except Exception as e: ... excs.append(e) ... >>> if excs: ... raise ExceptionGroup("Test Failures", excs) ...
ro: >>> excepțiile = [] ... for testul in testele: ... try: ... testul.run() ... except Exception as excepția: ... excepțiile.append(excepția) ... >>> if excepțiile: ... raise ExceptionGroup("Au căzut la test", excepțiile) ...

source: Enriching Exceptions with Notes
ro: Îmbogățind excepțiile cu notițe

source: When an exception is created in order to be raised, it is usually initialized with information that describes the error that has occurred. There are cases where it is useful to add information after the exception was caught. For this purpose, exceptions have a method ``add_note(note)`` that accepts a string and adds it to the exception's notes list. The standard traceback rendering includes all notes, in the order they were added, after the exception. ::
ro: Atunci când o excepție este creată, urmând a fi lansată, ea se inițializată, de obicei, cu informații referitoare la eroarea tocmai survenită. În anumite situații, ne interesează să le adăugăm informațiilor în cauză (ale instanței excepției) detalii suplimentare, însă doar *după* ce am interceptat excepția. Pentru un atare scop, excepțiile dispun de metoda ``add_note(notițe)``, care acceptă un șir de caractere drept argument și îl adaugă listei de notițe ale excepției. Derularea tipică (a stivei) afișează toate notițele, în ordinea introducerii lor, în continuarea excepției. ::

source: >>> try: ... raise TypeError('bad type') ... except Exception as e: ... e.add_note('Add some information') ... e.add_note('Add some more information') ... raise ... Traceback (most recent call last): File "<stdin>", line 2, in <module> raise TypeError('bad type') TypeError: bad type Add some information Add some more information >>>
ro: >>> try: ... raise TypeError('tip greșit') ... except Exception as excepția: ... excepția.add_note('Mai adaug informații') ... excepția.add_note('Mai adaug și alte informații') ... raise ... Traceback (most recent call last): File "<stdin>", line 2, in <module> raise TypeError('tip greșit') TypeError: tip greșit Mai adaug informații Mai adaug și alte informații >>>

source: For example, when collecting exceptions into an exception group, we may want to add context information for the individual errors. In the following each exception in the group has a note indicating when this error has occurred. ::
ro: Cu titlu de exemplu, atunci când așezăm împreună variate excepții într-un grup de excepții, este de așteptat să ne dorim să adăugăm informații contextuale pentru erorile individuale (luate în parte). În codul de mai jos, fiecare excepție din grup va fi urmată de o notiță în care se precizează când a avut loc eroarea respectivă. ::
