Repository: octaG-M/python-docs-ro
Catalog: tutorial/floatingpoint.po
Languages: ro

source: If we multiply that fraction by 10\*\*55, we can see the value out to 55 decimal digits:
ro: Dacă înmulțim fracția in cauză cu 10\*\*55, atunci îi vom vedea valoarea scrisă cu 55 de cifre zecimale:

source: meaning that the exact number stored in the computer is equal to the decimal value 0.1000000000000000055511151231257827021181583404541015625. Instead of displaying the full decimal value, many languages (including older versions of Python), round the result to 17 significant digits:
ro: ceea ce înseamnă că numărul stocat în calculator este egal cu valoarea zecimală 0.1000000000000000055511151231257827021181583404541015625. În loc să afișeze această valoare zecimală în întregime, multe limbaje de programare (și, printre ele, versiunile mai vechi ale Python-ului), o vor rotunji la 17 cifre semnificative:

source: The :mod:`fractions` and :mod:`decimal` modules make these calculations easy:
ro: Modulele :mod:`fractions` și :mod:`decimal` ușurează aceste calcule:
