Repository: octaG-M/python-docs-ro
Catalog: tutorial/inputoutput.po
Languages: ro

source: Input and Output
ro: Intrări și ieșiri

source: There are several ways to present the output of a program; data can be printed in a human-readable form, or written to a file for future use. This chapter will discuss some of the possibilities.
ro: Există mai multe moduri de a prezenta *rezultatul* (sau *ieșirea*, de la englezescul *output*) execuției unui program; datele conținute în acest rezultat pot fi afișate într-o formă ușor de citit de către utilizatorii umani (în englezește, ca jargon, *human-readable*) sau pot fi scrise într-un fișier pentru o întrebuințare ulterioară. În capitolul de față vom discuta despre câteva din aceste feluri de prezentare.

source: Fancier Output Formatting
ro: Formatări elegante ale ieșirii

source: So far we've encountered two ways of writing values: *expression statements* and the :func:`print` function. (A third way is using the :meth:`~io.TextIOBase.write` method of file objects; the standard output file can be referenced as ``sys.stdout``. See the Library Reference for more information on this.)
ro: Până acum am întâlnit două modalități de scriere a valorilor: formulările de *expresii* și funcția :func:`print`. (O a treia modalitate este să folosim metoda :meth:`~io.TextIOBase.write` a obiectelor fișier; fișierul standard de ieșire poate fi accesat ca ``sys.stdout``. Vedeți Referința bibliotecii pentru mai multe informații în această privință.)

source: Often you'll want more control over the formatting of your output than simply printing space-separated values. There are several ways to format output.
ro: Adesea, veți dori să aveți mai mult control asupra formatului datelor de afișat decât simpla posibilitate de a le tipări cu câte un spațiu gol între ele. Dispunem de diferite procedee de a formata ieșirile.

source: To use :ref:`formatted string literals <tut-f-strings>`, begin a string with ``f`` or ``F`` before the opening quotation mark or triple quotation mark. Inside this string, you can write a Python expression between ``{`` and ``}`` characters that can refer to variables or literal values.
ro: Pentru a folosi :ref:`șiruri de caractere literale formatate <tut-f-strings>`, începeți șirul cu ``f`` sau cu ``F``, poziționate înaintea ghilimelelor duble ori a celor triple de deschidere. În interiorul unui asemenea șir de caractere, puteți scrie o expresie Python încadrată de caracterele ``{`` și ``}``, care să se refere la variabile ori la date literale.

source: >>> year = 2016 >>> event = 'Referendum' >>> f'Results of the {year} {event}' 'Results of the 2016 Referendum'
ro: >>> anul = 2016 >>> evenimentul = 'referendumul' >>> f'Rezultate la {evenimentul} din {anul}.' 'Rezultate la referendumul din 2016.'

source: The :meth:`str.format` method of strings requires more manual effort. You'll still use ``{`` and ``}`` to mark where a variable will be substituted and can provide detailed formatting directives, but you'll also need to provide the information to be formatted. In the following code block there are two examples of how to format variables:
ro: Metoda :meth:`str.format` a șirurilor de caractere necesită puțin mai multă muncă de redactare. Și aici veți utiliza ``{`` și ``}`` la încadrarea locului în care va fi substituită o anumită variabilă, respectiv veți avea posibilitatea de a da indicații detaliate în privința formatării, doar că va trebui să oferiți și informația de formatat. În blocul de cod care urmează se află două exemple despre cum se formatează variabilele:

source: >>> yes_votes = 42_572_654 >>> total_votes = 85_705_149 >>> percentage = yes_votes / total_votes >>> '{:-9} YES votes {:2.2%}'.format(yes_votes, percentage) ' 42572654 YES votes 49.67%'
ro: >>> voturi_pentru = 42_572_654 >>> voturi_in_total = 85_705_149 >>> procentaj = voturi_pentru / voturi_in_total >>> '{:-9} voturi PENTRU {:2.2%}'.format(voturi_pentru, procentaj) ' 42572654 voturi PENTRU 49.67%'

source: Notice how the ``yes_votes`` are padded with spaces and a negative sign only for negative numbers. The example also prints ``percentage`` multiplied by 100, with 2 decimal places and followed by a percent sign (see :ref:`formatspec` for details).
ro: Să remarcăm că valoarea lui ``voturi_pentru`` este precedată de un spațiu gol la numerele pozitive și de un semn minus la cele negative. În același timp, codul din exemplu va afișa valoarea lui ``procentaj`` înmulțită cu 100 și urmată de două zecimale, respectiv de semnul procent (a se vedea :ref:`formatspec` pentru detalii).

source: Finally, you can do all the string handling yourself by using string slicing and concatenation operations to create any layout you can imagine. The string type has some methods that perform useful operations for padding strings to a given column width.
ro: În sfârșit, puteți să vă ocupați chiar dumneavoastră de întreaga manipulare a șirurilor de caractere folosind operațiile de tranșare și de concatenare a șirurilor pentru a crea orice machetă (de la englezescul *layout*) de afișare vă doriți. Tipul de date șir de caractere posedă diverse metode de spațiere a șirurilor la lățimi de caracter date.

source: When you don't need fancy output but just want a quick display of some variables for debugging purposes, you can convert any value to a string with the :func:`repr` or :func:`str` functions.
ro: Atunci când nu vă interesează nicio ieșire sofisticată ci, pur și simplu, vreți să afișați rapid valorile câtorva variabile în scopul depanării programului la care lucrați, ați putea converti orice valoare obținută într-un șir de caractere cu ajutorul funcțiilor :func:`repr` și :func:`str`.

source: The :func:`str` function is meant to return representations of values which are fairly human-readable, while :func:`repr` is meant to generate representations which can be read by the interpreter (or will force a :exc:`SyntaxError` if there is no equivalent syntax). For objects which don't have a particular representation for human consumption, :func:`str` will return the same value as :func:`repr`. Many values, such as numbers or structures like lists and dictionaries, have the same representation using either function. Strings, in particular, have two distinct representations.
ro: Funcția :func:`str` a fost gândită să returneze reprezentări de valori care să fie ușor de citit de către utilizatorii umani, pe când funcția :func:`repr` a primit rolul de a genera reprezentări de date care să fie citite de către interpretorul de Python (sau să ridice o excepție :exc:`SyntaxError` atunci când reprezentările nu se potrivesc niciunui șablon sintactic). În cazul obiectelor care nu posedă nicio reprezentare distinctivă de oferit unui consumator uman, :func:`str` va întoarce aceeași valoare ca și :func:`repr`. Multe valori, cum ar fi numerele ori structurile de date de tipul listelor și al dicționarelor, primesc aceeași reprezentare de la amândouă funcțiile. Șirurile de caractere, pe de altă parte, posedă două reprezentări diferite.

source: Some examples::
ro: Câteva exemple::

source: >>> s = 'Hello, world.' >>> str(s) 'Hello, world.' >>> repr(s) "'Hello, world.'" >>> str(1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'The value of x is ' + repr(x) + ', and y is ' + repr(y) + '...' >>> print(s) The value of x is 32.5, and y is 40000... >>> # The repr() of a string adds string quotes and backslashes: >>> hello = 'hello, world\n' >>> hellos = repr(hello) >>> print(hellos) 'hello, world\n' >>> # The argument to repr() may be any Python object: >>> repr((x, y, ('spam', 'eggs'))) "(32.5, 40000, ('spam', 'eggs'))"
ro: >>> s = 'Salutare, lume.' >>> str(s) 'Salutare, lume.' >>> repr(s) "'Salutare, lume.'" >>> str(1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'Valoarea lui x este ' + repr(x) + ', iar a lui y este ' + repr(y) + '...' >>> print(s) Valoarea lui x is 32.5, iar a lui y este 40000... >>> # Aplicarea lui repr() unui șir îi adaugă acestuia ghilimele simple >>> # și linii oblice inverse: >>> salut = 'salutare, lume\n' >>> salutări = repr(salut) >>> print(salutări) 'salutare, lume\n' >>> # Argumentul lui repr() poate fi orice obiect Python: >>> repr((x, y, ('carne presată', 'ouă'))) "(32.5, 40000, ('carne presată', 'ouă'))"

source: The :mod:`string` module contains a :class:`~string.Template` class that offers yet another way to substitute values into strings, using placeholders like ``$x`` and replacing them with values from a dictionary, but offers much less control of the formatting.
ro: Modulul :mod:`string` conține o clasă :class:`~string.Template` care oferă încă o metodă de substituire a valorilor în șirurile de caractere, pe baza unor substitute de forma ``$x`` ce vor fi înlocuite cu valori preluate dintr-un dicționar, însă care furnizează mult mai puțin control asupra formatării.

source: Formatted String Literals
ro: Șiruri de caractere literale formatate

source: :ref:`Formatted string literals <f-strings>` (also called f-strings for short) let you include the value of Python expressions inside a string by prefixing the string with ``f`` or ``F`` and writing expressions as ``{expression}``.
ro: :ref:`Șirurile de caractere literale formatate <f-strings>` (supranumite, pe scurt, *f-șiruri*) ne permit să introducem valoarea unei expresii Python în interiorul unui șir de caractere prefixând șirul cu ``f`` sau ``F`` și scriind expresia în cauză drept ``{expresia}``.

source: An optional format specifier can follow the expression. This allows greater control over how the value is formatted. The following example rounds pi to three places after the decimal::
ro: Un specificator de format opțional îi poate urma expresiei. Prezența lui oferă un control sporit asupra modulului în care valoarea expresiei este formatată. Exemplul dat în continuare prezintă rotunjirea lui pi la trei cifre după virgulă (punct)::

source: >>> import math >>> print(f'The value of pi is approximately {math.pi:.3f}.') The value of pi is approximately 3.142.
ro: >>> import math >>> print(f'Valoarea lui pi este de aproximativ {math.pi:.3f}.') Valoarea lui pi este de aproximativ 3.142.

source: Passing an integer after the ``':'`` will cause that field to be a minimum number of characters wide. This is useful for making columns line up. ::
ro: Inserarea unui număr întreg imediat după semnul ``':'`` va avea ca efect printarea unui câmp lat de minim tot atâta caractere cât este valoarea inserată. O atare proprietate se dovedește utilă la alinierea coloanelor într-o afișare. ::

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678} >>> for name, phone in table.items(): ... print(f'{name:10} ==> {phone:10d}') ... Sjoerd ==> 4127 Jack ==> 4098 Dcab ==> 7678
ro: >>> tabel = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678} >>> for nume, telefon in tabel.items(): ... print(f'{nume:10} ==> {telefon:10d}') ... Sjoerd ==> 4127 Jack ==> 4098 Dcab ==> 7678

source: Other modifiers can be used to convert the value before it is formatted. ``'!a'`` applies :func:`ascii`, ``'!s'`` applies :func:`str`, and ``'!r'`` applies :func:`repr`::
ro: Alți modificatori pot fi întrebuințați la conversia unei valori înainte de formatare. Astfel, ``'!a'`` îi aplică valorii funcția :func:`ascii`, ``'!s'`` o aplică pe :func:`str` iar ``'!r'`` pe :func:`repr`::

source: >>> animals = 'eels' >>> print(f'My hovercraft is full of {animals}.') My hovercraft is full of eels. >>> print(f'My hovercraft is full of {animals!r}.') My hovercraft is full of 'eels'.
ro: >>> animale = 'țipari' >>> print(f'Barca mea pe pernă de aer e plină de {animale}.') Barca mea pe pernă de aer e plină de țipari. >>> print(f'Barca mea pe pernă de aer e plină de {animale!r}.') Barca mea pe pernă de aer e plină de 'țipari'.

source: The ``=`` specifier can be used to expand an expression to the text of the expression, an equal sign, then the representation of the evaluated expression::
ro: Specificatorul ``=`` poate fi utilizat la extinderea unei expresii sub formă de text al expresiei, urmat de semnul egal și de reprezentarea evaluării expresiei respective::

source: >>> bugs = 'roaches' >>> count = 13 >>> area = 'living room' >>> print(f'Debugging {bugs=} {count=} {area=}') Debugging bugs='roaches' count=13 area='living room'
ro: >>> dăunători = 'gândăcei' >>> număr = 13 >>> zonă = 'supragerie' >>> print(f'Deratizare {dăunători=} {număr=} {zonă=}') Deratizare dăunători='gândăcei' număr=13 zonă='sufragerie'

source: See :ref:`self-documenting expressions <bpo-36817-whatsnew>` for more information on the ``=`` specifier. For a reference on these format specifications, see the reference guide for the :ref:`formatspec`.
ro: A se vedea :ref:`expresii auto-documentate <bpo-36817-whatsnew>` pentru mai multe informații privind specificatorul ``=``. Pentru o descriere cuprinzătoare a tuturor acestor specificații de format, consultați ghidul de referință despre :ref:`formatspec`.

source: The String format() Method
ro: Metoda format() a tipului șir de caractere

source: Basic usage of the :meth:`str.format` method looks like this::
ro: Utilizarea de bază a metodei :meth:`str.format` se face astfel -- apelând, ca de obicei, la o `scenetă <https://en.wikipedia.org/wiki/Knights_Who_Say_%22Ni!%22>`_ Monty Python::

source: >>> print('We are the {} who say "{}!"'.format('knights', 'Ni')) We are the knights who say "Ni!"
ro: >>> print('Noi suntem {} care strigă "{}!"'.format('bravii', 'Bau')) Noi suntem bravii care strigă "Bau!"

source: The brackets and characters within them (called format fields) are replaced with the objects passed into the :meth:`str.format` method. A number in the brackets can be used to refer to the position of the object passed into the :meth:`str.format` method. ::
ro: Acoladele și caracterele încadrate de ele (care se numesc *câmpuri de format*) vor fi înlocuite de obiectele transmise metodei :meth:`str.format`. Un număr trecut între acolade poate fi utilizat ca referire la poziția obiectului ce trebuie transmis metodei :meth:`str.format`. ::

source: >>> print('{0} and {1}'.format('spam', 'eggs')) spam and eggs >>> print('{1} and {0}'.format('spam', 'eggs')) eggs and spam
ro: >>> print('{0} și {1}'.format('șuncă presată', 'ouă')) șuncă presată și ouă >>> print('{1} și {0}'.format('șuncă presată', 'ouă')) ouă și șuncă presată

source: If keyword arguments are used in the :meth:`str.format` method, their values are referred to by using the name of the argument. ::
ro: Dacă vom întrebuința argumente cuvânt-cheie la apelul metodei :meth:`str.format`, atunci ne vom referi la valorile acestora prin intermediul numelor argumentelor respective. ::

source: >>> print('This {food} is {adjective}.'.format( ... food='spam', adjective='absolutely horrible')) This spam is absolutely horrible.
ro: >>> print('Această {aliment} este {nume_predicativ}.'.format( ... aliment='șuncă presată', nume_predicativ='absolut îngrozitoare')) Această șuncă presată este absolut îngrozitoare.

source: Positional and keyword arguments can be arbitrarily combined::
ro: Argumentele poziționale și cele cuvânt-cheie pot fi combinate în mod arbitrar::

source: >>> print('The story of {0}, {1}, and {other}.'.format('Bill', 'Manfred', ... other='Georg')) The story of Bill, Manfred, and Georg.
ro: >>> print('Povestea lui {0}, {1} și {altul}.'.format('Bill', 'Manfred', ... altul='Georg')) Povestea lui Bill, Manfred și Georg.

source: If you have a really long format string that you don't want to split up, it would be nice if you could reference the variables to be formatted by name instead of by position. This can be done by simply passing the dict and using square brackets ``'[]'`` to access the keys. ::
ro: În caz că aveți de manevrat un șir de format realmente lung și țineți neapărat să nu-l partiționați, ar fi util dacă v-ați putea referi la variabilele care trebuie formatate nu cu numărul -- indicele poziției -- ci cu numele. O atare rezolvare se obține transmițând, pur și simplu, un dicționar de date și folosind parantezele pătrate ``'[]'`` pentru a-i accesa cheile. ::

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {0[Jack]:d}; Sjoerd: {0[Sjoerd]:d}; ' ... 'Dcab: {0[Dcab]:d}'.format(table)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678
ro: >>> tabel = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {0[Jack]:d}; Sjoerd: {0[Sjoerd]:d}; ' ... 'Dcab: {0[Dcab]:d}'.format(tabel)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678

source: This could also be done by passing the ``table`` dictionary as keyword arguments with the ``**`` notation. ::
ro: Același rezultat poate fi obținut transmițând dicționarul de date ``tabel`` ca pe un argument cuvânt-cheie dat în notația ``**``. ::

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {Jack:d}; Sjoerd: {Sjoerd:d}; Dcab: {Dcab:d}'.format(**table)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678
ro: >>> tabel = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {Jack:d}; Sjoerd: {Sjoerd:d}; Dcab: {Dcab:d}'.format(**tabel)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678

source: This is particularly useful in combination with the built-in function :func:`vars`, which returns a dictionary containing all local variables::
ro: Procedeul este extrem de folositor în combinație cu funcția predefinită :func:`vars`, care returnează un dicționar de date cu toate variabilele locale::

source: >>> table = {k: str(v) for k, v in vars().items()} >>> message = " ".join([f'{k}: ' + '{' + k +'};' for k in table.keys()]) >>> print(message.format(**table)) __name__: __main__; __doc__: None; __package__: None; __loader__: ...
ro: >>> tabel = {k: str(v) for k, v in vars().items()} >>> mesaj = " ".join([f'{k}: ' + '{' + k +'};' for k in tabel.keys()]) >>> print(mesaj.format(**tabel)) __name__: __main__; __doc__: None; __package__: None; __loader__: ...

source: As an example, the following lines produce a tidily aligned set of columns giving integers and their squares and cubes::
ro: Ca exemplu, liniile de cod următoare produc un set de coloane aliniate compact care afișează numere întregi împreună cu pătratele și cuburile lor::

source: For a complete overview of string formatting with :meth:`str.format`, see :ref:`formatstrings`.
ro: Pentru o dare de seamă elaborată asupra formatării șirurilor de caractere folosind :meth:`str.format`, a se vedea :ref:`formatstrings`.

source: Manual String Formatting
ro: Formatare manuală a șirurilor de caractere

source: Here's the same table of squares and cubes, formatted manually::
ro: Iată același tabel de pătrate și cuburi de numere întregi, însă formatat manual::

source: >>> for x in range(1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Note use of 'end' on previous line ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000
ro: >>> for x in range(1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Remarcați folosirea lui 'end' pe linia anterioară ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000

source: (Note that the one space between each column was added by the way :func:`print` works: it always adds spaces between its arguments.)
ro: (Luați în considerare faptul că un spațiu gol, între două coloane consecutive, i se datorează modului de funcționare al funcției :func:`print`: aceasta adaugă întotdeauna spații goale între argumentele sale.)

source: The :meth:`str.rjust` method of string objects right-justifies a string in a field of a given width by padding it with spaces on the left. There are similar methods :meth:`str.ljust` and :meth:`str.center`. These methods do not write anything, they just return a new string. If the input string is too long, they don't truncate it, but return it unchanged; this will mess up your column lay-out but that's usually better than the alternative, which would be lying about a value. (If you really want truncation you can always add a slice operation, as in ``x.ljust(n)[:n]``.)
ro: Metoda :meth:`str.rjust` a obiectelor șir de caractere aliniază *la dreapta* un șir într-un câmp de lățime dată inserând spații goale în stânga șirului. Python-ul dispune de încă două metode similare, și anume :meth:`str.ljust`, respectiv :meth:`str.center`. Ele nu inserează nimic (în vechiul șir), doar întorc un șir nou. Dacă șirul ce trebuie manipulat este prea lung, aceste metode nu-l vor trunchia, ci îl vor returna nemodificat; deși un asemenea comportament vă va afecta dpdv. estetic macheta coloanelor, alternativa ar fi mult mai rea, ea presupunând modificări de valori. (Dacă doriți, cu adevărat, o trunchiere a șirului manipulat, atunci puteți apela la operațiile de tranșare, cum ar fi ``x.ljust(n)[:n]``.)

source: There is another method, :meth:`str.zfill`, which pads a numeric string on the left with zeros. It understands about plus and minus signs::
ro: Mai există o metodă, :meth:`str.zfill`, care completează *la stânga*, cu zerouri, șirurile de numere. Are capacitatea de a distinge cifrele de semnele plus și minus::

source: Old string formatting
ro: Vechiul stil de formatare al șirurilor de caractere

source: The % operator (modulo) can also be used for string formatting. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. This operation is commonly known as string interpolation. For example::
ro: Operatorul % (modulo) poate fi întrebuințat și la formatarea șirurilor de caractere. Fiind dată expresia ``formatul % valorile`` (unde *formatul* desemnează un șir de caractere), specificațiile conversiei ``%`` care sunt scrise în *formatul* vor fi înlocuite cu zero sau mai multe elemente din *valorile*. Această operație este cunoscută sub numele de *interpolarea șirurilor* (de caractere). De exemplu::

source: >>> import math >>> print('The value of pi is approximately %5.3f.' % math.pi) The value of pi is approximately 3.142.
ro: >>> import math >>> print('Valoarea lui pi este aproximativ %5.3f.' % math.pi) Valoarea lui pi este aproximativ 3.142.

source: More information can be found in the :ref:`old-string-formatting` section.
ro: Mai multe informații se găsesc în secțiunea :ref:`old-string-formatting`.

source: Reading and Writing Files
ro: Citirea și scrierea fișierelor

source: :func:`open` returns a :term:`file object`, and is most commonly used with two positional arguments and one keyword argument: ``open(filename, mode, encoding=None)``
ro: :func:`open` returnează un :term:`file object` și este utilizată de obicei cu două argumente poziționale și un argument cuvânt-cheie: ``open(nume_de_fișier, mod_de_deschidere, encoding=None)``

source: >>> f = open('workfile', 'w', encoding="utf-8")
ro: >>> f = open('fișier_șantier', 'w', encoding="utf-8")
