Repository: octaG-M/python-docs-ro
Catalog: tutorial/inputoutput.po
Languages: ro

source: The first argument is a string containing the filename. The second argument is another string containing a few characters describing the way in which the file will be used. *mode* can be ``'r'`` when the file will only be read, ``'w'`` for only writing (an existing file with the same name will be erased), and ``'a'`` opens the file for appending; any data written to the file is automatically added to the end. ``'r+'`` opens the file for both reading and writing. The *mode* argument is optional; ``'r'`` will be assumed if it's omitted.
ro: Primul argument este un șir de caractere desemnând numele fișierului pe care dorim să-l deschidem. Cel de-al doilea argument este tot un șir de caractere, foarte scurt, ce descrie felul în care vom folosi fișierul. *mod_de_deschidere* va fi ``'r'`` dacă dorim doar să citim fișierul, ``'w'`` dacă ne interesează numai să scriem în el (în caz că există fișierul omonim, acesta va fi șters), respectiv ``'a'`` pentru adăugare la sfârșitul fișierului. ``'r+'`` va deschide fișierul atât pentru citit cât și pentru scris. Argumentul *mod_de_deschidere* este opțional; dacă nu-l precizăm, atunci el va fi considerat ``'r'``.

source: Normally, files are opened in :dfn:`text mode`, that means, you read and write strings from and to the file, which are encoded in a specific *encoding*. If *encoding* is not specified, the default is platform dependent (see :func:`open`). Because UTF-8 is the modern de-facto standard, ``encoding="utf-8"`` is recommended unless you know that you need to use a different encoding. Appending a ``'b'`` to the mode opens the file in :dfn:`binary mode`. Binary mode data is read and written as :class:`bytes` objects. You can not specify *encoding* when opening file in binary mode.
ro: De obicei, fișierele se deschid în :dfn:`modul text`, ceea ce înseamnă că puteți citi șiruri de caractere din ele, respectiv scrie șiruri de caractere în ele, șiruri care sunt codificate (de la englezescul *encoding*) conform unei *codificări* anumite. Atunci când *codificarea* nu este precizată, codificarea implicită va depinde de platforma de calcul (vedeți :func:`open`). Dat fiind că UTF-8 constituie, în zilele noastre, standardul *de facto* în domeniu, este recomandat să folosiți ``encoding="utf-8"`` dacă nu aveți, realmente, nevoie de vreo codificare specială. Adăugând sufixul ``'b'`` la modul de deschidere, fișierul în cauză va fi deschis în :dfn:`modul binar`. Datele accesate în modul binar sunt citite și scrise sub formă de obiecte :class:`bytes`. Nu vi se permite să specificați care este *codificarea* dacă deschideți fișierul în modul binar.

source: In text mode, the default when reading is to convert platform-specific line endings (``\n`` on Unix, ``\r\n`` on Windows) to just ``\n``. When writing in text mode, the default is to convert occurrences of ``\n`` back to platform-specific line endings. This behind-the-scenes modification to file data is fine for text files, but will corrupt binary data like that in :file:`JPEG` or :file:`EXE` files. Be very careful to use binary mode when reading and writing such files.
ro: Atunci când manevrăm fișierul în modul text, la citire din el, caracterele care marchează sfârșitul de rând se vor transforma implicit din caractere sfârșit de rând *specifice* platformei de calcul (adică, din ``\n`` în Unix, respectiv din ``\r\n`` în Windows) în caracterul ``\n``. Invers, la scrierea în fișier, toate aparițiile lui ``\n`` vor deveni implicit caracterele de sfârșit de rând specifice platformei pe care lucrăm. Deși o astfel de modificare *sub capotă* (de la englezescul *behind-the-scenes*) este convenabilă atunci când avem de a face cu fișiere text, ea va corupe datele binare precum cele dintr-un fișier :file:`JPEG` ori :file:`EXE`. Aveți mare grijă să folosiți modul binar atunci când fie citiți din asemenea fișiere fie scrieți în ele.

source: It is good practice to use the :keyword:`with` keyword when dealing with file objects. The advantage is that the file is properly closed after its suite finishes, even if an exception is raised at some point. Using :keyword:`!with` is also much shorter than writing equivalent :keyword:`try`\ -\ :keyword:`finally` blocks::
ro: O bună practică ne este la îndemână prin intermediul cuvântului-cheie :keyword:`with`, de întrebuințat dacă manevrăm obiecte fișier. Avantajul său constă în aceea că fișierul va fi întotdeauna închis corect la finalul execuției expresiei acestui construct, și aceasta chiar dacă a fost ridicată vreo excepție pe parcurs. În plus, folosirea lui :keyword:`!with` scurtează semnificativ codul care ar trebui scris dacă folosim constructul echivalent dat de blocurile :keyword:`try`\ -\ :keyword:`finally`::

source: >>> with open('workfile', encoding="utf-8") as f: ... read_data = f.read() >>> # We can check that the file has been automatically closed. >>> f.closed True
ro: >>> with open('fișier_șantier', encoding="utf-8") as f: ... citește_datele = f.read() >>> # Putem verifica dacă fișierul a fost închis automat. >>> f.closed True

source: If you're not using the :keyword:`with` keyword, then you should call ``f.close()`` to close the file and immediately free up any system resources used by it.
ro: În caz că nu utilizați cuvântul cheie :keyword:`with`, atunci va trebui să apelați metoda ``f.close()`` pentru a închide fișierul și a elibera de îndată eventualele resurse ale sistemului pe care manevrarea fișierului le-a blocat.

source: Calling ``f.write()`` without using the :keyword:`!with` keyword or calling ``f.close()`` **might** result in the arguments of ``f.write()`` not being completely written to the disk, even if the program exits successfully.
ro: Apelul lui ``f.write()`` fie fără să folosim cuvântul cheie :keyword:`!with` fie fără să-l însoțim de apelul lui ``f.close()`` *poate* avea drept consecință o scriere incompletă a argumentelor lui ``f.write()`` pe disc, și aceasta chiar dacă programul se va încheia corect.

source: After a file object is closed, either by a :keyword:`with` statement or by calling ``f.close()``, attempts to use the file object will automatically fail. ::
ro: După ce un obiect fișier a fost închis, fie printr-o instrucție :keyword:`with` fie prin apelul metodei ``f.close()``, orice încercare de a-l întrebuința va fi sortită eșecului. ::

source: Methods of File Objects
ro: Metodele obiectelor fișier

source: The rest of the examples in this section will assume that a file object called ``f`` has already been created.
ro: Restul exemplelor din această secțiune presupune că un obiect fișier pe nume ``f`` a fost deja creat.

source: To read a file's contents, call ``f.read(size)``, which reads some quantity of data and returns it as a string (in text mode) or bytes object (in binary mode). *size* is an optional numeric argument. When *size* is omitted or negative, the entire contents of the file will be read and returned; it's your problem if the file is twice as large as your machine's memory. Otherwise, at most *size* characters (in text mode) or *size* bytes (in binary mode) are read and returned. If the end of the file has been reached, ``f.read()`` will return an empty string (``''``). ::
ro: Ca să citiți conținutul unui fișier, apelați ``f.read(cantitate)``, instrucțiune care citește o anumită cantitate de date și o returnează sub formă de șir de caractere (în modul text) sau sub forma unui obiect *bytes* (în modul binar). *cantitate* este un argument numeric opțional. Atunci când *cantitate* fie este omis fie este număr negativ, întregul conținut al fișierului va fi citit și apoi returnat; treaba dumneavoastră dacă fișierul în cauză se dovedește a fi de două ori mai mare ca memoria mașinii de calcul. Altfel, cel mult un număr de *cantitate* de caractere (în modul text) vor fi citite și returnate, respectiv un număr de *cantitate* de biți (în modul binar) vor fi citiți și returnați. Atunci când se va ajunge la finalul fișierului, ``f.read()`` va întoarce un șir gol (``''``). ::

source: >>> f.read() 'This is the entire file.\n' >>> f.read() ''
ro: >>> f.read() 'Acesta este întregul fișier.\n' >>> f.read() ''

source: ``f.readline()`` reads a single line from the file; a newline character (``\n``) is left at the end of the string, and is only omitted on the last line of the file if the file doesn't end in a newline. This makes the return value unambiguous; if ``f.readline()`` returns an empty string, the end of the file has been reached, while a blank line is represented by ``'\n'``, a string containing only a single newline. ::
ro: ``f.readline()`` citește un singur rând din fișier; caracterul linie-nouă (``\n``) este păstrat la sfârșitul șirului de caractere citit, el fiind omis numai la ultimul rând al fișierului, atunci când fișierul nu se încheie cu o *linie nouă* (în englezește, ca jargon, *newline*). Procedeul în cauză face ca valoarea returnată să fie lipsită de ambiguitate; căci, dacă ``f.readline()`` returnează un șir gol înseamnă că am ajuns la finalul fișierului, în timp ce o linie goală (dintre paragrafe) va fi reprezentată de un ``'\n'``, adică de un șir conținând numai un singur caracter, cel de linie nouă. ::

source: >>> f.readline() 'This is the first line of the file.\n' >>> f.readline() 'Second line of the file\n' >>> f.readline() ''
ro: >>> f.readline() 'Acesta este primul rând al fișierului.\n' >>> f.readline() 'Al doilea rând al fișierului\n' >>> f.readline() ''

source: For reading lines from a file, you can loop over the file object. This is memory efficient, fast, and leads to simple code::
ro: Pentru a citi mai multe linii din fișier, puteți itera de-a lungul obiectului fișier. O atare procedură este eficientă dpdv. al consumului de memorie, este rapidă și se bazează pe un cod Python simplu::

source: >>> for line in f: ... print(line, end='') ... This is the first line of the file. Second line of the file
ro: >>> for rând in f: ... print(rând, end='') ... Acesta este primul rând al fișierului. Al doilea rând al fișierului

source: If you want to read all the lines of a file in a list you can also use ``list(f)`` or ``f.readlines()``.
ro: Dacă vă interesează să plasați toate rândurile unui fișier într-o listă, atunci ați putea folosi ``list(f)`` sau ``f.readlines()``.

source: ``f.write(string)`` writes the contents of *string* to the file, returning the number of characters written. ::
ro: ``f.write(șir_de_caractere)`` scrie conținutul lui *șir_de_caractere* în fișier, returnând numărul de caractere scrise. ::

source: >>> f.write('This is a test\n') 15
ro: >>> f.write('Acesta e un test\n') 17

source: Other types of objects need to be converted -- either to a string (in text mode) or a bytes object (in binary mode) -- before writing them::
ro: Obiectele de alt tip trebuie convertite mai întâi -- fie la șiruri de caractere (în modul text) fie la obiecte *bytes* (în modul binar) -- înainte de scrierea în fișier::

source: >>> value = ('the answer', 42) >>> s = str(value) # convert the tuple to string >>> f.write(s) 18
ro: >>> valoarea = ('răspunsul', 42) >>> s = str(valoarea) # convertește tuplul în șir de caractere >>> f.write(s) 17

source: ``f.tell()`` returns an integer giving the file object's current position in the file represented as number of bytes from the beginning of the file when in binary mode and an opaque number when in text mode.
ro: ``f.tell()`` returnează un număr întreg care fie indică poziția curentă în obiectul fișier precizând la câți octeți ne găsim față de începutul fișierului, atunci când fișierul a fost deschis în modul binar, fie este o valoare *opacă*, atunci când fișierul a fost deschis în modul text.

source: To change the file object's position, use ``f.seek(offset, whence)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *whence* argument. A *whence* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *whence* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
ro: Pentru a schimba poziția (cursorului) în obiectul fișier, întrebuințați metoda ``f.seek(deplasament, sursă)``. Poziția se calculează adunând acest *deplasament* la punctul de referință; punctul de referință este precizat prin argumentul *sursă*. Valoarea 0 a lui *sursă* înseamnă că ne vom raporta la începutul fișierului, valoarea 1 se referă la poziția curentă în fișier, iar valoarea 2 implică folosirea finalului de fișier pe post de punct de referință. ::

source: >>> f = open('workfile', 'rb+') >>> f.write(b'0123456789abcdef') 16 >>> f.seek(5) # Go to the 6th byte in the file 5 >>> f.read(1) b'5' >>> f.seek(-3, 2) # Go to the 3rd byte before the end 13 >>> f.read(1) b'd'
ro: >>> f = open('fișier_șantier', 'rb+') >>> f.write(b'0123456789abcdef') 16 >>> f.seek(5) # Mergi la cel de-al 6-lea octet din fișier 5 >>> f.read(1) b'5' >>> # Mergi la octetul situat cu 3 poziții (octeți) >>> # înaintea finalului >>> f.seek(-3, 2) 13 >>> f.read(1) b'd'

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
ro: În fișierele text (adică, fișierele deschise fără să se utilizeze niciun ``b`` în șirul de caractere al modului de deschidere) sunt permise doar poziționările raportate la începutul fișierului (singura excepție fiind cea dată de poziționarea, folosind ``seek(0, 2)``, chiar la finalul fișierului), iar valorile corecte pentru *deplasament* sunt numerele returnate de ``f.tell()``, respectiv zero. Orice alt *deplasament* va cauza comportamente impredictibile.

source: File objects have some additional methods, such as :meth:`~io.IOBase.isatty` and :meth:`~io.IOBase.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
ro: Fișierele obiect posedă diverse alte metode, precum :meth:`~io.IOBase.isatty` și :meth:`~io.IOBase.truncate` care sunt mai rar întâlnite; consultați Referința bibliotecii pentru ghidul cuprinzător al obiectelor fișier.

source: Saving structured data with :mod:`json`
ro: Salvarea structurilor de date cu :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`~io.TextIOBase.read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
ro: Șirurile de caractere se scriu ușor într-un fișier și se citesc (la fel de) ușor dintr-un fișier. Numerele presupun un efort suplimentar, dat fiind că metoda :meth:`~io.TextIOBase.read` returnează doar șiruri de caractere, iar acestea din urmă trebuie transmise unei funcții precum :func:`int`, care funcție preia un șir ca ``'123'`` și întoarce valoarea sa numerică, adică pe 123. Atunci când vă interesează să salvați date de diverse tipuri mai sofisticate decât șirurile ori numerele, cum ar fi listele imbricate ori dicționarele de date, *parsarea* manuală și *serializarea* de mână devin niște sarcini complicate.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <https://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
ro: Ca să nu-i silească pe utilizatori să-și consume timpul scriind și corectând cod specializat în salvarea în fișiere a tipurilor complicate de date, Python-ul le permite acestora să întrebuințeze popularul format de (inter)schimb de date numit `JSON (Notația obiectelor JavaScript) <https://json.org>`_. Modulul predefinit :mod:`json` preia date Python ierarhizate și le convertește în reprezentări sub formă de șiruri de caractere; un atare proces este numit :dfn:`serializare`. Invers, reconstrucția datelor din reprezentările lor ca șiruri de caractere poartă numele de :dfn:`deserializare`. Între o serializare și deserializarea subsecventă, șirul de caractere care reprezintă un obiect Python poate fi stocat într-un fișier sau într-un flux de date, ori transmis printr-o conexiune la rețeaua Internet către o mașină de calcul aflată la distanță.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
ro: Formatul JSON este utilizat frecvent de aplicațiile moderne care permit schimburi de date. Mulți programatori sunt deja familiarizați cu el, ceea ce îl face o alegere potrivită atunci când ne interesează interoperabilitatea.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
ro: Dacă aveți la îndemână un obiect Python ``x``, atunci vă ajunge o singură linie de cod ca să-i vedeți reprezentarea JSON sub formă de șir de caractere::

source: >>> import json >>> x = [1, 'simple', 'list'] >>> json.dumps(x) '[1, "simple", "list"]'
ro: >>> import json >>> x = [1, 'banală', 'listă'] >>> json.dumps(x) '[1, "banală", "listă"]'

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
ro: O variantă a funcției :func:`~json.dumps`, intitulată :func:`~json.dump`, serializează de-a dreptul obiectul Python într-un :term:`text file`. Așadar, dacă ``f`` este un obiect :term:`text file` deschis pentru scriere, putem proceda astfel::

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
ro: Ca redecodificăm obiectul, presupunând că ``f`` este fie un obiect :term:`binary file` fie un obiect :term:`text file` care a fost deja deschis pentru citire, executăm::

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
ro: Fișierele JSON trebuie să fie codificate UTF-8. Folosiți ``encoding="utf-8"`` atunci când deschideți un fișier JSON ca :term:`text file` atât pentru citire cât și pentru scriere.

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
ro: O asemenea tehnică simpl(ist)ă de serializare se descurcă la manevrarea listelor și a dicționarelor de date, însă serializarea în JSON a unor instanțe de clase oarecare necesită un anume efort. Referința la modulul :mod:`json` din documentație explică de ce.

source: :mod:`pickle` - the pickle module
ro: :mod:`pickle` - modulul pickle

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
ro: Spre deosebire de :ref:`JSON <tut-json>`, *pickle* (adică, *muratul* sau *punerea la murat*) desemnează un protocol capabil să serializeze obiecte Python oricât de complicate. Din care motiv, îi este tipic (doar) Python-ului și nu poate fi utilizat la comunicarea cu aplicații scrise în alte limbaje de programare. De asemeni, este *nesigur* în mod prestabilit: deserializarea unor date puse la murat pe care le-ați obținut de la o sursă dubioasă poate provoca execuții de cod despre care (să) nu știți nimic, în caz că datele au fost preparate de un atacator îndemânatic.

source: formatted string literal
ro: dată literală formatată de tipul șir de caractere

source: interpolated string literal
ro: dată literală interpolată de tipul șir de caractere

source: string
ro: șir de caractere

source: formatted literal
ro: dată literală formatată

source: interpolated literal
ro: dată literală interpolată

source: f-string
ro: f-șir

source: fstring
ro: fșir

source: built-in function
ro: funcție predefinită

source: open
ro: deschide

source: object
ro: obiect

source: file
ro: fișier

source: module
ro: modul
