Repository: octaG-M/python-docs-ro
Catalog: tutorial/interpreter.po
Languages: ro

source: Using the Python Interpreter
ro: Utilizarea interpretorului de Python

source: Invoking the Interpreter
ro: Invocarea interpretorului

source: The Python interpreter is usually installed as |usr_local_bin_python_x_dot_y_literal| on those machines where it is available; putting :file:`/usr/local/bin` in your Unix shell's search path makes it possible to start it by typing the command:
ro: Interpretorul de Python este instalat, de obicei, ca |usr_local_bin_python_x_dot_y_literal| în mașinile de calcul pe care este disponibil; dacă adăugați :file:`/usr/local/bin` la calea de căutare a interpretorului dumneavoastră de comenzi Unix, atunci veți putea să-l porniți tastând comanda:

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
ro: în terminal. [#]_ Deoarece alegerea directorului în care se găsește interpretorul este o opțiune de instalare, există și alte locuri posibile; întrebați-l de ele fie pe gurul de Python din partea locului fie pe administratorul de sistem. (De exemplu, :file:`/usr/local/python` este o locație alternativă populară.)

source: On Windows machines where you have installed Python from the :ref:`Microsoft Store <windows-store>`, the |python_x_dot_y_literal| command will be available. If you have the :ref:`py.exe launcher <launcher>` installed, you can use the :file:`py` command. See :ref:`setting-envvars` for other ways to launch Python.
ro: Pe mașinile Windows pe care ați instalat Python-ul luat din :ref:`Microsoft Store <windows-store>` este disponibilă comanda |python_x_dot_y_literal|. Dacă ați instalat :ref:`lansatorul py.exe <launcher>`, atunci puteți folosi comanda :file:`py`. Vedeți :ref:`setting-envvars` pentru alte modalități de a lansa în execuție Python-ul.

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
ro: Tastarea caracterului sfârșit-de-fișier (:kbd:`Control-D` în Unix, :kbd:`Control-Z` în Windows) la promptul principal va face ca interpretorul să încheie execuția cu codul de ieșire zero. Dacă această acțiune nu are niciun efect, atunci veți putea ieși din interpretor tastând comanda: ``quit()``.

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support the `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ library. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
ro: Caracteristicile de editare a liniei de comandă ale interpretorului includ editarea interactivă, substituția istoricului și completarea codului pe sistemele care suportă biblioteca `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_. Cea mai rapidă cale de a vedea dacă este permisă editarea liniei de comandă este să tastați :kbd:`Control-P` la primul prompt de Python la care ajungeți. Dacă se aude un bip, atunci dispuneți de editare a liniei de comandă; vedeți Apendicele :ref:`tut-interacting` pentru o prezentare a tastelor. În schimb, dacă fie nu se întâmplă nimic fie ecoul va fi un ``^P``, nu aveți editare în linie de comandă; tot ce puteți face este să folosiți backspace-ul pentru eliminarea de caractere din linia curentă.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
ro: Interpretorul operează cumva asemănător modului în care o face interpretorul de comenzi Unix: atunci când îl apelați dintr-un input standard conectat la un dispozitiv tty, el citește și execută comenzile în mod interactiv; dacă îl apelați având ca argument un nume de fișier sau cu un fișier pe post de input standard, el citește și execută un *script* din respectivul fișier.

source: A second way of starting the interpreter is ``python -c command [arg] ...``, which executes the statement(s) in *command*, analogous to the shell's :option:`-c` option. Since Python statements often contain spaces or other characters that are special to the shell, it is usually advised to quote *command* in its entirety.
ro: Al doilea mod de pornire a interpretorului este ``python -c comanda [arg] ...``, ceea ce va produce execuția instrucțiunilor din *comanda*, la fel ca atunci când folosim opțiunea :option:`-c` a interpretorului de comenzi. Dat fiind că instrucțiunile Python conțin, în mod obișnuit, spații goale ori diverse caractere socotite drept speciale de către interpretorul de comenzi, vă recomandăm să încadrați *comanda* cu ghilimele.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
ro: Unele module Python sunt utile și ca scripturi. Ele pot fi invocate cu ``python -m modulul [arg] ...``, ceea ce va produce execuția fișierului-sursă al modulului *modulul* la fel ca atunci când ați fi scris numele complet al acestuia în linia de comandă.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
ro: Când folosim fișierul unui script, este util, uneori, să putem mai întâi rula scriptul iar apoi reveni la modul interactiv de lucru. Aceasta se poate face inserând :option:`-i` înaintea scriptului.

source: All command line options are described in :ref:`using-on-general`.
ro: Toate opțiunile din linia de comandă sunt descrise în :ref:`using-on-general`.

source: Argument Passing
ro: Transmiterea argumentelor

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
ro: Atunci când îi sunt făcute cunoscute interpretorului, numele unui script și argumentele adiționale de după el sunt transformate într-o listă de șiruri de caractere care îi este atribuită variabilei ``argv`` din modulul ``sys``. Puteți accesa această listă executând ``import sys``. Lungimea listei trebuie să fie cel puțin 1; dacă nu sunt inserate nici scriptul nici argumentele, ``sys.argv[0]`` va fi șirul nul. Dacă numele scriptului este introdus ca ``'-'`` (ceea ce desemnează inputul standard), atunci ``sys.argv[0]`` va fi setat ca ``'-'``. Când se folosește :option:`-c` *comandă*, ``sys.argv[0]`` va fi setat la ``'-c'``. Când se folosește :option:`-m` *modul*, ``sys.argv[0]`` va fi setat la numele complet al locației modulului. Opțiunile ce vor fi găsite după :option:`-c` *comandă* ori :option:`-m` *modul* nu vor fi consumate la procesarea de opțiuni a interpretorului de Python ci vor fi lăsate în ``sys.argv`` pentru a fi manevrate fie de către comandă fie de către modul.

source: Interactive Mode
ro: Modul interactiv

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
ro: Atunci când comenzile se citesc dintr-un dispozitiv tty (`terminal <https://en.wikipedia.org/wiki/Computer_terminal>`_), se spune că interpretorul se găsește în *modul interactiv*. Când este în acest mod, el cere o comandă nouă afișând *promptul principal*, de obicei sub forma unui set de trei caractere mai-mare-ca (``>>>``); pentru a trece pe linia de continuare a unei comenzi, el afișează *promptul secundar*, format de obicei din trei puncte (``...``). Interpretorul printează un mesaj de bun-venit care cuprinde numărul versiunii sale și o informare despre drepturile de autor înainte să afișeze primul prompt:

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
ro: Liniile de continuare sunt necesare atunci când inserăm un construct de mai multe linii. De exemplu, să aruncăm o privire asupra următoarei instrucțiuni :keyword:`if`::

source: >>> the_world_is_flat = True >>> if the_world_is_flat: ... print("Be careful not to fall off!") ... Be careful not to fall off!
ro: >>> pământul_e_plat = True >>> if pământul_e_plat: ... print("Atenție să nu cădeți de pe el!") ... Atenție să nu cădeți de pe el!

source: For more on interactive mode, see :ref:`tut-interac`.
ro: Pentru mai multe despre modul interactiv, vedeți :ref:`tut-interac`.

source: The Interpreter and Its Environment
ro: Interpretorul și mediul său

source: Source Code Encoding
ro: Codificarea codului-sursă

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
ro: În mod obișnuit, fișierele-sursă Python sunt considerate a fi codificate în UTF-8. Sub această codificare, caracterele majorității limbilor lumii pot fi folosite fără nicio restricție atât în constante de tip șir de caractere cât și în identificatori ori în comentarii --- chiar dacă biblioteca standard utilizează numai caractere ASCII pentru identificatori, convenție ce ar trebui îndeplinită de către orice fel de cod portabil. Pentru a afișa corect aceste caractere, editorul dumneavoastră trebuie să recunoască fișierul ca fiind UTF-8 și trebuie să utilizeze un font care suportă toate caracterele din fișier.

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
ro: Pentru declararea unei codificări diferite de cea implicită, o linie specială de comentarii trebuie inserată ca *prima* linie a fișierului. Sintaxa ei este după cum urmează::

source: # -*- coding: encoding -*-
ro: # -*- coding: codificare -*-

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
ro: unde *codificare* este unul dintre :mod:`codecs` valide permise de Python.

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
ro: De exemplu, pentru a declara că urmează să fie folosită codificarea Windows-1252, prima linie din codul-sursă al dumneavoastră trebuie să fie::

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
ro: O excepție de la regula *primei linii* este atunci când codul-sursă începe cu o :ref:`linie "shebang" UNIX <tut-scripts>`. În această situație, declarația codificării trebuie inserată pe cea de-a doua linie a fișierului. De exemplu::

source: Footnotes
ro: Note de subsol

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
ro: În Unix, interpretorul de Python 3.x nu este instalat implicit cu numele de executabil ``python``, astfel că nu se va intra în conflict (de nume) cu niciun executabil de Python 2.x deja instalat.
