Repository: octaG-M/python-docs-ro
Catalog: tutorial/introduction.po
Languages: ro

source: >>> word[0] = 'J' Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'str' object does not support item assignment >>> word[2:] = 'py' Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'str' object does not support item assignment
ro: >>> cuvântul[0] = 'J' Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'str' object does not support item assignment >>> cuvântul[2:] = 'py' Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'str' object does not support item assignment

source: If you need a different string, you should create a new one::
ro: Dacă este nevoie să modificați un șir de caractere, atunci va trebui să creați un șir de caractere nou::

source: >>> 'J' + word[1:] 'Jython' >>> word[:2] + 'py' 'Pypy'
ro: >>> 'J' + cuvântul[1:] 'Jython' >>> cuvântul[:2] + 'py' 'Pypy'

source: The built-in function :func:`len` returns the length of a string::
ro: Funcția predefinită :func:`len` returnează lungimea unui șir de caractere. Șirul de caractere `supercalifragilistic... <https://ro.wikipedia.org/wiki/Supercalifragilisticexpialidocious>`_ este intraductibil::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
ro: Șirurile de caractere sunt exemple ale *tipurilor secvență de date* și permit operațiile suportate în mod obișnuit de asemenea tipuri.

source: Strings support a large number of methods for basic transformations and searching.
ro: Șirurile de caractere suportă un număr mare de metode privind transformările uzuale și căutarea.

source: String literals that have embedded expressions.
ro: Valori literale șir-de-caractere care includ expresii.

source: Information about string formatting with :meth:`str.format`.
ro: Informații despre formatarea șirurilor de caractere cu :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
ro: Vechile operații de formatare invocate atunci când șiruri de caractere îi sunt operand stâng operatorului ``%`` sunt descrise în detaliu aici.

source: Lists
ro: Liste

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
ro: Python-ul înțelege mai multe tipuri de date *compozite*, folosite la punerea laolaltă de valori diverse. Cel mai versatil dintre tipuri este *lista*, pe care o putem scrie în formă de șir încadrat de paranteze drepte și format din valori (itemi) separate între ele prin virgule. Listele pot conține itemi de tipuri diferite, însă cel mai adesea toți itemii sunt de același tip. ::

source: >>> squares = [1, 4, 9, 16, 25] >>> squares [1, 4, 9, 16, 25]
ro: >>> pătrate_perfecte = [1, 4, 9, 16, 25] >>> pătrate_perfecte [1, 4, 9, 16, 25]

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
ro: Aidoma șirurilor de caractere (și a tuturor tipurilor :term:`sequence` predefinite), listele pot fi atât indexate cât și tranșate::

source: >>> squares[0] # indexing returns the item 1 >>> squares[-1] 25 >>> squares[-3:] # slicing returns a new list [9, 16, 25]
ro: >>> pătrate_perfecte[0] # indexarea returnează itemul corespunzător 1 >>> pătrate_perfecte[-1] 25 >>> pătrate_perfecte[-3:] # felierea returnează o listă nouă [9, 16, 25]

source: Lists also support operations like concatenation::
ro: De asemenea, listele suportă operații precum concatenarea::

source: >>> squares + [36, 49, 64, 81, 100] [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]
ro: >>> pătrate_perfecte + [36, 49, 64, 81, 100] [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
ro: Spre deosebire de șirurile de caractere, care sunt :term:`immutable`, listele sunt un tip :term:`mutable`, adică este posibil să le modificăm conținutul::

source: >>> cubes = [1, 8, 27, 65, 125] # something's wrong here >>> 4 ** 3 # the cube of 4 is 64, not 65! 64 >>> cubes[3] = 64 # replace the wrong value >>> cubes [1, 8, 27, 64, 125]
ro: >>> cuburi_perfecte = [1, 8, 27, 65, 125] # ceva nu-i în regulă aici >>> 4 ** 3 # 4 la cub face 64, nu 65! 64 >>> cuburi_perfecte[3] = 64 # înlocuim valoarea greșită >>> cuburi_perfecte [1, 8, 27, 64, 125]

source: You can also add new items at the end of the list, by using the :meth:`!list.append` *method* (we will see more about methods later)::
ro: De asemenea, puteți adăuga itemi noi la sfârșitul listei, folosind *metoda* :meth:`!list.append` (vom discuta mai multe despre metode ulterior)::

source: >>> cubes.append(216) # add the cube of 6 >>> cubes.append(7 ** 3) # and the cube of 7 >>> cubes [1, 8, 27, 64, 125, 216, 343]
ro: >>> cuburi_perfecte.append(216) # adăugăm cubul lui 6 >>> cuburi_perfecte.append(7 ** 3) # și cubul lui 7 >>> cuburi_perfecte [1, 8, 27, 64, 125, 216, 343]

source: Simple assignment in Python never copies data. When you assign a list to a variable, the variable refers to the *existing list*. Any changes you make to the list through one variable will be seen through all other variables that refer to it.::
ro: În Python, simpla atribuire nu copiază niciodată datele. Atunci când asignați o listă unei variabile, variabila se va referi la *lista de față*. Indiferent ce schimbare faceți în listă prin intermediul unei variabile, schimbarea va fi vizibilă prin intermediul tuturor celorlalte variabile care se referă la prima variabilă.::

source: >>> rgb = ["Red", "Green", "Blue"] >>> rgba = rgb >>> id(rgb) == id(rgba) # they reference the same object True >>> rgba.append("Alph") >>> rgb ["Red", "Green", "Blue", "Alph"]
ro: >>> rgb = ["Roșu", "Verde", "Albastru"] >>> rgba = rgb >>> id(rgb) == id(rgba) # se referă la același obiect True >>> rgba.append("Alf") >>> rgb ["Roșu", "Verde", "Albastru", "Alf"]

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a :ref:`shallow copy <shallow_vs_deep_copy>` of the list::
ro: Toate operațiile de feliere vor returna o listă nouă conținând elementele cerute. Ceea ce înseamnă că următoarea tranșare va returna o :ref:`copie superficială <shallow_vs_deep_copy>` (de la englezescul *shallow copy*) a listei::

source: >>> correct_rgba = rgba[:] >>> correct_rgba[-1] = "Alpha" >>> correct_rgba ["Red", "Green", "Blue", "Alpha"] >>> rgba ["Red", "Green", "Blue", "Alph"]
ro: >>> rgba_corect = rgba[:] >>> rgba_corect[-1] = "Alfa" >>> rgba_corect ["Roșu", "Verde", "Albastru", "Alfa"] >>> rgba ["Roșu", "Verde", "Albastru", "Alf"]

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
ro: Asignarea la tranșe este, de asemenea, posibilă iar aceasta poate schimba până și mărimea listei ori șterge toate elementele ei::

source: >>> letters = ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> letters ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> # replace some values >>> letters[2:5] = ['C', 'D', 'E'] >>> letters ['a', 'b', 'C', 'D', 'E', 'f', 'g'] >>> # now remove them >>> letters[2:5] = [] >>> letters ['a', 'b', 'f', 'g'] >>> # clear the list by replacing all the elements with an empty list >>> letters[:] = [] >>> letters []
ro: >>> litere = ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> litere ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> # înlocuim anumite valori >>> litere[2:5] = ['C', 'D', 'E'] >>> litere ['a', 'b', 'C', 'D', 'E', 'f', 'g'] >>> # acum să le ștergem >>> litere[2:5] = [] >>> litere ['a', 'b', 'f', 'g'] >>> # ștergem lista înlocuindu-i șirul de elemente cu o listă goală >>> litere[:] = [] >>> litere []

source: The built-in function :func:`len` also applies to lists::
ro: Funcția predefinită :func:`len` se aplică și la liste::

source: >>> letters = ['a', 'b', 'c', 'd'] >>> len(letters) 4
ro: >>> litere = ['a', 'b', 'c', 'd'] >>> len(litere) 4

source: It is possible to nest lists (create lists containing other lists), for example::
ro: Este posibil să imbricăm liste (de la englezescul *to nest*; adică să creăm liste care conțin alte liste), ca de exemplu::

source: First Steps Towards Programming
ro: Primii pași în programare

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_sequence>`_ as follows::
ro: Evident, putem folosi Python-ul la sarcini mult mai complicate decât la a-l aduna pe 2 cu 2. De exemplu, putem construi primii termeni ai `șirului lui Fibonacci <https://en.wikipedia.org/wiki/Fibonacci_sequence>`_ după cum urmează::

source: >>> # Fibonacci series: >>> # the sum of two elements defines the next >>> a, b = 0, 1 >>> while a < 10: ... print(a) ... a, b = b, a+b ... 0 1 1 2 3 5 8
ro: >>> # șirul lui Fibonacci: >>> # suma a doi termeni îl definește pe următorul >>> a, b = 0, 1 >>> while a < 10: ... print(a) ... a, b = b, a+b ... 0 1 1 2 3 5 8

source: This example introduces several new features.
ro: Acest exemplu introduce mai multe caracteristici noi.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
ro: Prima linie conține o *atribuire multiplă*: variabilele ``a`` și ``b`` primesc simultan noile valori 0 și 1. Atribuirea va fi folosită din nou pe ultima linie, ceea ce ne va arăta că toate expresiile din partea dreaptă a semnului atribuirii sunt evaluate înainte să se facă orice atribuire. Aceste expresii din partea dreaptă a atribuirii se evaluează de la stânga la dreapta.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
ro: Execuția ciclului (de la englezescul *loop*; vom folosi și constructele: buclă, instrucțiune iterativă, instrucțiune de ciclare, întâlnite în literatura de specialitate) :keyword:`while` se repetă atâta vreme cât condiția lui (în cazul nostru: ``a < 10``) rămâne adevărată. În Python, la fel ca în C, orice număr întreg nenul are valoarea logică adevărat; zero, în schimb, are valoarea logică fals. Condiția buclei poate lua chiar și valoarea unei liste ori a unui șir de caractere, în fapt, pe cea a oricărei date de tip secvență; orice obiect de lungime nenulă are valoarea logică adevărat, pe când secvențele nule au valoarea logică fals. Testul folosit în exemplu este o simplă comparație. Operatorii tipici de comparație se notează la fel ca în C: ``<`` (mai mic decât), ``>`` (mai mare ca), ``==`` (egal cu), ``<=`` (mai mic sau egal cu), ``>=`` (mai mare sau egal cu) și ``!=`` (neegal cu).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
ro: *Corpul* instrucțiunii iterative are *indentare*: indentarea este modul în care Python-ul grupează instrucțiuni (de la englezescul *statements*). La promptul interactiv, trebuie să tastați fie un Tab fie un spațiu gol pentru fiecare linie cu indentare. În practică, veți prepara inputurile mai complicate destinate Python-ului cu ajutorul unui editor de text; toate editoarele de text decente posedă sisteme de indentare automată. Atunci când o instrucțiune compozită este introdusă în mod interactiv, ea trebuie urmată de o linie goală pentru a indica faptul că s-a încheiat (dat fiind că parserul nu poate ghici când intenționați să tastați utima linie de cod). Remarcați că fiecare din liniile unui asemenea bloc de cod trebuie să aibă o indentare de aceeași lungime.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating-point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
ro: Funcția :func:`print` înscrie valoarea argumentului(elor) primit(e). Această înscriere diferă de simpla inserare a expresiei pe care doriți să o scrieți (așa cum am procedat anterior la exemplele privind calculatorul de birou) prin modul în care prezintă argumentele multiple, cantitățile în virgulă mobilă, precum și șirurile de caractere. Șirurile de caractere sunt tipărite fără semne de citare, cu un spațiu inserat între itemi, astfel încât să puteți formata detaliile într-un mod plăcut, cum ar fi::

source: >>> i = 256*256 >>> print('The value of i is', i) The value of i is 65536
ro: >>> i = 256*256 >>> print('Valoarea lui i este', i) Valoarea lui i este 65536

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
ro: Argumentul cuvânt-cheie *end* poate fi utilizat pentru a evita trecerea la o linie nouă după afișare, precum și atunci când dorim ca afișarea să se încheie cu un șir de caractere diferit de caracterul linie-nouă::

source: Footnotes
ro: Note de subsol

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
ro: Deoarece ``**`` este prioritar (de la englezescul *higher precedence*) față de ``-``, ``-3**2`` va fi interpretată drept ``-(3**2)`` și astfel rezultatul va fi ``-9``. Pentru a nu se întâmpla așa ceva și a obține ``9``, puteți scrie ``(-3)**2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
ro: Spre deosebire de alte limbaje, caracterele speciale precum ``\n`` au aceeași semnificație indiferent dacă sunt scrise cu ghilimele simple (``'...'``) ori cu ghilimele duble (``"..."``). Singura deosebire între cele două modalități este că atunci când întrebuințăm ghilimele simple nu este nevoie să escapăm ghilimelele ``"`` (cu toate că trebuie escapate ghilimelele simple ``\'``) și viceversa.

source: # (hash)
ro: # (haștag)

source: comment
ro: comentariu
