Repository: octaG-M/python-docs-ro
Catalog: tutorial/introduction.po
Languages: ro

source: An Informal Introduction to Python
ro: O introducere informală în Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
ro: În exemplele următoare, intrările și ieșirile se deosebesc prin prezența, respectiv prin absența prompturilor (:term:`>>>` și :term:`...`): ca să probați un exemplu, va trebui să tastați tot ce urmează după promptul lui, atunci când vă apare promptul; liniile care nu încep cu un prompt fac parte din ieșirea interpretorului. Țineți seama de faptul că prezența promptului secundar de unul singur pe o linie dintr-un exemplu înseamnă că trebuie să introduceți o linie goală; prin aceasta se încheie o comandă de mai multe linii.

source: You can use the "Copy" button (it appears in the upper-right corner when hovering over or tapping a code example), which strips prompts and omits output, to copy and paste the input lines into your interpreter.
ro: Folosiți butonul "Copy" (acesta apare în colțul din dreapta-sus atunci când deplasați cursorul ori dați clic oriunde pe suprafața casetei exemplului), care șterge prompturile și elimină afișările de rezultate, pentru a copia și a insera liniile de cod ale exemplelor în interpretorul dumneavoastră.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
ro: Multe din exemplele acestui manual, inclusiv cele introduse la promptul interactiv, includ comentarii. Comentariile încep în Python cu caracterul haștag, ``#``, și țin până la finalul liniei fizice. Un comentariu poate apărea la început de linie, în continuarea unui spațiu gol sau a codului, dar nu în interiorul unui șir de caractere. Un caracter haștag aflat în interiorul unui șir de caractere este un simplu caracter haștag. Deoarece comentariile sunt destinate clarificării codului și nu sunt interpretate de Python, le puteți omite atunci când veți tasta exemplele.

source: Some examples::
ro: Câteva exemple

source: # this is the first comment spam = 1 # and this is the second comment # ... and now a third! text = "# This is not a comment because it's inside quotes."
ro: # acesta este primul comentariu spam = 1 # iar acesta este cel de-al doilea comentariu # ... și acum un al treilea! text = "# Acesta nu e un comentariu pentru că este pus între ghilimele."

source: Using Python as a Calculator
ro: Folosind Python-ul pe post de calculator

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
ro: Haideți să încercăm niște comenzi simple în Python. Porniți interpretorul și așteptați să apară promptul principal, ``>>>``. (N-ar trebui să dureze mult.)

source: Numbers
ro: Numere

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` can be used to perform arithmetic; parentheses (``()``) can be used for grouping. For example::
ro: Interpretorul acționează ca un simplu calculator: dumneavoastră tastați o expresie în el și el vă afișează valoarea ei. Sintaxa expresiei este una imediată: operatorii ``+``, ``-``, ``*`` și ``/`` se folosesc la aritmetică; parantezele (``()``) se utilizează la subexpresii. De exemplu::

source: >>> 2 + 2 4 >>> 50 - 5*6 20 >>> (50 - 5*6) / 4 5.0 >>> 8 / 5 # division always returns a floating-point number 1.6
ro: >>> 2 + 2 4 >>> 50 - 5*6 20 >>> (50 - 5*6) / 4 5.0 >>> 8 / 5 # împărțirea întoarce întotdeauna numere în virgulă mobilă 1.6

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
ro: Numerele întregi (precum ``2``, ``4``, ``20``) sunt de tipul :class:`int`, cele cu parte fracționară (cum ar fi ``5.0``, ``1.6``) de tipul :class:`float`. Vom reveni ulterior la tipurile numerice în tutorial.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result you can use the ``//`` operator; to calculate the remainder you can use ``%``::
ro: Împărțirea (``/``) întoarce întotdeauna un număr în virgulă mobilă. Pentru a face :term:`floor division` și a obține un rezultat întreg va trebui să folosiți operatorul ``//``; pentru calculul restului, utilizați-l pe ``%``::

source: >>> 17 / 3 # classic division returns a float 5.666666666666667 >>> >>> 17 // 3 # floor division discards the fractional part 5 >>> 17 % 3 # the % operator returns the remainder of the division 2 >>> 5 * 3 + 2 # floored quotient * divisor + remainder 17
ro: >>> 17 / 3 # împărțirea obișnuită întoarce un număr în virgulă mobilă 5.666666666666667 >>> >>> 17 // 3 # împărțirea cu rest elimină partea fracționară 5 >>> 17 % 3 # operatorul % întoarce restul împărțirii 2 >>> 5 * 3 + 2 # câtul * împărțitorul + restul 17

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
ro: În Python, puteți folosi operatorul ``**`` pentru a calcula puteri [#]_::

source: >>> 5 ** 2 # 5 squared 25 >>> 2 ** 7 # 2 to the power of 7 128
ro: >>> 5 ** 2 # 5 la pătrat 25 >>> 2 ** 7 # 2 la puterea a 7-a 128

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
ro: Semnul egal (``=``) se folosește pentru a atribui o valoare unei variabile. După aceasta, nu se se va afișa nimic până la apariția următorului prompt interactiv::

source: >>> width = 20 >>> height = 5 * 9 >>> width * height 900
ro: >>> lățime = 20 >>> lungime = 5 * 9 >>> lățime * lungime 900

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
ro: Dacă o variabilă nu este "definită" (nu i s-a atribuit o valoare), atunci când veți încerca să o folosiți vi se va semnala o eroare::

source: >>> n # try to access an undefined variable Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: name 'n' is not defined
ro: >>> popescu # încercați să accesați o variabilă nedefinită Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: name 'popescu' is not defined

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
ro: Folosirea numerelor în virgulă mobilă are suport complet; operatorii cu operanzi de tipuri diferite vor converti operandul întreg la un operand în virgulă mobilă corespunzător::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
ro: În modul interactiv, ultima expresie afișată va fi atribuită variabilei ``_``. Ceea ce înseamnă că, atunci când folosiți Python-ul drept calculator de birou, este cumva mai ușor să continuați calculele lungi, ca de exemplu::

source: >>> tax = 12.5 / 100 >>> price = 100.50 >>> price * tax 12.5625 >>> price + _ 113.0625 >>> round(_, 2) 113.06
ro: >>> taxele = 12.5 / 100 >>> prețul = 100.50 >>> prețul * taxele 12.5625 >>> prețul + _ 113.0625 >>> round(_, 2) 113.06

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
ro: Această variabilă trebuie considerată ca fiind doar-de-citit de către utilizator. Nu-i atribuiți în mod explicit nicio valoare --- dacă o veți face, atunci veți fi definit o variabilă locală, independentă, cu același nume, care va masca variabila predefinită în limbaj cu tot cu purtarea ei magică.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
ro: În afară de :class:`int` și de :class:`float`, Python-ul suportă și alte tipuri de numere, precum :class:`~decimal.Decimal` și :class:`~fractions.Fraction`. De asemeni, Python-ul are suport predefinit pentru :ref:`numerele complexe <typesnumeric>` și folosește sufixul ``j`` sau ``J`` pentru a desemna partea imaginară (ca în ``3+5j``).

source: Python can manipulate text (represented by type :class:`str`, so-called "strings") as well as numbers. This includes characters "``!``", words "``rabbit``", names "``Paris``", sentences "``Got your back.``", etc. "``Yay! :)``". They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_::
ro: Python-ul poate manipula textul (reprezentat de tipul :class:`str`, așa-numitele "șiruri de caractere"; de la englezescul *string*, la singular) la fel de bine ca numerele. Acesta include caractere precum "``!``", cuvinte cum ar fi "``iepure``", nume ca "``Paris``", propoziții de felul lui "``Te ajut eu.``", șamd. "``Uraa! :)``". Toate acestea pot fi încadrate fie de ghilimele simple (``'...'``) fie de ghilimele duble (``"..."``), cu același rezultat [#]_. Exemplul care urmează folosește *referințe intraductibile* la scheciurile Monty Python. Astfel, apar expresiile `spam eggs <https://en.wikipedia.org/wiki/Spam_(food)>`_ și `Paris rabbit got your back <https://en.wikipedia.org/wiki/Rabbit_of_Caerbannog>`_::

source: >>> 'spam eggs' # single quotes 'spam eggs' >>> "Paris rabbit got your back :)! Yay!" # double quotes 'Paris rabbit got your back :)! Yay!' >>> '1975' # digits and numerals enclosed in quotes are also strings '1975'
ro: >>> 'cărniță oușoare' # ghilimele simple 'cărniță oușoare' >>> "Paris iepurașul ți-apără sălașul :)! Uraa!" # ghilimele duble 'Paris iepurașul ți-apără sălașul :)! Uraa!' >>> '1975' # cifrele și numerele dintre ghilimele simple sunt șiruri de caractere '1975'

source: To quote a quote, we need to "escape" it, by preceding it with ``\``. Alternatively, we can use the other type of quotation marks::
ro: Ca să citați ghilimelele (simple sau duble), trebuie să le "salvați" (de la englezescul *escape*; vom utiliza constructele: caracter escape, secvență escape, a escapa și derivate ale lor, întâlnite în literatura de specialitate) prefixându-le cu ``\``. Altfel, puteți încadra textul respectiv cu celălalt tip de semne de punctuație pentru citare::

source: >>> 'doesn\'t' # use \' to escape the single quote... "doesn't" >>> "doesn't" # ...or use double quotes instead "doesn't" >>> '"Yes," they said.' '"Yes," they said.' >>> "\"Yes,\" they said." '"Yes," they said.' >>> '"Isn\'t," they said.' '"Isn\'t," they said.'
ro: >>> 'McDonald\'s' # folosim \' ca sa inserăm ghilimele simple... "McDonald's" >>> "McDonald's" # ...sau folosim ghilimelele duble "McDonald's" >>> '"Da," ziseră ei.' '"Da," ziseră ei.' >>> "\"Da,\" ziseră ei." '"Da," ziseră ei.' >>> '"Omu\' nostru," spuseră ei.' '"Omu\' nostru," spuseră ei.'

source: In the Python shell, the string definition and output string can look different. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
ro: În interpretorul de comenzi Python, rezultatul afișării unui șir de caractere poate să difere mult de definiția șirului de caractere. Funcția :func:`print` produce o afișare lizibilă a acestuia, omițând ghilimele care îl încadrează și tipărind caracterele escape, respectiv caracterele speciale::

source: >>> s = 'First line.\nSecond line.' # \n means newline >>> s # without print(), special characters are included in the string 'First line.\nSecond line.' >>> print(s) # with print(), special characters are interpreted, so \n produces new line First line. Second line.
ro: >>> s = 'Prima linie.\nA doua linie.' # \n înseamnă linie nouă >>> s # fără print() caracterele speciale vor fi inserate în șir 'Prima linie.\nA doua linie.' >>> print(s) # cu print() caracterele speciale vor fi interpretate, deci \n va produce o linie nouă Prima linie. A doua linie.

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
ro: Dacă nu doriți să fie interpretate drept caractere speciale caracterele prefațate cu ``\``, atunci puteți utiliza *șirurile brute* (de la englezescul *raw*) de caractere adăugând un ``r`` înaintea ghilimelelor simple de început::

source: >>> print('C:\some\name') # here \n means newline! C:\some ame >>> print(r'C:\some\name') # note the r before the quote C:\some\name
ro: >>> print('C:\prenume\nume') # aici \n înseamnă linie nouă! C:\prenume ume >>> print(r'C:\prenume\nume') # remarcați r-ul dinaintea ghilimelelor C:\prenume\nume

source: There is one subtle aspect to raw strings: a raw string may not end in an odd number of ``\`` characters; see :ref:`the FAQ entry <faq-programming-raw-string-backslash>` for more information and workarounds.
ro: Există o subtilitate vizavi de șirurile brute de caractere: un șir brut de caractere nu se poate termina cu un număr impar de caractere ``\``; vedeți :ref:`rubrica FAQ <faq-programming-raw-string-backslash>` pentru mai multe informații și tehnici de evitare a dificultăților.

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End-of-line characters are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. In the following example, the initial newline is not included::
ro: Valorile literale (de la englezescul *literals*; vom folosi și constructele: literal, literale, întâlnite în literatura de specialitate) șir-de-caractere se pot întinde pe mai multe linii. Pentru aceasta puteți utiliza semne de citare triple: ``"""..."""`` sau ``'''...'''``. Caracterele sfârșit-de-linie sunt incluse automat în șirul de caractere, ceea ce poate fi evitat prin adăugarea unui ``\`` la final de linie. În exemplul următor, caracterul linie-nouă inițial nu va fi inserat::

source: >>> print("""\ ... Usage: thingy [OPTIONS] ... -h Display this usage message ... -H hostname Hostname to connect to ... """) Usage: thingy [OPTIONS] -h Display this usage message -H hostname Hostname to connect to >>>
ro: >>> print("""\ ... Mod de folosință: comanda [OPȚIUNI] ... -h Afișati acest mesaj de utilizare ... -H numele_gazdei Numele gazdei la care vreți să vă conectați ... """) Mod de folosință: comanda [OPȚIUNI] -h Afișati acest mesaj de utilizare -H numele_gazdei Numele gazdei la care vreți să vă conectați >>>

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
ro: Șirurile de caractere pot fi concatenate (lipite unul de celălalt) cu operatorul ``+``, respectiv repetate cu operatorul ``*``::

source: >>> # 3 times 'un', followed by 'ium' >>> 3 * 'un' + 'ium' 'unununium'
ro: >>> # 'un' de 3 ori, urmat de 'ium' >>> 3 * 'un' + 'ium' 'unununium'

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
ro: Două sau mai multe *literale șir-de-caractere* (adică șiruri de caractere încadrate de semne de citare), odată ce sunt plasate unul lângă celălalt, vor fi concatenate automat::

source: This feature is particularly useful when you want to break long strings::
ro: Această caracteristică este utilă mai ales atunci când intenționați să porționați șirurile lungi de caractere::

source: >>> text = ('Put several strings within parentheses ' ... 'to have them joined together.') >>> text 'Put several strings within parentheses to have them joined together.'
ro: >>> textul = ('Puneți mai multe șiruri de caractere între paranteze ' ... 'pentru ca ele să fie îmbinate.') >>> textul 'Puneți mai multe șiruri de caractere între paranteze pentru ca ele să fie îmbinate.'

source: This only works with two literals though, not with variables or expressions::
ro: Această tehnică funcționează numai cu valori literale, deci nu cu variabile și nici cu expresii::

source: >>> prefix = 'Py' >>> prefix 'thon' # can't concatenate a variable and a string literal File "<stdin>", line 1 prefix 'thon' ^^^^^^ SyntaxError: invalid syntax >>> ('un' * 3) 'ium' File "<stdin>", line 1 ('un' * 3) 'ium' ^^^^^ SyntaxError: invalid syntax
ro: >>> prefixul = 'Py' >>> prefixul 'thon' # nu concatenăm o variabilă cu o valoare literală File "<stdin>", line 1 prefix 'thon' ^^^^^^ SyntaxError: invalid syntax >>> ('un' * 3) 'ium' File "<stdin>", line 1 ('un' * 3) 'ium' ^^^^^ SyntaxError: invalid syntax

source: If you want to concatenate variables or a variable and a literal, use ``+``::
ro: Dacă doriți să concatenați variabile ori o variabilă cu o valoare literală, atunci folosiți ``+``-ul::

source: >>> prefix + 'thon' 'Python'
ro: >>> prefixul + 'thon' 'Python'

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
ro: Șirurile de caractere pot fi *indexate* (numerotate), primul caracter din șir având indicele 0. Nu există tipul caracter de sine stătător; un caracter este doar un șir de caractere cu lungimea 1::

source: >>> word = 'Python' >>> word[0] # character in position 0 'P' >>> word[5] # character in position 5 'n'
ro: >>> cuvântul = 'Python' >>> cuvântul[0] # caracterul de pe poziția 0 'P' >>> cuvântul[5] # caracterul de pe poziția 5 'n'

source: Indices may also be negative numbers, to start counting from the right::
ro: Indici pot fi și numerele negative, dacă dorim să începem numărătoarea de la dreapta::

source: >>> word[-1] # last character 'n' >>> word[-2] # second-last character 'o' >>> word[-6] 'P'
ro: >>> cuvântul[-1] # ultimul caracter 'n' >>> cuvântul[-2] # penultimul caracter 'o' >>> cuvântul[-6] 'P'

source: Note that since -0 is the same as 0, negative indices start from -1.
ro: Remarcați că, deoarece -0 este totuna cu 0, indicii negativi încep de la -1.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain a substring::
ro: În afară de indexare, este suportată și *tranșarea* (felierea, de la englezescul *slicing*). În timp ce indexarea se folosește la obținerea de caractere individuale, *tranșarea* vă permite să extrageți un subșir de caractere::

source: >>> word[0:2] # characters from position 0 (included) to 2 (excluded) 'Py' >>> word[2:5] # characters from position 2 (included) to 5 (excluded) 'tho'
ro: >>> cuvântul[0:2] # caractere de la poziția 0 (cu) până la 2 (fără) 'Py' >>> cuvântul[2:5] # caractere de la poziția 2 (cu) până la 5 (fără) 'tho'

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
ro: Indicii unei tranșe au valori implicite utile; un indice de început, odată ce este omis, va fi implicit zero pe când un indice de final, omis, va lua în mod implicit ca valoare lungimea șirului de caractere în curs de tranșare.

source: >>> word[:2] # character from the beginning to position 2 (excluded) 'Py' >>> word[4:] # characters from position 4 (included) to the end 'on' >>> word[-2:] # characters from the second-last (included) to the end 'on'
ro: >>> cuvântul[:2] # caractere de la început până la poziția 2 (fără) 'Py' >>> cuvântul[4:] # caractere de la poziția 4 (cu) până la sfârșit 'on' >>> cuvântul[-2:] # caractere de la penultimul (cu) până la final 'on'

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
ro: Remarcați că începutul este întotdeauna inclus, pe când finalul este întotdeauna lipsă. Această proprietate face ca ``s[:i] + s[i:]`` să fie egal întotdeauna cu ``s``::

source: >>> word[:2] + word[2:] 'Python' >>> word[:4] + word[4:] 'Python'
ro: >>> cuvântul[:2] + cuvântul[2:] 'Python' >>> cuvântul[:4] + cuvântul[4:] 'Python'

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
ro: O metodă de a ține minte cum funcționează tranșatul este să vă imaginați indicii ca țintind *între* caractere, iar muchia stângă a primului caracter ca fiind numerotată cu 0. Atunci, muchia dreaptă a ultimului caracter al unui șir de caractere de *n* caractere va avea indexul *n*, ca de exemplu::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
ro: Primul rând de numere dă poziția fiecăruia dintre indicii 0...6 ai șirului de caractere; cel de-al doilea rând pe cea a indicilor negativi corespunzători. Tranșa de la *i* la *j* constă din toate caracterele situate între muchiile notate cu *i* și respectiv cu *j*.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
ro: Pentru indicii nenegativi, lungimea unei tranșe este diferența indicilor, aceasta dacă amândoi sunt în limita valorilor permise. De exemplu, lungimea lui ``cuvântul[1:3]`` este 2.

source: Attempting to use an index that is too large will result in an error::
ro: Încercarea de a folosi un indice prea mare va conduce la o eroare::

source: >>> word[42] # the word only has 6 characters Traceback (most recent call last): File "<stdin>", line 1, in <module> IndexError: string index out of range
ro: >>> cuvântul[42] # cuvântul are numai 6 caractere Traceback (most recent call last): File "<stdin>", line 1, in <module> IndexError: string index out of range

source: However, out of range slice indexes are handled gracefully when used for slicing::
ro: Cu toate acestea, indicii care depășesc plaja valorilor permise vor fi rezolvați cu eleganță atunci când îi folosim la tranșare::

source: >>> word[4:42] 'on' >>> word[42:] ''
ro: >>> cuvântul[4:42] 'on' >>> cuvântul[42:] ''

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
ro: Șirurile de caractere Python nu pot fi modificate --- ele sunt :term:`immutable`. De aceea, atribuirea de valori unei poziții indexate dintr-un șir de caractere va produce o eroare::
