Repository: octaG-M/python-docs-ro
Catalog: tutorial/modules.po
Languages: ro

source: The variable ``sys.path`` is a list of strings that determines the interpreter's search path for modules. It is initialized to a default path taken from the environment variable :envvar:`PYTHONPATH`, or from a built-in default if :envvar:`PYTHONPATH` is not set. You can modify it using standard list operations::
ro: Variabila ``sys.path`` este o listă formată din șiruri de caractere care determină calea de căutare a modulelor. Este inițializată cu o cale implicită preluată din variabila de mediu :envvar:`PYTHONPATH`, ori dintr-o altă cale prestabilită atunci când :envvar:`PYTHONPATH` nu a fost setată. O puteți modifica folosind operațiile tipice cu liste::

source: The :func:`dir` Function
ro: Funcția :func:`dir`

source: The built-in function :func:`dir` is used to find out which names a module defines. It returns a sorted list of strings::
ro: Funcția predefinită :func:`dir` este întrebuințată la aflarea numelor pe care le definește un anumit modul. Ea returnează o listă sortată de șiruri de caractere::

source: Without arguments, :func:`dir` lists the names you have defined currently::
ro: Utilizată fără argumente, :func:`dir` va lista numele definite în sesiunea curentă::

source: Note that it lists all types of names: variables, modules, functions, etc.
ro: Remarcați faptul că ea listează toate tipurile de nume: pe cele de variabile, pe cele de module, de funcții șamd.

source: :func:`dir` does not list the names of built-in functions and variables. If you want a list of those, they are defined in the standard module :mod:`builtins`::
ro: :func:`dir` nu listează nici numele funcțiilor predefinite (în englezește, ca jargon, *built-in*) și nici pe cele ale variabilelor predefinite. Dacă vă interesează lista acestora, atunci aflați că ele sunt definite în modulul standard :mod:`builtins`::

source: Packages
ro: Pachete

source: Packages are a way of structuring Python's module namespace by using "dotted module names". For example, the module name :mod:`!A.B` designates a submodule named ``B`` in a package named ``A``. Just like the use of modules saves the authors of different modules from having to worry about each other's global variable names, the use of dotted module names saves the authors of multi-module packages like NumPy or Pillow from having to worry about each other's module names.
ro: Pachetele constituie o modalitate de structurare a spațiului de nume al modulelor Python folosind "nume-cu-puncte de module" (de la englezescul *dotted*). De exemplu, numele de modul :mod:`!A.B` se referă la (sub)modulul ``B`` din pachetul numit ``A``. Tot așa cum utilizarea modulelor îl scapă pe autorul unui modul de grija eventualelor conflicte de nume cu variabilele globale din modulul altui autor, întrebuințarea de nume-cu-puncte de module îi scapă pe autorii unor pachete multi-modul precum NumPy sau Pillow de grija numelor de module ale altor autori de pachete multi-modul.

source: Suppose you want to design a collection of modules (a "package") for the uniform handling of sound files and sound data. There are many different sound file formats (usually recognized by their extension, for example: :file:`.wav`, :file:`.aiff`, :file:`.au`), so you may need to create and maintain a growing collection of modules for the conversion between the various file formats. There are also many different operations you might want to perform on sound data (such as mixing, adding echo, applying an equalizer function, creating an artificial stereo effect), so in addition you will be writing a never-ending stream of modules to perform these operations. Here's a possible structure for your package (expressed in terms of a hierarchical filesystem):
ro: Să presupunem că doriți să proiectați o colecție de module (adică, un "pachet") dedicate manipulării sistematice a fișierelor de sunet și a datelor audio. Deoarece există numeroase formate de fișier de sunet (recunoscute, de obicei, după `extensiile <https://en.wikipedia.org/wiki/Filename_extension>`_ lor, cum ar fi: :file:`.wav`, :file:`.aiff`, :file:`.au`), veți avea de construit și de întreținut o colecție crescândă de module care să se ocupe cu conversia între diversele formate de fișier. De asemeni, există felurite operații pe care veți dori să le aplicați unor date audio (precum mixaje, adăugarea de ecouri, aplicarea unor funcții de egalizare, crearea unor efecte stereo artificiale), astfel că, pe lângă cele de dinainte, veți scrie în permanență noi module pentru aceste operații. Iată o structură posibilă a pachetului dumneavoastră (exprimată în stilul unui `sistem ierarhic de fișiere <https://en.wikipedia.org/wiki/File_system>`_ -- în englezește, ca jargon, *filesystem*):

source: sound/ Top-level package __init__.py Initialize the sound package formats/ Subpackage for file format conversions __init__.py wavread.py wavwrite.py aiffread.py aiffwrite.py auread.py auwrite.py ... effects/ Subpackage for sound effects __init__.py echo.py surround.py reverse.py ... filters/ Subpackage for filters __init__.py equalizer.py vocoder.py karaoke.py ...
ro: sunet/ Pachetul-rădăcină __init__.py Inițializarea pachetului de sunet formate/ Subpachetul conversiilor de formate de fișier __init__.py citesc_wav.py scriu_wav.py citesc_aiff.py scriu_aiff.py citesc_au.py scriu_au.py ... efecte/ Subpachetul efectelor audio __init__.py ecou.py înconjurător.py inversare.py ... filtre/ Subpachetul filtrelor __init__.py egalizator.py codare_vo.py karaoke.py ...

source: When importing the package, Python searches through the directories on ``sys.path`` looking for the package subdirectory.
ro: Atunci când importăm un pachet, Python-ul va căuta subdirectorul pachetului în lista de directoare din ``sys.path``.

source: The :file:`__init__.py` files are required to make Python treat directories containing the file as packages (unless using a :term:`namespace package`, a relatively advanced feature). This prevents directories with a common name, such as ``string``, from unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
ro: Prezența unui fișier :file:`__init__.py` într-un director obligă Python-ul să trateze respectivul director drept pachet (un astfel de fișier lipsește dacă folosim directorul pe post de :term:`namespace package`, adică o caracteristică oarecum avansată a Python-ului despre care nu discutăm chiar acum). Acest procedeu face ca directoare cu nume banale, cum ar fi ``string``, să nu poată conține, din pură întâmplare, module de interes ce ar trebui să fie găsite abia la locații ulterioare din calea de căutare a modulelor. În cel mai simplu caz, :file:`__init__.py` este doar un fișier gol, însă el poate include, în general, cod de inițializare a pachetului ori o setare a variabilei ``__all__``, la care ne vom referi mai târziu.

source: Users of the package can import individual modules from the package, for example::
ro: Utilizatorii unui pachet pot importa module individuale din acesta, ca de exemplu::

source: import sound.effects.echo
ro: import sunet.efecte.ecou

source: This loads the submodule :mod:`!sound.effects.echo`. It must be referenced with its full name. ::
ro: Această instrucțiune încarcă submodulul :mod:`!sunet.efecte.ecou`. Ne vom referi la el numai folosindu-i numele complet. ::

source: sound.effects.echo.echofilter(input, output, delay=0.7, atten=4)
ro: sunet.efecte.ecou.filtru_de_ecou(intrare, ieșire, întârziere=0.7, atenuare=4)

source: An alternative way of importing the submodule is::
ro: Alt fel de a importa submodulul anterior este dat de::

source: from sound.effects import echo
ro: from sunet.efecte import ecou

source: This also loads the submodule :mod:`!echo`, and makes it available without its package prefix, so it can be used as follows::
ro: Și această instrucțiune încarcă submodulul :mod:`!ecou`, pe care îl face accesibil fără prefixul cu nume de pachete, deci ne permite să-l întrebuințăm după cum urmează::

source: echo.echofilter(input, output, delay=0.7, atten=4)
ro: ecou.filtru_de_ecou(intrare, ieșire, întârziere=0.7, atenuare=4)

source: Yet another variation is to import the desired function or variable directly::
ro: Încă o variație a modului de a importa este să importăm direct fie funcția fie variabila dorită::

source: from sound.effects.echo import echofilter
ro: from sunet.efecte.ecou import filtru_de_ecou

source: Again, this loads the submodule :mod:`!echo`, but this makes its function :func:`!echofilter` directly available::
ro: Ca și până acum, instrucțiunea va încărca submodulul :mod:`!ecou` însă ne va permite să folosim funcția :func:`!filtru_de_ecou` din acesta numai cu numele ei::

source: echofilter(input, output, delay=0.7, atten=4)
ro: filtru_de_ecou(intrare, ieșire, întârziere=0.7, atenuare=4)

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
ro: Să remarcăm că, atunci când executăm instrucțiunea ``from pachet import element``, elementul poate fi sau un submodul (ori un subpachet) al pachetului sau orice alt nume definit în pachet, adică o funcție, o clasă ori o variabilă. Instrucțiunea ``import`` testează mai întâi dacă elementul este definit în pachet; dacă nu, atunci va presupune că elementul este numele unui modul și va încerca să-l încarce. În cazul în care presupusul modul nu va fi găsit, va fi ridicată o excepție :exc:`ImportError`.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
ro: În schimb, atunci când facem uz de o sintaxă de felul ``import element.sub_element.sub_sub_element``, fiecare (sub)element, cu excepția ultimului, trebuie să fie nume de pachet; ultimul element poate fi sau nume de modul sau nume de pachet însă nu și numele vreunei clase, funcții ori variabile definite în elementul precedent.

source: Importing \* From a Package
ro: Importând \* dintr-un pachet

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
ro: Ce se întâmplă însă atunci când utilizatorul folosește instrucțiunea ``from sunet.efecte import *``? În mod ideal, putem spera că interpretorul se duce la sistemul de fișiere, găsește toate (sub)modulele prezente în pachet și le importă. O atare activitate este de așteptat să dureze mult iar importul de sub-module poate avea și efecte secundare nedorite pe care nu le-am produce dacă importul unui sub-modul oarecare ar fi realizat în mod explicit.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
ro: Singurul mod în care putem evita situațiile neplăcute este ca autorul pachetului să ofere un index explicit al acestuia. Instrucțiunea :keyword:`import` folosește următoarea convenție: atunci când codul-sursă al fișierului :file:`__init__.py` dintr-un pachet definește o variabilă de tip listă numită ``__all__``, valoarea acestei variabile va fi folosită drept lista numelor de module ce vor trebui importate atunci când interpretorul va avea de executat instrucțiunea ``from pachet import *``. Actualizarea listei de nume, cu ocazia lansării unei noi versiuni a pachetului, rămâne numai la latitudinea autorului acestuia. Autorii de pachete pot decide chiar și să nu întrebuințeze această facilitate atunci când nu consideră că ar fi de vreun folos să se importe \* din pachetele lor. Ca exemplu, să presupunem că fișierul :file:`sunet/efecte/__init__.py` ar conține următoarea linie de cod::

source: __all__ = ["echo", "surround", "reverse"]
ro: __all__ = ["ecou", "înconjurător", "inversare"]

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`!sound.effects` package.
ro: Aceasta ar însemna că, la execuția lui ``from sunet.efecte import *``, vor fi importate cele trei submodule mai sus numite ale pachetului :mod:`!sunet.efecte`.

source: Be aware that submodules might become shadowed by locally defined names. For example, if you added a ``reverse`` function to the :file:`sound/effects/__init__.py` file, the ``from sound.effects import *`` would only import the two submodules ``echo`` and ``surround``, but *not* the ``reverse`` submodule, because it is shadowed by the locally defined ``reverse`` function::
ro: Băgați de seamă că numele de (sub)module pot fi acoperite (de la englezescul *shadowed*; adică, au devenit *invizibile* pentru instrucțiunea curentă) de nume definite local. De exemplu, dacă ați adăugat definiția unei funcții ``inversare`` la codul-sursă al fișierului :file:`sunet/efecte/__init__.py`, atunci execuția lui ``from sunet.efecte import *`` va produce importul celor două submodule ``ecou`` și ``înconjurător`` însă nu și importul submodulului ``inversare`` deoarece numele acestuia este acoperit de cel al funcției ``inversare`` definită local::

source: __all__ = [ "echo", # refers to the 'echo.py' file "surround", # refers to the 'surround.py' file "reverse", # !!! refers to the 'reverse' function now !!! ] def reverse(msg: str): # <-- this name shadows the 'reverse.py' submodule return msg[::-1] # in the case of a 'from sound.effects import *'
ro: __all__ = [ "ecou", # se referă la fișierul 'ecou.py' "înconjurător", # se referă la fișierul 'înconjurător.py' "inversare", # !!! se referă la funcția 'inversare' !!! ] def inversare(mesaj: str): # <-- acest nume îl acoperă pe cel al submodulului 'inversare.py' return mesaj[::-1] # dacă se execută 'from sunet.efecte import *'

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`!sound.effects` into the current namespace; it only ensures that the package :mod:`!sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
ro: Atunci când ``__all__`` nu este definită, execuția instrucțiunii ``from sunet.efecte import *`` *nu* va produce importul tuturor submodulelor din pachetul :mod:`!sunet.efecte` în spațiul de nume curent; tot ceea ce va face este să se asigure mai întâi că pachetul :mod:`!sunet.efecte` a fost importat (ceea ce poate însemna inclusiv execuția codului de inițializare găsit în :file:`__init__.py`), după care va importa toate numele definite în pachet. Aceasta va include numele (precum și submodulele încărcate explicit) din :file:`__init__.py`. Va include, desigur, și toate submodulele pachetului care au fost deja încărcate explicit prin execuția precedentelor instrucțiuni :keyword:`import`. Să luăm în considerare următoarele linii de cod::

source: import sound.effects.echo import sound.effects.surround from sound.effects import *
ro: import sunet.efecte.ecou import sunet.efecte.înconjurător from sunet.efecte import *

source: In this example, the :mod:`!echo` and :mod:`!surround` modules are imported in the current namespace because they are defined in the :mod:`!sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
ro: În exemplul de față, modulele :mod:`!ecou` și :mod:`!înconjurător` sunt importate în spațiul de nume curent deoarece ele sunt definite în pachetul :mod:`!sunet.efecte` la momentul execuției instrucțiunii ``from...import``. (Ceea ce rămâne valabil și în cazul când ``__all__`` este definită.)

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practice in production code.
ro: Cu toate că anumite module au fost proiectate să nu exporte decât acele nume care respectă șabloane precise atunci când dumneavoastră veți folosi instrucțiunea ``import *`` în raport de ele, întrebuințarea acestei instrucțiuni în codul destinat producției se socotește a fi o practică greșită.

source: Remember, there is nothing wrong with using ``from package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
ro: Țineți minte, nu este nimic în neregulă dacă utilizați instrucțiunea ``from pachet import submodulul_cutare``! De fapt, aceasta constituie chiar formularea recomandată a oricărei instrucțiuni de import, cu excepția situației în care modulul importator are de folosit submodule omonime din pachete diferite.

source: Intra-package References
ro: Referințe intra-pachet

source: When packages are structured into subpackages (as with the :mod:`!sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`!sound.filters.vocoder` needs to use the :mod:`!echo` module in the :mod:`!sound.effects` package, it can use ``from sound.effects import echo``.
ro: Atunci când pachetele sunt organizate în subpachete (cum este cazul pachetului :mod:`!sunet` din exemplul de mai sus), puteți folosi importurile absolute pentru a vă referi la submodule din (sub)pachete înrudite. Astfel, dacă presupunem că modulul :mod:`!sunet.filtre.codare_vo` trebuie să utilizeze modulul :mod:`!ecou` din pachetul :mod:`!sunet.efecte`, atunci putem întrebuința instrucțiunea ``from sunet.efecte import ecou``.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`!surround` module for example, you might use::
ro: Puteți construi și instrucțiuni de import relativ, scrise sub forma ``from modul import nume``. Aceste instrucțiuni de import vor folosi puncte de sine stătătoare pentru a indica fie pachetul curent fie pachetul-părinte al pachetului curent la care se referă importul relativ în cauză. Dacă scrieți cod situat, de exemplu, în modulul :mod:`!înconjurător`, atunci ați putea utiliza formulele::

source: from . import echo from .. import formats from ..filters import equalizer
ro: from . import ecou from .. import formate from ..filtre import egalizator

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
ro: Să observăm că importurile relative se raportează la numele modulului curent. Dat fiind că numele modulului principal (de la englezescul *main*) este întotdeauna ``"__main__"``, modulele pe care intenționăm să le utilizăm pe post de modul principal al vreunei aplicații Python trebuie să folosească doar importuri absolute.

source: Packages in Multiple Directories
ro: Pachete situate în mai multe directoare

source: Packages support one more special attribute, :attr:`~module.__path__`. This is initialized to be a :term:`sequence` of strings containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
ro: Pachetele dispun de încă un atribut special, și anume de :attr:`~module.__path__`. El este inițializat cu o valoare de tipul :term:`sequence` de șiruri de caractere care include numele directorului în care s-a aflat fișierul :file:`__init__.py` al unui anumit pachet înainte să înceapă execuția codului Python din fișierul respectiv. Valoarea acestui atribut poate fi modificată. Modificarea ei va afecta căutările de module și de subpachete ale pachetului în discuție.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
ro: Deși este o caracteristică de care avem nevoie rar, o putem folosi cu succes la lărgirea setului de module conținute într-un pachet.

source: Footnotes
ro: Note de subsol

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition adds the function name to the module's global namespace.
ro: De fapt, și definițiile de funcții sunt 'instrucțiuni' care se 'execută'; execuția unei definiții de funcție de la nivel de modul va adăuga numele acestei funcții la spațiul de nume global al modulului respectiv.

source: module
ro: modul

source: search
ro: căutare

source: path
ro: cale
