Repository: octaG-M/python-docs-ro
Catalog: tutorial/stdlib.po
Languages: ro

source: The :mod:`sqlite3` module is a wrapper for the SQLite database library, providing a persistent database that can be updated and accessed using slightly nonstandard SQL syntax.
ro: Modulul :mod:`sqlite3` este o împachetare a bibliotecii de baze de date SQLite, care ne pune la dispoziție o bază de date persistentă (pe *disc*) ce va putea fi actualizată și accesată folosind o sintaxă SQL puțin atipică.

source: Internationalization is supported by a number of modules including :mod:`gettext`, :mod:`locale`, and the :mod:`codecs` package.
ro: `Internaționalizarea <https://en.wikipedia.org/wiki/Internationalization_and_localization>`_ este facilitată de un număr de module, incluzându-le aici pe :mod:`gettext`, :mod:`locale`, precum și de pachetul :mod:`codecs`.

source: built-in function
ro: funcție predefinită

source: help
ro: ajutor
