Repository: octaG-M/python-docs-ro
Catalog: tutorial/stdlib.po
Languages: ro

source: Brief Tour of the Standard Library
ro: Turul pe scurt al bibliotecii standard

source: Operating System Interface
ro: Interfața cu sistemul de operare

source: The :mod:`os` module provides dozens of functions for interacting with the operating system::
ro: Modulul :mod:`os` ne furnizează o cantitate consistentă de funcții pentru interacțiunea cu sistemul de operare::

source: >>> import os >>> os.getcwd() # Return the current working directory 'C:\\Python313' >>> os.chdir('/server/accesslogs') # Change current working directory >>> os.system('mkdir today') # Run the command mkdir in the system shell 0
ro: >>> import os >>> # Returnează directorul curent (în care ne găsim chiar acum): >>> os.getcwd() 'C:\\Python313' >>> # Schimbăm directorul curent: >>> os.chdir('/serverul/jurnalul_accesărilor') >>> # Rulăm comanda mkdir în interpretorul de comenzi (shell) >>> # al sistemului: >>> os.system('mkdir lucru_astăzi') 0

source: Be sure to use the ``import os`` style instead of ``from os import *``. This will keep :func:`os.open` from shadowing the built-in :func:`open` function which operates much differently.
ro: Aveți grijă să realizați importul în *stilul* dat de ``import os`` și nu scriind ``from os import *``. Astfel, veți evita ca apelarea funcției :func:`os.open` să se producă în locul celei a funcției predefinite :func:`open`, aceasta din urmă funcționând complet diferit.

source: The built-in :func:`dir` and :func:`help` functions are useful as interactive aids for working with large modules like :mod:`os`::
ro: Funcțiile predefinite :func:`dir` și :func:`help` ne vor fi utile ca ajutoare *interactive* atunci când lucrăm cu module masive, precum :mod:`os`::

source: >>> import os >>> dir(os) <returns a list of all module functions> >>> help(os) <returns an extensive manual page created from the module's docstrings>
ro: >>> import os >>> dir(os) <returnează o listă cu toate funcțiile din modul> >>> help(os) <returnează o pagină extensivă de manual, bazată pe docstring-ul modulului>

source: For daily file and directory management tasks, the :mod:`shutil` module provides a higher level interface that is easier to use::
ro: Pentru sarcinile administrative zilnice privind fișierele și directoarele, modulul :mod:`shutil` ne pune la dispoziție o interfață de nivel înalt care este (mai) ușor de întrebuințat::

source: >>> import shutil >>> shutil.copyfile('data.db', 'archive.db') 'archive.db' >>> shutil.move('/build/executables', 'installdir') 'installdir'
ro: >>> import shutil >>> shutil.copyfile('datele.db', 'arhiva.db') 'arhiva.db' >>> shutil.move('/build/executabilele', 'directorul_instalării') 'directorul_instalării'

source: File Wildcards
ro: Caractere de înlocuire pentru fișiere

source: The :mod:`glob` module provides a function for making file lists from directory wildcard searches::
ro: Modulul :mod:`glob` dispune de o funcție care realizează liste de fișiere bazate pe căutări cu *caractere de înlocuire* (sau *meta-caractere*; de la englezescul *wildcard*) în directorul curent (și nu numai)::

source: >>> import glob >>> glob.glob('*.py') ['primes.py', 'random.py', 'quote.py']
ro: >>> import glob >>> glob.glob('*.py') ['numere_prime.py', 'numere_aleatoare.py', 'cote.py']

source: Command Line Arguments
ro: Argumente în linia de comandă

source: Common utility scripts often need to process command line arguments. These arguments are stored in the :mod:`sys` module's *argv* attribute as a list. For instance, let's take the following :file:`demo.py` file::
ro: Scripturile utilitare pe care le întrebuințăm în mod obișnuit necesită adesea procesarea argumentelor primite în linia de comandă. Aceste argumente sunt stocate, sub formă de listă, în atributul *argv* al modulului :mod:`sys`. De exemplu, să presupunem că avem un fișier :file:`demonstrativ.py`, cu următorul conținut::

source: # File demo.py import sys print(sys.argv)
ro: # Fișierul demonstrativ.py import sys print(sys.argv)

source: Here is the output from running ``python demo.py one two three`` at the command line::
ro: Iată ce se va obține în urma execuției comenzii ``python demonstrativ.py unu doi trei`` în linie de comandă::

source: ['demo.py', 'one', 'two', 'three']
ro: ['demonstrativ.py', 'unu', 'doi', 'trei']

source: The :mod:`argparse` module provides a more sophisticated mechanism to process command line arguments. The following script extracts one or more filenames and an optional number of lines to be displayed::
ro: Modulul :mod:`argparse` ne oferă un mecanism (mai) sofisticat pentru manipularea argumentelor primite în linia de comandă. Scriptul de mai jos extrage (din șirul de caractere al liniei de comandă) unul sau mai multe nume de fișiere, respectiv numărul opțional de rânduri ce urmează a fi afișate din fiecare din fișierele cu numele extrase::

source: import argparse parser = argparse.ArgumentParser( prog='top', description='Show top lines from each file') parser.add_argument('filenames', nargs='+') parser.add_argument('-l', '--lines', type=int, default=10) args = parser.parse_args() print(args)
ro: # Conținutul scriptului capturi_de_la_început.py import argparse parserul = argparse.ArgumentParser( prog='capturi_de_la_început', description='Afișează primele rânduri din fiecare fișier') parserul.add_argument('nume_de_fișiere', nargs='+') parserul.add_argument('-l', '--rânduri', type=int, default=10) argumentele = parserul.parse_args() print(argumentele)

source: When run at the command line with ``python top.py --lines=5 alpha.txt beta.txt``, the script sets ``args.lines`` to ``5`` and ``args.filenames`` to ``['alpha.txt', 'beta.txt']``.
ro: Atunci când rulăm în linie de comandă ``python capturi_de_la_început.py --rânduri=5 alfa.txt beta.txt``, scriptul îi va atribui lui ``argumentele.rânduri`` valoarea ``5`` iar lui ``argumentele.nume_de_fișiere`` valoarea ``['alfa.txt', 'beta.txt']``.

source: Error Output Redirection and Program Termination
ro: Redirecționarea ieșirii erorilor și încheierea programelor

source: The :mod:`sys` module also has attributes for *stdin*, *stdout*, and *stderr*. The latter is useful for emitting warnings and error messages to make them visible even when *stdout* has been redirected::
ro: Modulul :mod:`sys` deține atribute și pentru *stdin*, *stdout*, respectiv pentru *stderr*. Acesta din urmă este de folos la emiterea avertismentelor și a mesajelor de eroare, chiar și atunci când (fluxul) *stdout* a fost redirecționat::

source: >>> sys.stderr.write('Warning, log file not found starting a new one\n') Warning, log file not found starting a new one
ro: >>> sys.stderr.write('Atenție, nu găsesc jurnalul, încep unul nou\n') Atenție, nu găsesc jurnalul, încep unul nou

source: The most direct way to terminate a script is to use ``sys.exit()``.
ro: Modul (cel mai) direct de a *încheia* (de la englezescul *terminate*) execuția unui script este să utilizăm ``sys.exit()``.

source: String Pattern Matching
ro: Identificarea după tipare a șirurilor de caractere

source: The :mod:`re` module provides regular expression tools for advanced string processing. For complex matching and manipulation, regular expressions offer succinct, optimized solutions::
ro: Modulul :mod:`re` ne pune la dispoziție unelte care utilizează *expresii regulate* pentru procesări complexe ale șirurilor de caractere. Atunci când suntem interesați de identificări (de la englezescul *matching*) și manipulări sofisticate, expresiile regulate ne vin în ajutor cu soluții succinte, optimizate::

source: >>> import re >>> re.findall(r'\bf[a-z]*', 'which foot or hand fell fastest') ['foot', 'fell', 'fastest'] >>> re.sub(r'(\b[a-z]+) \1', r'\1', 'cat in the the hat') 'cat in the hat'
ro: >>> import re >>> re.findall(r'\bm[a-zăâ]*', 'cine, maică, mâna ori mâncarea pică la măcel') ['maică', 'mâna', 'mâncarea', 'măcel'] >>> re.sub(r'(\b[a-z]+) \1', r'\1', 'hap pe pe halat') 'hap pe halat'

source: When only simple capabilities are needed, string methods are preferred because they are easier to read and debug::
ro: Atunci când avem sarcini de identificare simple, metodele tipului *șir de caractere* sunt de preferat, dat fiind că ele pot fi citite (în codul Python aferent) și depanate mai ușor::

source: >>> 'tea for too'.replace('too', 'two') 'tea for two'
ro: >>> 'ceai pentru Mircea'.replace('Mircea', 'Cici') 'ceai pentru Cici'

source: Mathematics
ro: Matematică

source: The :mod:`math` module gives access to the underlying C library functions for floating-point math::
ro: Modulul :mod:`math` ne facilitează accesul la funcțiile corespondente ale bibliotecii C dedicate calculului (matematicii) în virgulă mobilă::

source: The :mod:`random` module provides tools for making random selections::
ro: Modulul :mod:`random` ne furnizează unelte pentru realizarea de eșantioane aleatoare::

source: >>> import random >>> random.choice(['apple', 'pear', 'banana']) 'apple' >>> random.sample(range(100), 10) # sampling without replacement [30, 83, 16, 4, 8, 81, 41, 50, 18, 33] >>> random.random() # random float from the interval [0.0, 1.0) 0.17970987693706186 >>> random.randrange(6) # random integer chosen from range(6) 4
ro: >>> import random >>> random.choice(['măr', 'pară', 'banană']) 'măr' >>> random.sample(range(100), 10) # eșantionare fără înlocuire [30, 83, 16, 4, 8, 81, 41, 50, 18, 33] >>> random.random() # float aleator din intervalul [0.0, 1.0) 0.17970987693706186 >>> random.randrange(6) # întreg aleator ales din range(6) 4

source: The :mod:`statistics` module calculates basic statistical properties (the mean, median, variance, etc.) of numeric data::
ro: Modulul :mod:`statistics` calculează proprietăți statistice de bază (media, mediana, varianța șamd.) pentru datele numerice::

source: >>> import statistics >>> data = [2.75, 1.75, 1.25, 0.25, 0.5, 1.25, 3.5] >>> statistics.mean(data) 1.6071428571428572 >>> statistics.median(data) 1.25 >>> statistics.variance(data) 1.3720238095238095
ro: >>> import statistics >>> datele = [2.75, 1.75, 1.25, 0.25, 0.5, 1.25, 3.5] >>> statistics.mean(datele) 1.6071428571428572 >>> statistics.median(datele) 1.25 >>> statistics.variance(datele) 1.3720238095238095

source: The SciPy project <https://scipy.org> has many other modules for numerical computations.
ro: Proiectul SciPy <https://scipy.org> deține multe alte module dedicate calculului numeric.

source: Internet Access
ro: Accesul la Internet

source: There are a number of modules for accessing the internet and processing internet protocols. Two of the simplest are :mod:`urllib.request` for retrieving data from URLs and :mod:`smtplib` for sending mail::
ro: Un număr de module sunt dedicate accesării Internetului și procesării protocoalelor acestuia. Două din cele mai simplu de folosit module sunt :mod:`urllib.request`, dedicat extragerii datelor din URL-uri, și :mod:`smtplib`, folosit la trimiterea de scrisori electronice. (Scrisoarea din exemplu conține versul shakespearian *Beware the Ides of March*. Ca traducere a sa am folosit versiunea dată de `Barbu Lăzureanu <https://www.editura.mttlc.ro/carti/W.%20Shakespeare.%20J.%20Caesar.%20B.%20Lazureanu%201892.%20CLP.pdf>`_)::

source: >>> from urllib.request import urlopen >>> with urlopen('http://worldtimeapi.org/api/timezone/etc/UTC.txt') as response: ... for line in response: ... line = line.decode() # Convert bytes to a str ... if line.startswith('datetime'): ... print(line.rstrip()) # Remove trailing newline ... datetime: 2022-01-01T01:36:47.689215+00:00 >>> import smtplib >>> server = smtplib.SMTP('localhost') >>> server.sendmail('soothsayer@example.org', 'jcaesar@example.org', ... """To: jcaesar@example.org ... From: soothsayer@example.org ... ... Beware the Ides of March. ... """) >>> server.quit()
ro: >>> from urllib.request import urlopen >>> with urlopen( ... 'http://worldtimeapi.org/api/timezone/Europe/Bucharest.txt') as răspunsul: ... for rândul in răspunsul: ... # Convertește octeți în șir de caractere: ... rândul = rândul.decode() ... if rândul.startswith('datetime'): ... # Elimină rândul gol de la final: ... print(rândul.rstrip()) ... datetime: 2022-01-01T01:36:47.689215+00:00 >>> import smtplib >>> serverul_de_poștă = smtplib.SMTP('localhost') >>> serverul_de_poștă.sendmail('profetul@de_exemplu.org', ... 'iuliu_cezar@de_exemplu.org', ... """To: iuliu_cezar@de_exemplu.org ... From: profetul@de_exemplu.org ... ... Bagă de seamă sunt Idele lui Martie! ... """) >>> serverul_de_poștă.quit()

source: (Note that the second example needs a mailserver running on localhost.)
ro: (Atenție, la cel de-al doilea exemplu veți avea nevoie de un server de poștă electronică instalat pe *localhost*.)

source: Dates and Times
ro: Date calendaristice și momente de timp

source: The :mod:`datetime` module supplies classes for manipulating dates and times in both simple and complex ways. While date and time arithmetic is supported, the focus of the implementation is on efficient member extraction for output formatting and manipulation. The module also supports objects that are timezone aware. ::
ro: Modulul :mod:`datetime` ne furnizează clase pentru manevrarea datelor calendaristice și a momentelor de timp atât în moduri simple cât și în feluri sofisticate. Deși calculul aritmetic cu date calendaristice și momente de timp este suportat, implementarea se concentrează pe extracția eficientă a componentelor (datelor temporale) în scopuri de formatare și de manipulare a afișărilor. Modulul suportă inclusiv obiecte care înțeleg `fusurile orare <https://ro.wikipedia.org/wiki/Fus_orar>`_ (de la englezescul, ca jargon informatic, *timezone*). ::

source: >>> # dates are easily constructed and formatted >>> from datetime import date >>> now = date.today() >>> now datetime.date(2003, 12, 2) >>> now.strftime("%m-%d-%y. %d %b %Y is a %A on the %d day of %B.") '12-02-03. 02 Dec 2003 is a Tuesday on the 02 day of December.' >>> # dates support calendar arithmetic >>> birthday = date(1964, 7, 31) >>> age = now - birthday >>> age.days 14368
ro: >>> # datele calendaristice se construiesc și se formatează ușor >>> from datetime import date >>> acum = date.today() >>> acum datetime.date(2025, 7, 25) >>> # evităm impunerea unor "locale" în Windows: >>> acum.strftime("%d-%m-%y. %d %b %Y pică %A în ziua %d a lui %B.") '25-07-25. 25 Jul 2025 pică Friday în ziua 25 a lui July.' >>> # datele calendaristice suportă aritmetica de calendar >>> ziua_de_naștere = date(1964, 7, 31) >>> vârsta = acum - ziua_de_naștere >>> vârsta.days 22274

source: Data Compression
ro: Compresia datelor

source: Common data archiving and compression formats are directly supported by modules including: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::
ro: Formatele tipice de compresie și de arhivare a datelor sunt suportate în mod direct de către module precum: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` și :mod:`tarfile`. ::

source: >>> import zlib >>> s = b'witch which has which witches wrist watch' >>> len(s) 41 >>> t = zlib.compress(s) >>> len(t) 37 >>> zlib.decompress(t) b'witch which has which witches wrist watch' >>> zlib.crc32(s) 226805979
ro: >>> import zlib >>> șirul = b'arac brac capac colac copac crac drac fac lac mac tac'\ ... b' toc trac' >>> len(șirul) 62 >>> șirul_comprimat = zlib.compress(șirul) >>> len(șirul_comprimat) 44 >>> zlib.decompress(șirul_comprimat) b'arac brac capac colac copac crac drac fac lac mac tac toc trac' >>> zlib.crc32(șirul) 2525718583

source: Performance Measurement
ro: Măsurarea performanțelor

source: Some Python users develop a deep interest in knowing the relative performance of different approaches to the same problem. Python provides a measurement tool that answers those questions immediately.
ro: Nu de puține ori, programatorii se interesează de compararea performanțelor pe care le dovedesc diferitele abordări (cunoscute) ale aceleași probleme (de programare). Python-ul ne furnizează o unealtă de măsurare (a timpului de execuție) care poate satisface rapid aceste curiozități.

source: For example, it may be tempting to use the tuple packing and unpacking feature instead of the traditional approach to swapping arguments. The :mod:`timeit` module quickly demonstrates a modest performance advantage::
ro: De exemplu, putem fi tentați, la un moment dat, să întrebuințăm împachetarea și despachetarea tuplurilor în locul abordării tradiționale la interschimbarea (de la englezescul *swapping*) unor valori. Modulul :mod:`timeit` ne dovedește imediat că folosirea tuplurilor ne va conferi un mic avantaj::

source: In contrast to :mod:`timeit`'s fine level of granularity, the :mod:`profile` and :mod:`pstats` modules provide tools for identifying time critical sections in larger blocks of code.
ro: Spre deosebire de nivelul de granularitate (ridicat) al lui :mod:`timeit`, care îl face potrivit pe acesta pentru analiza unor fragmente mici de cod, modulele :mod:`profile` și :mod:`pstats` posedă unelte pentru identificarea zonelor critice în privința timpului de execuție din blocuri (mai) mari de cod Python.

source: Quality Control
ro: Controlul calității

source: One approach for developing high quality software is to write tests for each function as it is developed and to run those tests frequently during the development process.
ro: Una din căile care ne conduc la producerea *software*-ului de înaltă calitate este cea de *a compune teste* pentru verificarea fiecărei *funcții* (funcționalități) pe parcursul implementării ei și de *a rula aceste teste* în mod frecvent de-a lungul întregului proces de dezvoltare a produsului software.

source: The :mod:`doctest` module provides a tool for scanning a module and validating tests embedded in a program's docstrings. Test construction is as simple as cutting-and-pasting a typical call along with its results into the docstring. This improves the documentation by providing the user with an example and it allows the doctest module to make sure the code remains true to the documentation::
ro: Modulul :mod:`doctest` ne pune la dispoziție o unealtă care realizează *analiza lexicală* a codului (sau `scanarea <https://en.wikipedia.org/wiki/Lexical_analysis>`_; de la englezescul *scanning*) unui modul și încearcă să *valideze testele* care au fost inserate (de către autorii codului) în docstring-urile acestui modul (program) Python. Prepararea unui asemenea test se rezumă la decuparea-și-lipirea (de la englezescul *cut-and-paste*) în docstring a fragmentului de cod format din apelul tipic al funcției (pe care vrem să o verificăm) împreună cu rezultatul (corect) returnat de acest apel. Astfel, pe de o parte, se îmbunătățește documentația oferindu-i-se utilizatorului unul sau mai multe exemple și, pe de altă parte, existența respectivelor fragmente îi va permite modulului *doctest* să verifice dacă programul pe care utilizatorul îl dezvoltă îi rămâne fidel documentației (inițiale)::

source: def average(values): """Computes the arithmetic mean of a list of numbers. >>> print(average([20, 30, 70])) 40.0 """ return sum(values) / len(values) import doctest doctest.testmod() # automatically validate the embedded tests
ro: >>> def media(valorile): ... """Calculează media aritmetică a unei liste de numere. ... ... >>> print(media([20, 30, 70])) ... 40.0 ... """ ... return sum(valorile) / len(valorile) ... >>> import doctest >>> doctest.testmod() # validează automat testele incluse TestResults(failed=0, attempted=1)

source: The :mod:`unittest` module is not as effortless as the :mod:`doctest` module, but it allows a more comprehensive set of tests to be maintained in a separate file::
ro: Modulul :mod:`unittest` nu este tot atât de fără efort la utilizare precum :mod:`doctest`, însă ne permite să construim un set de teste (mai) comprehensiv pe care să îl putem întreține într-un fișier separat::

source: import unittest class TestStatisticalFunctions(unittest.TestCase): def test_average(self): self.assertEqual(average([20, 30, 70]), 40.0) self.assertEqual(round(average([1, 5, 7]), 1), 4.3) with self.assertRaises(ZeroDivisionError): average([]) with self.assertRaises(TypeError): average(20, 30, 70) unittest.main() # Calling from the command line invokes all tests
ro: import unittest class TesteazăFuncțiileStatistice(unittest.TestCase): def testează_media(self): self.assertEqual(media([20, 30, 70]), 40.0) self.assertEqual(round(media([1, 5, 7]), 1), 4.3) with self.assertRaises(ZeroDivisionError): media([]) with self.assertRaises(TypeError): media(20, 30, 70) unittest.main() # La apelul în linia de comandă vor fi invocate # toate testele

source: Batteries Included
ro: Bateriile sunt incluse

source: Python has a "batteries included" philosophy. This is best seen through the sophisticated and robust capabilities of its larger packages. For example:
ro: Python-ul urmează filozofia "includeți (și) bateriile". Putem observa cu ușurință aceasta dacă aruncăm o privire asupra capabilităților robuste și sofisticate pe care le probează pachetele sale cele mai cuprinzătoare. De pildă:

source: The :mod:`xmlrpc.client` and :mod:`xmlrpc.server` modules make implementing remote procedure calls into an almost trivial task. Despite the modules' names, no direct knowledge or handling of XML is needed.
ro: Modulele :mod:`xmlrpc.client` și :mod:`xmlrpc.server` transformă orice implementare de `apeluri de procedură de la distanță <https://en.wikipedia.org/wiki/Remote_procedure_call>`_ într-o activitate aproape banală. În ciuda numelor acestor module, nu este nevoie nici de cunoștințe teoretice și nici de experință practică privind XML-ul.

source: The :mod:`email` package is a library for managing email messages, including MIME and other :rfc:`2822`-based message documents. Unlike :mod:`smtplib` and :mod:`poplib` which actually send and receive messages, the email package has a complete toolset for building or decoding complex message structures (including attachments) and for implementing internet encoding and header protocols.
ro: Pachetul :mod:`email` este o bibliotecă dedicată administrării mesajelor de poștă electronică, inclusiv a mesageriei documentelor MIME și a altor documente bazate pe :rfc:`2822`. Spre deosebire de :mod:`smtplib` și de :mod:`poplib`, care trimit și primesc efectiv mesajele, pachetul *email* deține un set complet de instrumente pentru construcția și decodificarea structurilor complexe de mesaje (incluzând aici și *anexele*, de la englezescul *attachment*, acestor mesaje), respectiv pentru implementarea protocoalelor de Internet privind codificările (textului) și antetele (mesajelor).

source: The :mod:`json` package provides robust support for parsing this popular data interchange format. The :mod:`csv` module supports direct reading and writing of files in Comma-Separated Value format, commonly supported by databases and spreadsheets. XML processing is supported by the :mod:`xml.etree.ElementTree`, :mod:`xml.dom` and :mod:`xml.sax` packages. Together, these modules and packages greatly simplify data interchange between Python applications and other tools.
ro: Pachetul :mod:`json` oferă suport robust pentru *analiza sintactică și semantică* a codului (sau `parsarea <https://en.wikipedia.org/wiki/Compiler>`_; de la englezescul *parsing*) acestui format popular de interschimbare de date. Modulul :mod:`csv` ne permite citirea și scrierea directă a fișierelor în formatul *valori-separate-prin-virgule* (sau *valori-delimitate-de-virgule*; de la englezescul *comma-separated-value*), format acceptat de majoritatea bazelor de date și a foilor de calcul (de la englezescul *spreadsheet*). Procesările XML sunt suportate de pachetele :mod:`xml.etree.ElementTree`, :mod:`xml.dom` și :mod:`xml.sax`. Laolaltă, aceste module și pachete ușurează considerabil schimburile de date dintre aplicațiile Python și alte unelte informatice.
