Repository: octaG-M/python-docs-ro
Catalog: tutorial/venv.po
Languages: ro

source: Virtual Environments and Packages
ro: Medii virtuale și pachete

source: Introduction
ro: Introducere

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
ro: Aplicațiile Python folosesc adesea pachete și module care nu fac parte din biblioteca standard. În diverse situații, o aplicație necesită o versiune anumită a unei biblioteci, dat fiind că aplicația în cauză se bazează pe faptul că o defecțiune de cod, din bibliotecă, a fost corectată în versiunea respectivă sau, dimpotrivă, codul aplicației a fost realizat cu elemente dintr-o versiune depășită a interfeței bibliotecii în cauză.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
ro: De aceea, se poate întâmpla ca o singură instalare a sistemului Python în calculatorul dumneavoastră să nu poată îndeplini în totalitate cerințele tuturor aplicațiilor pe care intenționați să le folosiți. Dacă, să zicem, aplicația A necesită versiunea 1.0 a modulului *cutare* pe când aplicația B solicită prezența versiunii 2.0 a respectivului modul, atunci cerințele intră în conflict una cu cealaltă, deci, indiferent pe care dintre versiuni am instala-o, una din aplicațiile A, B nu va putea funcționa.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
ro: Soluția unei asemenea probleme este să creăm un :term:`virtual environment`, adică un *arbore* de directoare în care să se găsească o instalare (auto-conținută) completă a sistemului Python corespunzând unei *versiuni* precizate a Python-ului, instalare căreia să îi fie adăugate un număr de pachete de interes particular.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
ro: Astfel, aplicații diferite vor putea fi rulate în medii virtuale diferite. Ca o rezolvare a conflictului de cerințe din exemplul anterior, aplicația A va putea dispune de propriul mediu virtual, în care a fost instalată versiunea 1.0 a modulului respectiv, în timp ce aplicația B va avea la dispoziție alt mediu virtual, cu versiunea 2.0 a aceluiași modul în funcțiune. Presupunând că, în urma unei actualizări, aplicația B va avea nevoie de versiunea 3.0 a unei biblioteci oarecare, instalarea ei nu va afecta în niciun fel mediul aplicației A.

source: Creating Virtual Environments
ro: Crearea de medii virtuale

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will install the Python version from which the command was run (as reported by the :option:`--version` option). For instance, executing the command with ``python3.12`` will install version 3.12.
ro: Modulul întrebuințat la crearea și administrarea *mediilor virtuale* (de *execuție*, de *testare*, șamd.) se numește :mod:`venv`. Acest :mod:`venv` va instala acea versiune de Python pe care o folosim la rularea comenzii de instalare în terminal (și pe care o putem evidenția cu opțiunea :option:`--version`). De exemplu, dacă executăm comanda cu ``python3.12``, se va instala versiunea 3.12.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
ro: Pentru a crea un mediu virtual, decideți-vă asupra unui director în care să îl plasați, apoi rulați modulul :mod:`venv` ca script, furnizându-i calea de acces către directorul convenabil::

source: python -m venv tutorial-env
ro: python -m venv tutorialul_de_python_un_mediu_virtual

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter and various supporting files.
ro: Execuția comenzii (de către interpretor) va crea directorul ``tutorialul_de_python_un_mediu_virtual``, dacă acesta nu există deja, apoi va crea și restul (sub)directoarelor sale, în care se vor găsi o copie a interpretorului de Python și varii fișiere ajutătoare.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
ro: O alegere frecventă în privința directorului unui mediu virtual este dată de ``.venv``. Un atare nume va face ca directorul să le fie *ascuns* comenzilor interpretorului de comenzi (de la englezescul, ca jargon informatic, *shell*) activ în terminalul din care lucrați și, din acest motiv, să nu le fie obstacol acestora, respectiv el nu va avea nevoie de explicații despre motivul pentru care există (atunci când, la câteva luni de la ultima sa folosire, veți fi uitat că face parte din sistemul de directoare). În plus, alegerea acestui nume va elimina potențialele conflicte cu fișierele ``.env``, care conțin definițiile unor variabile de mediu, cerute de diverse unelte informatice.

source: Once you've created a virtual environment, you may activate it.
ro: De îndată ce ați creat un mediu virtual, îl puteți *activa*.

source: On Windows, run::
ro: În Windows, rulați::

source: tutorial-env\Scripts\activate
ro: tutorialul_de_python_un_mediu_virtual\Scripts\activate

source: On Unix or MacOS, run::
ro: În Unix sau MacOS, rulați::

source: source tutorial-env/bin/activate
ro: source tutorialul_de_python_un_mediu_virtual/bin/activate

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
ro: (Acest script de activare a fost scris pentru interpretorul de comenzi *bash*. Dacă îl folosiți ca interpretor fie pe :program:`csh` fie pe :program:`fish`, atunci va trebui să utilizați scripturile corespunzătoare, ``activate.csh`` ori ``activate.fish``.)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
ro: Activarea mediului virtual va schimba *promptul* interpretorului de comenzi pe care îl întrebuințați în terminal pentru a vă informa ce mediu virtual este în funcțiune, respectiv va modifica mediul pentru ca rularea comenzii ``python`` să vă conducă chiar la versiunea (special) instalată de Python cu care doriți să lucrați. De exemplu:

source: $ source ~/envs/tutorial-env/bin/activate (tutorial-env) $ python Python 3.5.1 (default, May 6 2016, 10:59:36) ... >>> import sys >>> sys.path ['', '/usr/local/lib/python35.zip', ..., '~/envs/tutorial-env/lib/python3.5/site-packages'] >>>
ro: $ source ~/envs/tutorialul_de_python_un_mediu_virtual/bin/activate (tutorialul_de_python_un_mediu_virtual) $ python Python 3.5.1 (default, May 6 2016, 10:59:36) ... >>> import sys >>> sys.path ['', '/usr/local/lib/python35.zip', ..., '~/envs/tutorialul_de_python_un_mediu_virtual/lib/python3.5/site-packages'] >>>

source: To deactivate a virtual environment, type::
ro: Pentru a *dezactiva* un mediu virtual, tastați::

source: into the terminal.
ro: în (linia de comandă din) terminal.

source: Managing Packages with pip
ro: Administrarea pachetelor cu pip

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the `Python Package Index <https://pypi.org>`_. You can browse the Python Package Index by going to it in your web browser.
ro: Putem instala, actualiza și elimina pachete cu ajutorul unui program intitulat :program:`pip`. În mod prestabilit, ``pip`` instalează pachete preluate din `Python Package Index <https://pypi.org>`_ (adică, *PyPI*; Catalogul pachetelor Python). Pentru a putea răsfoi catalogul, este suficient să îi vizitați pagina *web*.

source: ``pip`` has a number of subcommands: "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
ro: ``pip`` are un număr de sub-comenzi (cu sintaxa *pip nume_de_subcomandă*): "install", "uninstall", "freeze", șamd. (Consultați ghidul :ref:`installing-index` pentru o documentație amănunțită referitoare la ``pip``.)

source: You can install the latest version of a package by specifying a package's name:
ro: Puteți instala cea mai recentă versiune a unui pachet (precum *novas*) specificându-i numele în comanda:

source: (tutorial-env) $ python -m pip install novas Collecting novas Downloading novas-3.1.1.3.tar.gz (136kB) Installing collected packages: novas Running setup.py install for novas Successfully installed novas-3.1.1.3
ro: (tutorialul_de_python_un_mediu_virtual) $ python -m pip install novas Collecting novas Downloading novas-3.1.1.3.tar.gz (136kB) Installing collected packages: novas Running setup.py install for novas Successfully installed novas-3.1.1.3

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
ro: De asemeni, puteți instala o anumită versiune a unui pachet (*requests*) introducându-i numele (în comandă), urmat de un ``==`` și de numărul versiunii dorite:

source: (tutorial-env) $ python -m pip install requests==2.6.0 Collecting requests==2.6.0 Using cached requests-2.6.0-py2.py3-none-any.whl Installing collected packages: requests Successfully installed requests-2.6.0
ro: (tutorialul_de_python_un_mediu_virtual) $ python -m pip install requests==2.6.0 Collecting requests==2.6.0 Using cached requests-2.6.0-py2.py3-none-any.whl Installing collected packages: requests Successfully installed requests-2.6.0

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``python -m pip install --upgrade`` to upgrade the package to the latest version:
ro: În caz că re-executați comanda, ``pip`` vă va informa că versiunea solicitată este deja instalată, după care nu va mai face nimic. Desigur, pentru a instala altă versiune (a aceluiași pachet), va fi nevoie să îi introduceți numărul (de versiune) sau veți putea rula comanda ``python -m pip install --upgrade`` pentru a *actualiza* pachetul, punându-i în uz cea mai recentă versiune:

source: (tutorial-env) $ python -m pip install --upgrade requests Collecting requests Installing collected packages: requests Found existing installation: requests 2.6.0 Uninstalling requests-2.6.0: Successfully uninstalled requests-2.6.0 Successfully installed requests-2.7.0
ro: (tutorialul_de_python_un_mediu_virtual) $ python -m pip install --upgrade requests Collecting requests Installing collected packages: requests Found existing installation: requests 2.6.0 Uninstalling requests-2.6.0: Successfully uninstalled requests-2.6.0 Successfully installed requests-2.7.0

source: ``python -m pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
ro: ``python -m pip uninstall`` urmat de unul ori de mai multe nume de pachete va elimina, în urma execuției, pachetele respective din mediul virtual.

source: ``python -m pip show`` will display information about a particular package:
ro: ``python -m pip show`` va afișa informații despre un pachet precizat:

source: (tutorial-env) $ python -m pip show requests --- Metadata-Version: 2.0 Name: requests Version: 2.7.0 Summary: Python HTTP for Humans. Home-page: http://python-requests.org Author: Kenneth Reitz Author-email: me@kennethreitz.com License: Apache 2.0 Location: /Users/akuchling/envs/tutorial-env/lib/python3.4/site-packages Requires:
ro: (tutorialul_de_python_un_mediu_virtual) $ python -m pip show requests --- Metadata-Version: 2.0 Name: requests Version: 2.7.0 Summary: Python HTTP for Humans. Home-page: http://python-requests.org Author: Kenneth Reitz Author-email: me@kennethreitz.com License: Apache 2.0 Location: /Users/akuchling/envs/tutorialul_de_python_un_mediu_virtual/lib/python3.4/site-packages Requires:

source: ``python -m pip list`` will display all of the packages installed in the virtual environment:
ro: ``python -m pip list`` va afișa toate pachetele instalate în mediul virtual:

source: (tutorial-env) $ python -m pip list novas (3.1.1.3) numpy (1.9.2) pip (7.0.3) requests (2.7.0) setuptools (16.0)
ro: (tutorialul_de_python_un_mediu_virtual) $ python -m pip list novas (3.1.1.3) numpy (1.9.2) pip (7.0.3) requests (2.7.0) setuptools (16.0)

source: ``python -m pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``python -m pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
ro: ``python -m pip freeze`` va produce o listă asemănătoare celei de deasupra, cu excepția faptului că formatul acestei liste este identic celui solicitat de comanda ``python -m pip install``. O convenție populară ne spune că lista produsă de *freeze* trebuie să fie salvată într-un fișier text cu nume sugestiv, precum ``cerințe.txt``:

source: (tutorial-env) $ python -m pip freeze > requirements.txt (tutorial-env) $ cat requirements.txt novas==3.1.1.3 numpy==1.9.2 requests==2.7.0
ro: (tutorialul_de_python_un_mediu_virtual) $ python -m pip freeze > cerințe.txt (tutorialul_de_python_un_mediu_virtual) $ cat cerințe.txt novas==3.1.1.3 numpy==1.9.2 requests==2.7.0

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
ro: În această situație, fișierul ``cerințe.txt`` va putea fi *comis* către (baza de date a platformei de ) controlul versiunii, respectiv livrat (către beneficiari) ca parte a aplicației construite de dumneavoastră. Drept urmare, utilizatorii acesteia vor putea să își instaleze pachetele de care are nevoie aplicația folosind ``install -r``:

source: (tutorial-env) $ python -m pip install -r requirements.txt Collecting novas==3.1.1.3 (from -r requirements.txt (line 1)) ... Collecting numpy==1.9.2 (from -r requirements.txt (line 2)) ... Collecting requests==2.7.0 (from -r requirements.txt (line 3)) ... Installing collected packages: novas, numpy, requests Running setup.py install for novas Successfully installed novas-3.1.1.3 numpy-1.9.2 requests-2.7.0
ro: (tutorialul_de_python_un_mediu_virtual) $ python -m pip install -r cerințe.txt Collecting novas==3.1.1.3 (from -r cerințe.txt (line 1)) ... Collecting numpy==1.9.2 (from -r cerințe.txt (line 2)) ... Collecting requests==2.7.0 (from -r cerințe.txt (line 3)) ... Installing collected packages: novas, numpy, requests Running setup.py install for novas Successfully installed novas-3.1.1.3 numpy-1.9.2 requests-2.7.0

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the `Python packaging user guide`_.
ro: ``pip`` are numeroase alte opțiuni. Consultați ghidul :ref:`installing-index` pentru documentația elaborată a lui ``pip``. Dacă ați construit deja un pachet Python și doriți să îl faceți disponibil în catalogul PyPI, vă recomandăm să parcurgeți materialul `Python packaging user guide`_.
