Repository: octaG-M/python-docs-ro
Catalog: tutorial/whatnow.po
Languages: ro

source: What Now?
ro: Și acum?

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
ro: Parcurgerea acestui tutorial a reușit, probabil, să vă mențină treaz interesul privind folosirea Python-ului --- sunteți nerăbdător să-l întrebuințați la rezolvarea unor probleme *din viața reală* care vă preocupă. Așadar, de unde să aflați restul (trucurilor)?

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
ro: Tutorialul de față este parte din ansamblul documentației Python. Alte documente ale acesteia sunt:

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
ro: Merită să răsfoiți acest manual, care vă oferă informații cuprinzătoare (deși scrise anost) despre tipurile (de date), funcțiile și modulele din biblioteca standard. Orice *distribuție* tipică a sistemului Python include un *munte* de cod suplimentar (în afara frânturilor despre care am discutat deja). Astfel, există module care citesc cutiile poștale Unix, care obțin documente prin intermediul protocolului HTTP, care generează numere aleatoare, care parsează opțiunile date în linia de comandă, care comprimă datele, precum și multe altele. Chiar și dacă treceți în fugă prin Referința (bibliotecii standard) și tot veți reuși să vă faceți o idee despre ce aveți la dispoziție.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
ro: :ref:`installing-index` vă lămurește cum să instalați module diverse, scrise de alți utilizatori de Python.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
ro: :ref:`reference-index`: O explicație detaliată a sintaxei și a semanticii limbajului de programare Python. Este o lectură dificilă, însă utilă ca sursă completă a (informațiilor dedicate) însuși limbajului de programare.

source: More Python resources:
ro: Alte resurse de Python:

source: https://www.python.org: The major Python web site. It contains code, documentation, and pointers to Python-related pages around the web.
ro: https://www.python.org: Site-ul *web* principal al Python-ului. Găsiți aici fragmente de cod, documentație, respectiv *pointeri* către pagini de Internet de pretutindeni, dedicate, cu toatele, Python-ului.

source: https://docs.python.org: Fast access to Python's documentation.
ro: https://docs.python.org: Acces rapid la documentația Python-ului.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
ro: https://pypi.org: Catalogul pachetelor Python (PyPI), cel poreclit mai demult *Magazinul de brânzeturi* [#]_, este un catalog al modulelor create de utilizatori, module pe care le puteți descărca (fără probleme). De îndată ce veți începe, dumneavoastră înșivă, să publicați cod (Python), îl veți putea înregistra aici spre a fi găsit ușor de doritori.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
ro: https://code.activestate.com/recipes/langs/python/: Rețetarul Python este o colecție de mari dimensiuni de exemple de cod, de module masive, ca și de stripturi utile. Contribuțiile realmente remarcabile au fost colectate într-o carte intitulată chiar așa, Rețetarul Python (Python Cookbook; O'Reilly & Associates, ISBN 0-596-00797-3).

source: https://pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
ro: https://pyvideo.org colecționează *hiperlegături* (sau *hiperlink*-uri; de la englezescul, ca jargon informatic, *hyperlink*) către înregistrări video relative la Python, provenite de la conferințe și de la întâlniri ale grupurilor de utilizatori.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
ro: https://scipy.org: Proiectul Scientific Python (Python-ul științific) cuprinde module de calcul și de prelucrare rapidă a matricelor, respectiv o pleiadă de pachete privind chestiuni precum algebra liniară, transformările Fourier, *solver*-ele (sau *rezolvitoarele*) neliniare, distribuțiile de numere aleatoare, analiza statistică (a datelor) și altele asemenea.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
ro: Dacă aveți întrebări legate de Python ori raportări despre erori survenite în lucrul cu acesta, fie le puteți posta în *grupul de știri* (de la englezescul, ca jargon informatic, *newsgroup*) :newsgroup:`comp.lang.python` fie le puteți trimite pe *lista de discuții* (de la englezescul, ca jargon informatic, *mailing list*) de la python-list@python.org. Grupul de știri și lista de discuții sunt în legătură (prin *porți de acces*; de la englezescul, ca jargon informatic, *gateway*), astfel că mesajele ajunse la una din ele îi vor fi transmise mai departe, în mod automat, și celeilalte. În fiecare zi apar sute de postări, cu întrebări (și răspunsuri), cu propuneri de caracteristici (noi), respectiv cu anunțuri de module (noi). Arhivele listelor de discuții sunt disponibile la https://mail.python.org/pipermail/.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
ro: Înainte să postați, nu uitați să parcurgeți lista :ref:`Întrebări adresate frecvent <faq-index>` (denumită, pe scurt, FAQ). Răspunsurile din FAQ lămuresc multe din chestiunile ridicate de întrebările care reapar periodic, deci se prea poate ca ele să conțină și vreo soluție la problema cu care tocmai vă confruntați.

source: Footnotes
ro: Note de subsol

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
ro: "Cheese Shop" (Magazinul de brânzeturi) este un scheci al trupei Monty Python: un client intră într-un magazin de brânzeturi în căutarea unei delicatese, doar că, indiferent despre ce fel de brânză se interesează, vânzătorul îl informează ritos că s-a terminat.
